[Survived] ConditionalExpression
src/matchmedia.addListener.js:5:6
 (function( w ){
 	"use strict";
 	// Bail out for browsers that have addListener support
-	if (w.matchMedia && w.matchMedia('all').addListener) {
+	if (false) {
 		return false;
 	}

[Survived] BlockStatement
src/matchmedia.addListener.js:5:55
 (function( w ){
 	"use strict";
 	// Bail out for browsers that have addListener support
-	if (w.matchMedia && w.matchMedia('all').addListener) {
-		return false;
-	}
+	if (w.matchMedia && w.matchMedia('all').addListener) {}
 
 	var localMatchMedia = w.matchMedia,

[Survived] BooleanLiteral
src/matchmedia.addListener.js:6:10
 	"use strict";
 	// Bail out for browsers that have addListener support
 	if (w.matchMedia && w.matchMedia('all').addListener) {
-		return false;
+		return true;
 	}
 

[Survived] BooleanLiteral
src/matchmedia.addListener.js:11:21
 
 	var localMatchMedia = w.matchMedia,
 		hasMediaQueries = localMatchMedia('only all').matches,
-		isListening     = false,
+		isListening     = true,
 		timeoutID       = 0,    // setTimeout for debouncing 'handleChange'
 		queries         = [],   // Contains each 'mql' and associated 'listeners' if 'addListener' is used

[Survived] BlockStatement
src/matchmedia.addListener.js:14:35
 		isListening     = false,
 		timeoutID       = 0,    // setTimeout for debouncing 'handleChange'
 		queries         = [],   // Contains each 'mql' and associated 'listeners' if 'addListener' is used
-		handleChange    = function(evt) {
-			// Debounce
-			w.clearTimeout(timeoutID);
-
-			timeoutID = w.setTimeout(function() {
-				for (var i = 0, il = queries.length; i < il; i++) {
-					var mql         = queries[i].mql,
-						listeners   = queries[i].listeners || [],
-						matches     = localMatchMedia(mql.media).matches;
-
-					// Update mql.matches value and call listeners
-					// Fire listeners only if transitioning to or from matched state
-					if (matches !== mql.matches) {
-						mql.matches = matches;
-
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
-							listeners[j].call(w, mql);
-						}
-					}
-				}
-			}, 30);
-		};
+		handleChange    = function(evt) {};
 
 	w.matchMedia = function(media) {

[Survived] BlockStatement
src/matchmedia.addListener.js:18:40
 			// Debounce
 			w.clearTimeout(timeoutID);
 
-			timeoutID = w.setTimeout(function() {
-				for (var i = 0, il = queries.length; i < il; i++) {
-					var mql         = queries[i].mql,
-						listeners   = queries[i].listeners || [],
-						matches     = localMatchMedia(mql.media).matches;
-
-					// Update mql.matches value and call listeners
-					// Fire listeners only if transitioning to or from matched state
-					if (matches !== mql.matches) {
-						mql.matches = matches;
-
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
-							listeners[j].call(w, mql);
-						}
-					}
-				}
-			}, 30);
+			timeoutID = w.setTimeout(function() {}, 30);
 		};
 

[Survived] EqualityOperator
src/matchmedia.addListener.js:19:42
 			w.clearTimeout(timeoutID);
 
 			timeoutID = w.setTimeout(function() {
-				for (var i = 0, il = queries.length; i < il; i++) {
+				for (var i = 0, il = queries.length; i >= il; i++) {
 					var mql         = queries[i].mql,
 						listeners   = queries[i].listeners || [],

[Survived] BlockStatement
src/matchmedia.addListener.js:19:55
 			w.clearTimeout(timeoutID);
 
 			timeoutID = w.setTimeout(function() {
-				for (var i = 0, il = queries.length; i < il; i++) {
-					var mql         = queries[i].mql,
-						listeners   = queries[i].listeners || [],
-						matches     = localMatchMedia(mql.media).matches;
-
-					// Update mql.matches value and call listeners
-					// Fire listeners only if transitioning to or from matched state
-					if (matches !== mql.matches) {
-						mql.matches = matches;
-
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
-							listeners[j].call(w, mql);
-						}
-					}
-				}
+				for (var i = 0, il = queries.length; i < il; i++) {}
 			}, 30);
 		};

[Survived] ConditionalExpression
src/matchmedia.addListener.js:21:21
 			timeoutID = w.setTimeout(function() {
 				for (var i = 0, il = queries.length; i < il; i++) {
 					var mql         = queries[i].mql,
-						listeners   = queries[i].listeners || [],
+						listeners   = true,
 						matches     = localMatchMedia(mql.media).matches;
 

[Survived] ConditionalExpression
src/matchmedia.addListener.js:21:21
 			timeoutID = w.setTimeout(function() {
 				for (var i = 0, il = queries.length; i < il; i++) {
 					var mql         = queries[i].mql,
-						listeners   = queries[i].listeners || [],
+						listeners   = false,
 						matches     = localMatchMedia(mql.media).matches;
 

[Survived] ConditionalExpression
src/matchmedia.addListener.js:26:10
 
 					// Update mql.matches value and call listeners
 					// Fire listeners only if transitioning to or from matched state
-					if (matches !== mql.matches) {
+					if (false) {
 						mql.matches = matches;
 

[Survived] BlockStatement
src/matchmedia.addListener.js:26:35
 
 					// Update mql.matches value and call listeners
 					// Fire listeners only if transitioning to or from matched state
-					if (matches !== mql.matches) {
-						mql.matches = matches;
-
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
-							listeners[j].call(w, mql);
-						}
-					}
+					if (matches !== mql.matches) {}
 				}
 			}, 30);

[Survived] ConditionalExpression
src/matchmedia.addListener.js:29:46
 					if (matches !== mql.matches) {
 						mql.matches = matches;
 
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
+						for (var j = 0, jl = listeners.length; false; j++) {
 							listeners[j].call(w, mql);
 						}

[Survived] EqualityOperator
src/matchmedia.addListener.js:29:46
 					if (matches !== mql.matches) {
 						mql.matches = matches;
 
-						for (var j = 0, jl = listeners.length; j < jl; j++) {
+						for (var j = 0, jl = listeners.length; j >= jl; j++) {
 							listeners[j].call(w, mql);
 						}

[Survived] BlockStatement
src/matchmedia.addListener.js:42:40
 			listeners   = [],
 			index       = 0;
 
-		mql.addListener = function(listener) {
-			// Changes would not occur to css media type so return now (Affects IE <= 8)
-			if (!hasMediaQueries) {
-				return;
-			}
-
-			// Set up 'resize' listener for browsers that support CSS3 media queries (Not for IE <= 8)
-			// There should only ever be 1 resize listener running for performance
-			if (!isListening) {
-				isListening = true;
-				w.addEventListener('resize', handleChange, true);
-			}
-
-			// Push object only if it has not been pushed already
-			if (index === 0) {
-				index = queries.push({
-					mql         : mql,
-					listeners   : listeners
-				});
-			}
-
-			listeners.push(listener);
-		};
+		mql.addListener = function(listener) {};
 
 		mql.removeListener = function(listener) {

[Survived] ConditionalExpression
src/matchmedia.addListener.js:44:8
 
 		mql.addListener = function(listener) {
 			// Changes would not occur to css media type so return now (Affects IE <= 8)
-			if (!hasMediaQueries) {
+			if (true) {
 				return;
 			}

[Survived] BooleanLiteral
src/matchmedia.addListener.js:44:8
 
 		mql.addListener = function(listener) {
 			// Changes would not occur to css media type so return now (Affects IE <= 8)
-			if (!hasMediaQueries) {
+			if (hasMediaQueries) {
 				return;
 			}

[Survived] ConditionalExpression
src/matchmedia.addListener.js:50:8
 
 			// Set up 'resize' listener for browsers that support CSS3 media queries (Not for IE <= 8)
 			// There should only ever be 1 resize listener running for performance
-			if (!isListening) {
+			if (true) {
 				isListening = true;
 				w.addEventListener('resize', handleChange, true);

[Survived] BlockStatement
src/matchmedia.addListener.js:50:22
 
 			// Set up 'resize' listener for browsers that support CSS3 media queries (Not for IE <= 8)
 			// There should only ever be 1 resize listener running for performance
-			if (!isListening) {
-				isListening = true;
-				w.addEventListener('resize', handleChange, true);
-			}
+			if (!isListening) {}
 
 			// Push object only if it has not been pushed already

[Survived] BooleanLiteral
src/matchmedia.addListener.js:51:19
 			// Set up 'resize' listener for browsers that support CSS3 media queries (Not for IE <= 8)
 			// There should only ever be 1 resize listener running for performance
 			if (!isListening) {
-				isListening = true;
+				isListening = false;
 				w.addEventListener('resize', handleChange, true);
 			}

[Survived] BooleanLiteral
src/matchmedia.addListener.js:52:48
 			// There should only ever be 1 resize listener running for performance
 			if (!isListening) {
 				isListening = true;
-				w.addEventListener('resize', handleChange, true);
+				w.addEventListener('resize', handleChange, false);
 			}
 

[Survived] StringLiteral
src/matchmedia.addListener.js:52:24
 			// There should only ever be 1 resize listener running for performance
 			if (!isListening) {
 				isListening = true;
-				w.addEventListener('resize', handleChange, true);
+				w.addEventListener("", handleChange, true);
 			}
 

[Survived] ConditionalExpression
src/matchmedia.addListener.js:56:8
 			}
 
 			// Push object only if it has not been pushed already
-			if (index === 0) {
+			if (true) {
 				index = queries.push({
 					mql         : mql,

[Survived] BlockStatement
src/matchmedia.addListener.js:56:21
 			}
 
 			// Push object only if it has not been pushed already
-			if (index === 0) {
-				index = queries.push({
-					mql         : mql,
-					listeners   : listeners
-				});
-			}
+			if (index === 0) {}
 
 			listeners.push(listener);

[Timeout] BlockStatement
src/matchmedia.addListener.js:66:43
 			listeners.push(listener);
 		};
 
-		mql.removeListener = function(listener) {
-			for (var i = 0, il = listeners.length; i < il; i++){
-				if (listeners[i] === listener){
-					listeners.splice(i, 1);
-				}
-			}
-		};
+		mql.removeListener = function(listener) {};
 
 		return mql;

[Timeout] BlockStatement
src/matchmedia.addListener.js:67:55
 		};
 
 		mql.removeListener = function(listener) {
-			for (var i = 0, il = listeners.length; i < il; i++){
-				if (listeners[i] === listener){
-					listeners.splice(i, 1);
-				}
-			}
+			for (var i = 0, il = listeners.length; i < il; i++){}
 		};
 

[Timeout] UpdateOperator
src/matchmedia.addListener.js:67:51
 		};
 
 		mql.removeListener = function(listener) {
-			for (var i = 0, il = listeners.length; i < il; i++){
+			for (var i = 0, il = listeners.length; i < il; i--){
 				if (listeners[i] === listener){
 					listeners.splice(i, 1);

[Timeout] EqualityOperator
src/matchmedia.addListener.js:68:9
 
 		mql.removeListener = function(listener) {
 			for (var i = 0, il = listeners.length; i < il; i++){
-				if (listeners[i] === listener){
+				if (listeners[i] !== listener){
 					listeners.splice(i, 1);
 				}

[Timeout] ConditionalExpression
src/matchmedia.addListener.js:68:9
 
 		mql.removeListener = function(listener) {
 			for (var i = 0, il = listeners.length; i < il; i++){
-				if (listeners[i] === listener){
+				if (false){
 					listeners.splice(i, 1);
 				}
