[Survived] ConditionalExpression
src/respond.js:230:8
 				useMedia = !ql && media;
 
 			//if path exists, tack on trailing slash
-			if( href.length ){ href += "/"; }
+			if( false ){ href += "/"; }
 
 			//if no internal queries exist, but media attr does, use that

[Timeout] BlockStatement
src/respond.js:236:18
 			//note: this currently lacks support for situations where a media attr is specified on a link AND
 				//its associated stylesheet has internal CSS media queries.
 				//In those cases, the media attribute will currently be ignored.
-			if( useMedia ){
-				ql = 1;
-			}
+			if( useMedia ){}
 
 			for( var i = 0; i < ql; i++ ){

[Survived] ConditionalExpression
src/respond.js:236:8
 			//note: this currently lacks support for situations where a media attr is specified on a link AND
 				//its associated stylesheet has internal CSS media queries.
 				//In those cases, the media attribute will currently be ignored.
-			if( useMedia ){
+			if( false ){
 				ql = 1;
 			}

[Timeout] EqualityOperator
src/respond.js:240:20
 				ql = 1;
 			}
 
-			for( var i = 0; i < ql; i++ ){
+			for( var i = 0; i <= ql; i++ ){
 				var fullq, thisq, eachq, eql;
 

[Timeout] ConditionalExpression
src/respond.js:240:20
 				ql = 1;
 			}
 
-			for( var i = 0; i < ql; i++ ){
+			for( var i = 0; false; i++ ){
 				var fullq, thisq, eachq, eql;
 

[Survived] ConditionalExpression
src/respond.js:244:9
 				var fullq, thisq, eachq, eql;
 
 				//media attr
-				if( useMedia ){
+				if( false ){
 					fullq = media;
 					rules.push( repUrls( styles ) );

[Survived] BlockStatement
src/respond.js:244:19
 				var fullq, thisq, eachq, eql;
 
 				//media attr
-				if( useMedia ){
-					fullq = media;
-					rules.push( repUrls( styles ) );
-				}
+				if( useMedia ){}
 				//parse for styles
 				else{

[Survived] BlockStatement
src/respond.js:249:9
 					rules.push( repUrls( styles ) );
 				}
 				//parse for styles
-				else{
-					fullq = qs[ i ].match( respond.regex.findStyles ) && RegExp.$1;
-					rules.push( RegExp.$2 && repUrls( RegExp.$2 ) );
-				}
+				else{}
 
 				eachq = fullq.split( "," );

[Timeout] ConditionalExpression
src/respond.js:250:14
 				}
 				//parse for styles
 				else{
-					fullq = qs[ i ].match( respond.regex.findStyles ) && RegExp.$1;
+					fullq = false;
 					rules.push( RegExp.$2 && repUrls( RegExp.$2 ) );
 				}

[Timeout] ConditionalExpression
src/respond.js:250:14
 				}
 				//parse for styles
 				else{
-					fullq = qs[ i ].match( respond.regex.findStyles ) && RegExp.$1;
+					fullq = true;
 					rules.push( RegExp.$2 && repUrls( RegExp.$2 ) );
 				}

[Survived] LogicalOperator
src/respond.js:251:18
 				//parse for styles
 				else{
 					fullq = qs[ i ].match( respond.regex.findStyles ) && RegExp.$1;
-					rules.push( RegExp.$2 && repUrls( RegExp.$2 ) );
+					rules.push( RegExp.$2 || repUrls(RegExp.$2) );
 				}
 

[Survived] ConditionalExpression
src/respond.js:251:18
 				//parse for styles
 				else{
 					fullq = qs[ i ].match( respond.regex.findStyles ) && RegExp.$1;
-					rules.push( RegExp.$2 && repUrls( RegExp.$2 ) );
+					rules.push( true );
 				}
 

[Survived] EqualityOperator
src/respond.js:257:21
 				eachq = fullq.split( "," );
 				eql = eachq.length;
 
-				for( var j = 0; j < eql; j++ ){
+				for( var j = 0; j <= eql; j++ ){
 					thisq = eachq[ j ];
 					mediastyles.push( {

[Survived] BlockStatement
src/respond.js:257:35
 				eachq = fullq.split( "," );
 				eql = eachq.length;
 
-				for( var j = 0; j < eql; j++ ){
-					thisq = eachq[ j ];
-					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
-						rules : rules.length - 1,
-						hasquery : thisq.indexOf("(") > -1,
-						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
-						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
-					} );
-				}
+				for( var j = 0; j < eql; j++ ){}
 			}
 

[Survived] LogicalOperator
src/respond.js:260:15
 				for( var j = 0; j < eql; j++ ){
 					thisq = eachq[ j ];
 					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
+						media : thisq.split("(")[0].match(respond.regex.only) || RegExp.$2 || "all",
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,

[Timeout] ConditionalExpression
src/respond.js:260:15
 				for( var j = 0; j < eql; j++ ){
 					thisq = eachq[ j ];
 					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
+						media : true,
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,

[Timeout] ArithmeticOperator
src/respond.js:261:15
 					thisq = eachq[ j ];
 					mediastyles.push( {
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
-						rules : rules.length - 1,
+						rules : rules.length + 1,
 						hasquery : thisq.indexOf("(") > -1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),

[Timeout] UnaryOperator
src/respond.js:262:39
 					mediastyles.push( {
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
 						rules : rules.length - 1,
-						hasquery : thisq.indexOf("(") > -1,
+						hasquery : thisq.indexOf("(") > +1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
 						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )

[Timeout] EqualityOperator
src/respond.js:262:18
 					mediastyles.push( {
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
 						rules : rules.length - 1,
-						hasquery : thisq.indexOf("(") > -1,
+						hasquery : thisq.indexOf("(") <= -1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
 						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )

[Timeout] ConditionalExpression
src/respond.js:263:79
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
-						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
+						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( true ),
 						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
 					} );

[Timeout] ConditionalExpression
src/respond.js:263:79
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
-						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
+						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( false ),
 						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
 					} );

[Timeout] ConditionalExpression
src/respond.js:264:14
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
-						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
+						maxw : false
 					} );
 				}

[Timeout] LogicalOperator
src/respond.js:264:14
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
-						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
+						maxw : thisq.match(respond.regex.maxw) || parseFloat(RegExp.$1) + (RegExp.$2 || "")
 					} );
 				}

[Timeout] BlockStatement
src/respond.js:273:28
 		},
 
 		//recurse through request queue, get css text
-		makeRequests = function(){
-			if( requestQueue.length ){
-				var thisRequest = requestQueue.shift();
-
-				ajax( thisRequest.href, function( styles ){
-					translate( styles, thisRequest.href, thisRequest.media );
-					parsedSheets[ thisRequest.href ] = true;
-
-					// by wrapping recursive function call in setTimeout
-					// we prevent "Stack overflow" error in IE7
-					w.setTimeout(function(){ makeRequests(); },0);
-				} );
-			}
-		},
+		makeRequests = function(){},
 
 		//loop stylesheets, send text content to translate

[Timeout] ConditionalExpression
src/respond.js:274:8
 
 		//recurse through request queue, get css text
 		makeRequests = function(){
-			if( requestQueue.length ){
+			if( false ){
 				var thisRequest = requestQueue.shift();
 

[Survived] BlockStatement
src/respond.js:274:29
 
 		//recurse through request queue, get css text
 		makeRequests = function(){
-			if( requestQueue.length ){
-				var thisRequest = requestQueue.shift();
-
-				ajax( thisRequest.href, function( styles ){
-					translate( styles, thisRequest.href, thisRequest.media );
-					parsedSheets[ thisRequest.href ] = true;
-
-					// by wrapping recursive function call in setTimeout
-					// we prevent "Stack overflow" error in IE7
-					w.setTimeout(function(){ makeRequests(); },0);
-				} );
-			}
+			if( requestQueue.length ){}
 		},
 

[Survived] BlockStatement
src/respond.js:277:47
 			if( requestQueue.length ){
 				var thisRequest = requestQueue.shift();
 
-				ajax( thisRequest.href, function( styles ){
-					translate( styles, thisRequest.href, thisRequest.media );
-					parsedSheets[ thisRequest.href ] = true;
-
-					// by wrapping recursive function call in setTimeout
-					// we prevent "Stack overflow" error in IE7
-					w.setTimeout(function(){ makeRequests(); },0);
-				} );
+				ajax( thisRequest.href, function( styles ){} );
 			}
 		},

[Survived] BooleanLiteral
src/respond.js:279:41
 
 				ajax( thisRequest.href, function( styles ){
 					translate( styles, thisRequest.href, thisRequest.media );
-					parsedSheets[ thisRequest.href ] = true;
+					parsedSheets[ thisRequest.href ] = false;
 
 					// by wrapping recursive function call in setTimeout

[Survived] BlockStatement
src/respond.js:283:29
 
 					// by wrapping recursive function call in setTimeout
 					// we prevent "Stack overflow" error in IE7
-					w.setTimeout(function(){ makeRequests(); },0);
+					w.setTimeout(function(){},0);
 				} );
 			}

[Survived] EqualityOperator
src/respond.js:291:20
 		//loop stylesheets, send text content to translate
 		ripCSS = function(){
 
-			for( var i = 0; i < links.length; i++ ){
+			for( var i = 0; i >= links.length; i++ ){
 				var sheet = links[ i ],
 				href = sheet.href,

[Survived] EqualityOperator
src/respond.js:291:20
 		//loop stylesheets, send text content to translate
 		ripCSS = function(){
 
-			for( var i = 0; i < links.length; i++ ){
+			for( var i = 0; i <= links.length; i++ ){
 				var sheet = links[ i ],
 				href = sheet.href,

[Survived] ConditionalExpression
src/respond.js:295:26
 				var sheet = links[ i ],
 				href = sheet.href,
 				media = sheet.media,
-				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
+				isCSS = sheet.rel && true;
 
 				//only links plz and prevent re-parsing

[Survived] EqualityOperator
src/respond.js:295:26
 				var sheet = links[ i ],
 				href = sheet.href,
 				media = sheet.media,
-				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
+				isCSS = sheet.rel && sheet.rel.toLowerCase() !== "stylesheet";
 
 				//only links plz and prevent re-parsing

[Survived] BooleanLiteral
src/respond.js:298:9
 				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
 
 				//only links plz and prevent re-parsing
-				if( !!href && isCSS && !parsedSheets[ href ] ){
+				if( !href && isCSS && !parsedSheets[ href ] ){
 					// selectivizr exposes css through the rawCssText expando
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {

[Survived] LogicalOperator
src/respond.js:298:9
 				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
 
 				//only links plz and prevent re-parsing
-				if( !!href && isCSS && !parsedSheets[ href ] ){
+				if( !!href && isCSS || !parsedSheets[href] ){
 					// selectivizr exposes css through the rawCssText expando
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {

[Survived] LogicalOperator
src/respond.js:300:10
 				//only links plz and prevent re-parsing
 				if( !!href && isCSS && !parsedSheets[ href ] ){
 					// selectivizr exposes css through the rawCssText expando
-					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {
+					if (sheet.styleSheet || sheet.styleSheet.rawCssText) {
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;

[Survived] ConditionalExpression
src/respond.js:300:10
 				//only links plz and prevent re-parsing
 				if( !!href && isCSS && !parsedSheets[ href ] ){
 					// selectivizr exposes css through the rawCssText expando
-					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {
+					if (false) {
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;

[Survived] BooleanLiteral
src/respond.js:302:30
 					// selectivizr exposes css through the rawCssText expando
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {
 						translate( sheet.styleSheet.rawCssText, href, media );
-						parsedSheets[ href ] = true;
+						parsedSheets[ href ] = false;
 					} else {
 						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||

[Survived] BlockStatement
src/respond.js:303:13
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;
-					} else {
-						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
-							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
-							// IE7 doesn't handle urls that start with '//' for ajax request
-							// manually add in the protocol
-							if ( href.substring(0,2) === "//" ) { href = w.location.protocol + href; }
-							requestQueue.push( {
-								href: href,
-								media: media
-							} );
-						}
-					}
+					} else {}
 				}
 			}

[Survived] BooleanLiteral
src/respond.js:304:49
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;
 					} else {
-						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
+						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && base) ||
 							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request

[Survived] ConditionalExpression
src/respond.js:304:11
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;
 					} else {
-						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
-							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
+						if( true ){
 							// IE7 doesn't handle urls that start with '//' for ajax request
 							// manually add in the protocol

[Survived] EqualityOperator
src/respond.js:305:8
 						parsedSheets[ href ] = true;
 					} else {
 						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
-							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
+							href.replace(RegExp.$1, "").split("/")[0] !== w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request
 							// manually add in the protocol

[Survived] BlockStatement
src/respond.js:305:75
 						parsedSheets[ href ] = true;
 					} else {
 						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
-							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
-							// IE7 doesn't handle urls that start with '//' for ajax request
-							// manually add in the protocol
-							if ( href.substring(0,2) === "//" ) { href = w.location.protocol + href; }
-							requestQueue.push( {
-								href: href,
-								media: media
-							} );
-						}
+							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){}
 					}
 				}

[Survived] ArithmeticOperator
src/respond.js:308:53
 							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request
 							// manually add in the protocol
-							if ( href.substring(0,2) === "//" ) { href = w.location.protocol + href; }
+							if ( href.substring(0,2) === "//" ) { href = w.location.protocol - href; }
 							requestQueue.push( {
 								href: href,

[Survived] ConditionalExpression
src/respond.js:308:13
 							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request
 							// manually add in the protocol
-							if ( href.substring(0,2) === "//" ) { href = w.location.protocol + href; }
+							if ( true ) { href = w.location.protocol + href; }
 							requestQueue.push( {
 								href: href,

[Survived] BlockStatement
src/respond.js:330:22
 	respond.getEmValue = getEmValue;
 
 	//adjust on resize
-	function callMedia(){
-		applyMedia( true );
-	}
+	function callMedia(){}
 
 	if( w.addEventListener ){

[Survived] BooleanLiteral
src/respond.js:331:15
 
 	//adjust on resize
 	function callMedia(){
-		applyMedia( true );
+		applyMedia( false );
 	}
 

[Survived] ConditionalExpression
src/respond.js:334:6
 		applyMedia( true );
 	}
 
-	if( w.addEventListener ){
+	if( false ){
 		w.addEventListener( "resize", callMedia, false );
 	}

[Survived] ConditionalExpression
src/respond.js:334:6
 		applyMedia( true );
 	}
 
-	if( w.addEventListener ){
+	if( true ){
 		w.addEventListener( "resize", callMedia, false );
 	}

[Survived] BooleanLiteral
src/respond.js:335:44
 	}
 
 	if( w.addEventListener ){
-		w.addEventListener( "resize", callMedia, false );
+		w.addEventListener( "resize", callMedia, true );
 	}
 	else if( w.attachEvent ){

[Survived] BlockStatement
src/respond.js:337:26
 	if( w.addEventListener ){
 		w.addEventListener( "resize", callMedia, false );
 	}
-	else if( w.attachEvent ){
-		w.attachEvent( "onresize", callMedia );
-	}
+	else if( w.attachEvent ){}
 })(this);
 

[Survived] ConditionalExpression
src/respond.js:337:11
 	if( w.addEventListener ){
 		w.addEventListener( "resize", callMedia, false );
 	}
-	else if( w.attachEvent ){
+	else if( true ){
 		w.attachEvent( "onresize", callMedia );
 	}
