[Survived] BlockStatement
src/respond.js:29:36
 		})(),
 
 		//tweaked Ajax functions from Quirksmode
-		ajax = function( url, callback ) {
-			var req = xmlHttp();
-			if (!req){
-				return;
-			}
-			req.open( "GET", url, true );
-			req.onreadystatechange = function () {
-				if ( req.readyState !== 4 || req.status !== 200 && req.status !== 304 ){
-					return;
-				}
-				callback( req.responseText );
-			};
-			if ( req.readyState === 4 ){
-				return;
-			}
-			req.send( null );
-		},
+		ajax = function( url, callback ) {},
 		isUnsupportedMediaQuery = function( query ) {
 			return query.replace( respond.regex.minmaxwh, '' ).match( respond.regex.other );

[Survived] BlockStatement
src/respond.js:46:47
 			}
 			req.send( null );
 		},
-		isUnsupportedMediaQuery = function( query ) {
-			return query.replace( respond.regex.minmaxwh, '' ).match( respond.regex.other );
-		};
+		isUnsupportedMediaQuery = function( query ) {};
 
 	//expose for testing

[Survived] ObjectLiteral
src/respond.js:54:18
 	respond.ajax = ajax;
 	respond.queue = requestQueue;
 	respond.unsupportedmq = isUnsupportedMediaQuery;
-	respond.regex = {
-		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
-		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
-		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
-		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
-		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
-		only: /(only\s+)?([a-zA-Z]+)\s?/,
-		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,
-		other: /\([^\)]*\)/g
-	};
+	respond.regex = {};
 
 	//expose media query support flag for external use

[Survived] Regex
src/respond.js:55:10
 	respond.queue = requestQueue;
 	respond.unsupportedmq = isUnsupportedMediaQuery;
 	respond.regex = {
-		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
+		media: /@media[^\{]+\{([\{\}]*\{[^\}\{]*\})+/gi,
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,

[Survived] Regex
src/respond.js:55:10
 	respond.queue = requestQueue;
 	respond.unsupportedmq = isUnsupportedMediaQuery;
 	respond.regex = {
-		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
+		media: /@media[^\{]+\{([^\{\}]*\{[\}\{]*\})+/gi,
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,

[Survived] Regex
src/respond.js:57:13
 	respond.regex = {
 		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
-		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
+		comments: /\/\*[^*]*\*+([^/][*]*\*+)*\//gi,
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,

[Survived] Regex
src/respond.js:58:9
 		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
-		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
+		urls: /(url\()['"]?([^\/\)'"][:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,

[Survived] Regex
src/respond.js:58:9
 		media: /@media[^\{]+\{([^\{\}]*\{[^\}\{]*\})+/gi,
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
-		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
+		urls: /(url\()['"]?([\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,

[Survived] Regex
src/respond.js:59:15
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
-		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
+		findStyles: /@media *([^\{]+)\{([^\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,

[Survived] Regex
src/respond.js:59:15
 		keyframes: /@(?:\-(?:o|moz|webkit)\-)?keyframes[^\{]+\{(?:[^\{\}]*\{[^\}\{]*\})+[^\}]*\}/gi,
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
-		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
+		findStyles: /@media *([^\{]+)\{([\S\s])$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,

[Survived] Regex
src/respond.js:60:9
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
-		only: /(only\s+)?([a-zA-Z]+)\s?/,
+		only: /(only\s+)?([a-zA-Z]+)\s/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,

[Survived] Regex
src/respond.js:60:9
 		comments: /\/\*[^*]*\*+([^/][^*]*\*+)*\//gi,
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
-		only: /(only\s+)?([a-zA-Z]+)\s?/,
+		only: /(only\S+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,

[Survived] Regex
src/respond.js:61:9
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
-		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
+		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.])(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,

[Survived] Regex
src/respond.js:61:9
 		urls: /(url\()['"]?([^\/\)'"][^:\)'"]+)['"]?(\))/g,
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
-		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
+		minw: /\(\s*min\-width\s*:\s*(\s*[^0-9\.]+)(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,

[Survived] Regex
src/respond.js:62:9
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
+		maxw: /\(\s*max\-width\s*:\s*(\s*[^0-9\.]+)(px|em)\s*\)/,
 		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,
 		other: /\([^\)]*\)/g

[Survived] Regex
src/respond.js:62:9
 		findStyles: /@media *([^\{]+)\{([\S\s]+?)$/,
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
+		maxw: /\(\s*max\-width\s*:\S*(\s*[0-9\.]+)(px|em)\s*\)/,
 		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,
 		other: /\([^\)]*\)/g

[Survived] Regex
src/respond.js:63:13
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,
+		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s(\s*[0-9\.]+)(px|em)\s*\)/gi,
 		other: /\([^\)]*\)/g
 	};

[Survived] Regex
src/respond.js:63:13
 		only: /(only\s+)?([a-zA-Z]+)\s?/,
 		minw: /\(\s*min\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
 		maxw: /\(\s*max\-width\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/,
-		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\s*[0-9\.]+)(px|em)\s*\)/gi,
+		minmaxwh: /\(\s*m(in|ax)\-(height|width)\s*:\s*(\S*[0-9\.]+)(px|em)\s*\)/gi,
 		other: /\([^\)]*\)/g
 	};

[Survived] ConditionalExpression
src/respond.js:68:50
 	};
 
 	//expose media query support flag for external use
-	respond.mediaQueriesSupported = w.matchMedia && w.matchMedia( "only all" ) !== null && w.matchMedia( "only all" ).matches;
+	respond.mediaQueriesSupported = w.matchMedia && true && w.matchMedia( "only all" ).matches;
 
 	//if media queries are supported, exit here

[Survived] LogicalOperator
src/respond.js:68:34
 	};
 
 	//expose media query support flag for external use
-	respond.mediaQueriesSupported = w.matchMedia && w.matchMedia( "only all" ) !== null && w.matchMedia( "only all" ).matches;
+	respond.mediaQueriesSupported = w.matchMedia || w.matchMedia("only all") !== null && w.matchMedia( "only all" ).matches;
 
 	//if media queries are supported, exit here

[Survived] ConditionalExpression
src/respond.js:71:6
 	respond.mediaQueriesSupported = w.matchMedia && w.matchMedia( "only all" ) !== null && w.matchMedia( "only all" ).matches;
 
 	//if media queries are supported, exit here
-	if( respond.mediaQueriesSupported ){
+	if( false ){
 		return;
 	}

[Survived] ArrayDeclaration
src/respond.js:80:17
 		docElem = doc.documentElement,
 		mediastyles = [],
 		rules = [],
-		appendedEls = [],
+		appendedEls = ["Stryker was here"],
 		parsedSheets = {},
 		resizeThrottle = 30,

[Survived] ConditionalExpression
src/respond.js:83:10
 		appendedEls = [],
 		parsedSheets = {},
 		resizeThrottle = 30,
-		head = doc.getElementsByTagName( "head" )[0] || docElem,
+		head = false,
 		base = doc.getElementsByTagName( "base" )[0],
 		links = head.getElementsByTagName( "link" ),

[Survived] StringLiteral
src/respond.js:85:38
 		resizeThrottle = 30,
 		head = doc.getElementsByTagName( "head" )[0] || docElem,
 		base = doc.getElementsByTagName( "base" )[0],
-		links = head.getElementsByTagName( "link" ),
+		links = head.getElementsByTagName( "" ),
 
 		lastCall,

[Survived] LogicalOperator
src/respond.js:99:28
 				div = doc.createElement('div'),
 				body = doc.body,
 				originalHTMLFontSize = docElem.style.fontSize,
-				originalBodyFontSize = body && body.style.fontSize,
+				originalBodyFontSize = body || body.style.fontSize,
 				fakeUsed = false;
 

[Survived] ConditionalExpression
src/respond.js:146:17
 		applyMedia = function( fromResize ){
 			var name = "clientWidth",
 				docElemProp = docElem[ name ],
-				currWidth = doc.compatMode === "CSS1Compat" && docElemProp || doc.body[ name ] || docElemProp,
+				currWidth = true && docElemProp || doc.body[ name ] || docElemProp,
 				styleBlocks	= {},
 				lastLink = links[ links.length-1 ],

[Survived] EqualityOperator
src/respond.js:152:34
 				now = (new Date()).getTime();
 
 			//throttle resize calls
-			if( fromResize && lastCall && now - lastCall < resizeThrottle ){
+			if( fromResize && lastCall && now - lastCall <= resizeThrottle ){
 				w.clearTimeout( resizeDefer );
 				resizeDefer = w.setTimeout( applyMedia, resizeThrottle );

[Survived] BlockStatement
src/respond.js:152:67
 				now = (new Date()).getTime();
 
 			//throttle resize calls
-			if( fromResize && lastCall && now - lastCall < resizeThrottle ){
-				w.clearTimeout( resizeDefer );
-				resizeDefer = w.setTimeout( applyMedia, resizeThrottle );
-				return;
-			}
+			if( fromResize && lastCall && now - lastCall < resizeThrottle ){}
 			else {
 				lastCall = now;

[Survived] BlockStatement
src/respond.js:162:42
 			}
 
 			for( var i in mediastyles ){
-				if( mediastyles.hasOwnProperty( i ) ){
-					var thisstyle = mediastyles[ i ],
-						min = thisstyle.minw,
-						max = thisstyle.maxw,
-						minnull = min === null,
-						maxnull = max === null,
-						em = "em";
-
-					if( !!min ){
-						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
-					}
-					if( !!max ){
-						max = parseFloat( max ) * ( max.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
-					}
-
-					// if there's no media query at all (the () part), or min or max is not null, and if either is present, they're true
-					if( !thisstyle.hasquery || ( !minnull || !maxnull ) && ( minnull || currWidth >= min ) && ( maxnull || currWidth <= max ) ){
-						if( !styleBlocks[ thisstyle.media ] ){
-							styleBlocks[ thisstyle.media ] = [];
-						}
-						styleBlocks[ thisstyle.media ].push( rules[ thisstyle.rules ] );
-					}
-				}
+				if( mediastyles.hasOwnProperty( i ) ){}
 			}
 

[Survived] ConditionalExpression
src/respond.js:166:17
 					var thisstyle = mediastyles[ i ],
 						min = thisstyle.minw,
 						max = thisstyle.maxw,
-						minnull = min === null,
+						minnull = false,
 						maxnull = max === null,
 						em = "em";

[Survived] ConditionalExpression
src/respond.js:167:17
 						min = thisstyle.minw,
 						max = thisstyle.maxw,
 						minnull = min === null,
-						maxnull = max === null,
+						maxnull = false,
 						em = "em";
 

[Survived] StringLiteral
src/respond.js:168:12
 						max = thisstyle.maxw,
 						minnull = min === null,
 						maxnull = max === null,
-						em = "em";
+						em = "";
 
 					if( !!min ){

[Survived] ConditionalExpression
src/respond.js:170:10
 						maxnull = max === null,
 						em = "em";
 
-					if( !!min ){
+					if( false ){
 						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
 					}

[Survived] EqualityOperator
src/respond.js:171:35
 						em = "em";
 
 					if( !!min ){
-						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
+						min = parseFloat( min ) * ( min.indexOf(em) <= -1 ? ( eminpx || getEmValue() ) : 1 );
 					}
 					if( !!max ){

[Survived] BlockStatement
src/respond.js:173:17
 					if( !!min ){
 						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
 					}
-					if( !!max ){
-						max = parseFloat( max ) * ( max.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
-					}
+					if( !!max ){}
 
 					// if there's no media query at all (the () part), or min or max is not null, and if either is present, they're true

[Survived] ConditionalExpression
src/respond.js:174:35
 						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
 					}
 					if( !!max ){
-						max = parseFloat( max ) * ( max.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
+						max = parseFloat( max ) * ( true ? ( eminpx || getEmValue() ) : 1 );
 					}
 

[Survived] LogicalOperator
src/respond.js:174:62
 						min = parseFloat( min ) * ( min.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
 					}
 					if( !!max ){
-						max = parseFloat( max ) * ( max.indexOf( em ) > -1 ? ( eminpx || getEmValue() ) : 1 );
+						max = parseFloat( max ) * ( max.indexOf( em ) > -1 ? ( eminpx && getEmValue() ) : 1 );
 					}
 

[Survived] LogicalOperator
src/respond.js:178:63
 					}
 
 					// if there's no media query at all (the () part), or min or max is not null, and if either is present, they're true
-					if( !thisstyle.hasquery || ( !minnull || !maxnull ) && ( minnull || currWidth >= min ) && ( maxnull || currWidth <= max ) ){
+					if( !thisstyle.hasquery || ( !minnull || !maxnull ) && ( minnull && currWidth >= min ) && ( maxnull || currWidth <= max ) ){
 						if( !styleBlocks[ thisstyle.media ] ){
 							styleBlocks[ thisstyle.media ] = [];

[Survived] BooleanLiteral
src/respond.js:178:10
 					}
 
 					// if there's no media query at all (the () part), or min or max is not null, and if either is present, they're true
-					if( !thisstyle.hasquery || ( !minnull || !maxnull ) && ( minnull || currWidth >= min ) && ( maxnull || currWidth <= max ) ){
+					if( thisstyle.hasquery || ( !minnull || !maxnull ) && ( minnull || currWidth >= min ) && ( maxnull || currWidth <= max ) ){
 						if( !styleBlocks[ thisstyle.media ] ){
 							styleBlocks[ thisstyle.media ] = [];

[Survived] BlockStatement
src/respond.js:189:42
 
 			//remove any existing respond style element(s)
 			for( var j in appendedEls ){
-				if( appendedEls.hasOwnProperty( j ) ){
-					if( appendedEls[ j ] && appendedEls[ j ].parentNode === head ){
-						head.removeChild( appendedEls[ j ] );
-					}
-				}
+				if( appendedEls.hasOwnProperty( j ) ){}
 			}
 			appendedEls.length = 0;

[Survived] ConditionalExpression
src/respond.js:190:10
 			//remove any existing respond style element(s)
 			for( var j in appendedEls ){
 				if( appendedEls.hasOwnProperty( j ) ){
-					if( appendedEls[ j ] && appendedEls[ j ].parentNode === head ){
+					if( false ){
 						head.removeChild( appendedEls[ j ] );
 					}

[Survived] StringLiteral
src/respond.js:200:34
 			//inject active styles, grouped by media type
 			for( var k in styleBlocks ){
 				if( styleBlocks.hasOwnProperty( k ) ){
-					var ss = doc.createElement( "style" ),
+					var ss = doc.createElement( "" ),
 						css = styleBlocks[ k ].join( "\n" );
 

[Survived] StringLiteral
src/respond.js:225:41
 		//find media blocks in css text, convert to style blocks
 		translate = function( styles, href, media ){
 			var qs = styles.replace( respond.regex.comments, '' )
-					.replace( respond.regex.keyframes, '' )
+					.replace( respond.regex.keyframes, "Stryker was here!" )
 					.match( respond.regex.media ),
 				ql = qs && qs.length || 0;

[Survived] LogicalOperator
src/respond.js:227:10
 			var qs = styles.replace( respond.regex.comments, '' )
 					.replace( respond.regex.keyframes, '' )
 					.match( respond.regex.media ),
-				ql = qs && qs.length || 0;
+				ql = qs && qs.length && 0;
 
 			//try to get CSS path

[Survived] ConditionalExpression
src/respond.js:227:10
 			var qs = styles.replace( respond.regex.comments, '' )
 					.replace( respond.regex.keyframes, '' )
 					.match( respond.regex.media ),
-				ql = qs && qs.length || 0;
+				ql = false;
 
 			//try to get CSS path

[Survived] StringLiteral
src/respond.js:233:46
 			href = href.substring( 0, href.lastIndexOf( "/" ) );
 
 			var repUrls = function( css ){
-					return css.replace( respond.regex.urls, "$1" + href + "$2$3" );
+					return css.replace( respond.regex.urls, "" + href + "$2$3" );
 				},
 				useMedia = !ql && media;

[Survived] StringLiteral
src/respond.js:233:60
 			href = href.substring( 0, href.lastIndexOf( "/" ) );
 
 			var repUrls = function( css ){
-					return css.replace( respond.regex.urls, "$1" + href + "$2$3" );
+					return css.replace( respond.regex.urls, "$1" + href + "" );
 				},
 				useMedia = !ql && media;

[Survived] ConditionalExpression
src/respond.js:238:8
 				useMedia = !ql && media;
 
 			//if path exists, tack on trailing slash
-			if( href.length ){ href += "/"; }
+			if( true ){ href += "/"; }
 
 			//if no internal queries exist, but media attr does, use that

[Survived] UpdateOperator
src/respond.js:248:28
 				ql = 1;
 			}
 
-			for( var i = 0; i < ql; i++ ){
+			for( var i = 0; i < ql; i-- ){
 				var fullq, thisq, eachq, eql;
 

[Survived] ConditionalExpression
src/respond.js:252:9
 				var fullq, thisq, eachq, eql;
 
 				//media attr
-				if( useMedia ){
+				if( true ){
 					fullq = media;
 					rules.push( repUrls( styles ) );

[Survived] ConditionalExpression
src/respond.js:265:21
 				eachq = fullq.split( "," );
 				eql = eachq.length;
 
-				for( var j = 0; j < eql; j++ ){
+				for( var j = 0; false; j++ ){
 					thisq = eachq[ j ];
 

[Survived] ConditionalExpression
src/respond.js:268:10
 				for( var j = 0; j < eql; j++ ){
 					thisq = eachq[ j ];
 
-					if( isUnsupportedMediaQuery( thisq ) ) {
+					if( false ) {
 						continue;
 					}

[Survived] BlockStatement
src/respond.js:268:45
 				for( var j = 0; j < eql; j++ ){
 					thisq = eachq[ j ];
 
-					if( isUnsupportedMediaQuery( thisq ) ) {
-						continue;
-					}
+					if( isUnsupportedMediaQuery( thisq ) ) {}
 
 					mediastyles.push( {

[Survived] ObjectLiteral
src/respond.js:272:24
 						continue;
 					}
 
-					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
-						rules : rules.length - 1,
-						hasquery : thisq.indexOf("(") > -1,
-						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
-						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
-					} );
+					mediastyles.push( {} );
 				}
 			}

[Survived] ConditionalExpression
src/respond.js:273:15
 					}
 
 					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
+						media : false,
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,

[Survived] ConditionalExpression
src/respond.js:273:15
 					}
 
 					mediastyles.push( {
-						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
+						media : false || "all",
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,

[Survived] ArithmeticOperator
src/respond.js:276:51
 						media : thisq.split( "(" )[ 0 ].match( respond.regex.only ) && RegExp.$2 || "all",
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
-						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
+						minw : thisq.match( respond.regex.minw ) && parseFloat(RegExp.$1) - (RegExp.$2 || ""),
 						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
 					} );

[Survived] ConditionalExpression
src/respond.js:277:79
 						rules : rules.length - 1,
 						hasquery : thisq.indexOf("(") > -1,
 						minw : thisq.match( respond.regex.minw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" ),
-						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( RegExp.$2 || "" )
+						maxw : thisq.match( respond.regex.maxw ) && parseFloat( RegExp.$1 ) + ( true )
 					} );
 				}

[Survived] UpdateOperator
src/respond.js:304:38
 		//loop stylesheets, send text content to translate
 		ripCSS = function(){
 
-			for( var i = 0; i < links.length; i++ ){
+			for( var i = 0; i < links.length; i-- ){
 				var sheet = links[ i ],
 				href = sheet.href,

[Survived] ConditionalExpression
src/respond.js:308:13
 				var sheet = links[ i ],
 				href = sheet.href,
 				media = sheet.media,
-				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
+				isCSS = true;
 
 				//only links plz and prevent re-parsing

[Survived] MethodExpression
src/respond.js:308:26
 				var sheet = links[ i ],
 				href = sheet.href,
 				media = sheet.media,
-				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
+				isCSS = sheet.rel && sheet.rel.toUpperCase() === "stylesheet";
 
 				//only links plz and prevent re-parsing

[Survived] ConditionalExpression
src/respond.js:311:9
 				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
 
 				//only links plz and prevent re-parsing
-				if( !!href && isCSS && !parsedSheets[ href ] ){
+				if( true ){
 					// selectivizr exposes css through the rawCssText expando
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {

[Survived] ConditionalExpression
src/respond.js:311:9
 				isCSS = sheet.rel && sheet.rel.toLowerCase() === "stylesheet";
 
 				//only links plz and prevent re-parsing
-				if( !!href && isCSS && !parsedSheets[ href ] ){
+				if( true && !parsedSheets[ href ] ){
 					// selectivizr exposes css through the rawCssText expando
 					if (sheet.styleSheet && sheet.styleSheet.rawCssText) {

[Survived] BooleanLiteral
src/respond.js:317:12
 						translate( sheet.styleSheet.rawCssText, href, media );
 						parsedSheets[ href ] = true;
 					} else {
-						if( (!/^([a-zA-Z:]*\/\/)/.test( href ) && !base) ||
+						if( (/^([a-zA-Z:]*\/\/)/.test(href) && !base) ||
 							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request

[Survived] EqualityOperator
src/respond.js:321:13
 							href.replace( RegExp.$1, "" ).split( "/" )[0] === w.location.host ){
 							// IE7 doesn't handle urls that start with '//' for ajax request
 							// manually add in the protocol
-							if ( href.substring(0,2) === "//" ) { href = w.location.protocol + href; }
+							if ( href.substring(0, 2) !== "//" ) { href = w.location.protocol + href; }
 							requestQueue.push( {
 								href: href,

[Survived] StringLiteral
src/respond.js:348:23
 	}
 
 	if( w.addEventListener ){
-		w.addEventListener( "resize", callMedia, false );
+		w.addEventListener( "", callMedia, false );
 	}
 	else if( w.attachEvent ){
