[Survived] StringLiteral
src/binding/defaultBindings/checked.js:4:24
 (function() {
 
 ko.bindingHandlers['checked'] = {
-    'after': ['value', 'attr'],
+    'after': ['value', ""],
     'init': function (element, valueAccessor, allBindings) {
         var checkedValue = ko.pureComputed(function() {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:6:55
 ko.bindingHandlers['checked'] = {
     'after': ['value', 'attr'],
     'init': function (element, valueAccessor, allBindings) {
-        var checkedValue = ko.pureComputed(function() {
-            // Treat "value" like "checkedValue" when it is included with "checked" binding
-            if (allBindings['has']('checkedValue')) {
-                return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
-            } else if (useElementValue) {
-                if (allBindings['has']('value')) {
-                    return ko.utils.unwrapObservable(allBindings.get('value'));
-                } else {
-                    return element.value;
-                }
-            }
-        });
+        var checkedValue = ko.pureComputed(function() {});
 
         function updateModel() {

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:8:17
     'init': function (element, valueAccessor, allBindings) {
         var checkedValue = ko.pureComputed(function() {
             // Treat "value" like "checkedValue" when it is included with "checked" binding
-            if (allBindings['has']('checkedValue')) {
+            if (false) {
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
             } else if (useElementValue) {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:8:53
     'init': function (element, valueAccessor, allBindings) {
         var checkedValue = ko.pureComputed(function() {
             // Treat "value" like "checkedValue" when it is included with "checked" binding
-            if (allBindings['has']('checkedValue')) {
-                return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
-            } else if (useElementValue) {
+            if (allBindings['has']('checkedValue')) {} else if (useElementValue) {
                 if (allBindings['has']('value')) {
                     return ko.utils.unwrapObservable(allBindings.get('value'));

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:10:24
             // Treat "value" like "checkedValue" when it is included with "checked" binding
             if (allBindings['has']('checkedValue')) {
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
-            } else if (useElementValue) {
+            } else if (true) {
                 if (allBindings['has']('value')) {
                     return ko.utils.unwrapObservable(allBindings.get('value'));

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:10:24
             // Treat "value" like "checkedValue" when it is included with "checked" binding
             if (allBindings['has']('checkedValue')) {
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
-            } else if (useElementValue) {
+            } else if (false) {
                 if (allBindings['has']('value')) {
                     return ko.utils.unwrapObservable(allBindings.get('value'));

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:11:50
             if (allBindings['has']('checkedValue')) {
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
             } else if (useElementValue) {
-                if (allBindings['has']('value')) {
-                    return ko.utils.unwrapObservable(allBindings.get('value'));
-                } else {
+                if (allBindings['has']('value')) {} else {
                     return element.value;
                 }

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:11:21
             if (allBindings['has']('checkedValue')) {
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
             } else if (useElementValue) {
-                if (allBindings['has']('value')) {
+                if (false) {
                     return ko.utils.unwrapObservable(allBindings.get('value'));
                 } else {

[Survived] StringLiteral
src/binding/defaultBindings/checked.js:12:70
                 return ko.utils.unwrapObservable(allBindings.get('checkedValue'));
             } else if (useElementValue) {
                 if (allBindings['has']('value')) {
-                    return ko.utils.unwrapObservable(allBindings.get('value'));
+                    return ko.utils.unwrapObservable(allBindings.get(""));
                 } else {
                     return element.value;

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:13:24
             } else if (useElementValue) {
                 if (allBindings['has']('value')) {
                     return ko.utils.unwrapObservable(allBindings.get('value'));
-                } else {
-                    return element.value;
-                }
+                } else {}
             }
         });

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:26:17
                 elemValue = checkedValue();
 
             // When we're first setting up this computed, don't change any model state.
-            if (ko.computedContext.isInitial()) {
+            if (true) {
                 return;
             }

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:26:49
                 elemValue = checkedValue();
 
             // When we're first setting up this computed, don't change any model state.
-            if (ko.computedContext.isInitial()) {
-                return;
-            }
+            if (ko.computedContext.isInitial()) {}
 
             // We can ignore unchecked radio buttons, because some other radio

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:33:17
             // We can ignore unchecked radio buttons, because some other radio
             // button will be checked, and that one can take care of updating state.
             // Also ignore value changes to an already unchecked checkbox.
-            if (!isChecked && (isRadio || ko.computedContext.getDependenciesCount())) {
+            if (isChecked && (isRadio || ko.computedContext.getDependenciesCount())) {
                 return;
             }

[Survived] LogicalOperator
src/binding/defaultBindings/checked.js:33:32
             // We can ignore unchecked radio buttons, because some other radio
             // button will be checked, and that one can take care of updating state.
             // Also ignore value changes to an already unchecked checkbox.
-            if (!isChecked && (isRadio || ko.computedContext.getDependenciesCount())) {
+            if (!isChecked && (isRadio && ko.computedContext.getDependenciesCount())) {
                 return;
             }

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:38:17
             }
 
             var modelValue = ko.dependencyDetection.ignore(valueAccessor);
-            if (valueIsArray) {
+            if (false) {
                 var writableValue = rawValueIsNonArrayObservable ? modelValue.peek() : modelValue,
                     saveOldValue = oldElemValue;

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:38:17
             }
 
             var modelValue = ko.dependencyDetection.ignore(valueAccessor);
-            if (valueIsArray) {
+            if (true) {
                 var writableValue = rawValueIsNonArrayObservable ? modelValue.peek() : modelValue,
                     saveOldValue = oldElemValue;

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:43:21
                     saveOldValue = oldElemValue;
                 oldElemValue = elemValue;
 
-                if (saveOldValue !== elemValue) {
+                if (false) {
                     // When we're responding to the checkedValue changing, and the element is
                     // currently checked, replace the old elem value with the new elem value

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:43:49
                     saveOldValue = oldElemValue;
                 oldElemValue = elemValue;
 
-                if (saveOldValue !== elemValue) {
-                    // When we're responding to the checkedValue changing, and the element is
-                    // currently checked, replace the old elem value with the new elem value
-                    // in the model array.
-                    if (isChecked) {
-                        ko.utils.addOrRemoveItem(writableValue, elemValue, true);
-                        ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);
-                    }
-                } else {
+                if (saveOldValue !== elemValue) {} else {
                     // When we're responding to the user having checked/unchecked a checkbox,
                     // add/remove the element value to the model array.

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:47:36
                     // When we're responding to the checkedValue changing, and the element is
                     // currently checked, replace the old elem value with the new elem value
                     // in the model array.
-                    if (isChecked) {
-                        ko.utils.addOrRemoveItem(writableValue, elemValue, true);
-                        ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);
-                    }
+                    if (isChecked) {}
                 } else {
                     // When we're responding to the user having checked/unchecked a checkbox,

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:47:25
                     // When we're responding to the checkedValue changing, and the element is
                     // currently checked, replace the old elem value with the new elem value
                     // in the model array.
-                    if (isChecked) {
+                    if (true) {
                         ko.utils.addOrRemoveItem(writableValue, elemValue, true);
                         ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:48:76
                     // currently checked, replace the old elem value with the new elem value
                     // in the model array.
                     if (isChecked) {
-                        ko.utils.addOrRemoveItem(writableValue, elemValue, true);
+                        ko.utils.addOrRemoveItem(writableValue, elemValue, false);
                         ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);
                     }

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:49:79
                     // in the model array.
                     if (isChecked) {
                         ko.utils.addOrRemoveItem(writableValue, elemValue, true);
-                        ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);
+                        ko.utils.addOrRemoveItem(writableValue, saveOldValue, true);
                     }
                 } else {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:51:24
                         ko.utils.addOrRemoveItem(writableValue, elemValue, true);
                         ko.utils.addOrRemoveItem(writableValue, saveOldValue, false);
                     }
-                } else {
-                    // When we're responding to the user having checked/unchecked a checkbox,
-                    // add/remove the element value to the model array.
-                    ko.utils.addOrRemoveItem(writableValue, elemValue, isChecked);
-                }
+                } else {}
 
                 if (rawValueIsNonArrayObservable && ko.isWriteableObservable(modelValue)) {

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:57:21
                     ko.utils.addOrRemoveItem(writableValue, elemValue, isChecked);
                 }
 
-                if (rawValueIsNonArrayObservable && ko.isWriteableObservable(modelValue)) {
+                if (true) {
                     modelValue(writableValue);
                 }

[Survived] LogicalOperator
src/binding/defaultBindings/checked.js:57:21
                     ko.utils.addOrRemoveItem(writableValue, elemValue, isChecked);
                 }
 
-                if (rawValueIsNonArrayObservable && ko.isWriteableObservable(modelValue)) {
+                if (rawValueIsNonArrayObservable || ko.isWriteableObservable(modelValue)) {
                     modelValue(writableValue);
                 }

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:60:20
                 if (rawValueIsNonArrayObservable && ko.isWriteableObservable(modelValue)) {
                     modelValue(writableValue);
                 }
-            } else {
-                if (isCheckbox) {
-                    if (elemValue === undefined) {
-                        elemValue = isChecked;
-                    } else if (!isChecked) {
-                        elemValue = undefined;
-                    }
-                }
-                ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'checked', elemValue, true);
-            }
+            } else {}
         };
 

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:61:21
                     modelValue(writableValue);
                 }
             } else {
-                if (isCheckbox) {
+                if (false) {
                     if (elemValue === undefined) {
                         elemValue = isChecked;

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:61:21
                     modelValue(writableValue);
                 }
             } else {
-                if (isCheckbox) {
+                if (true) {
                     if (elemValue === undefined) {
                         elemValue = isChecked;

[Survived] EqualityOperator
src/binding/defaultBindings/checked.js:62:25
                 }
             } else {
                 if (isCheckbox) {
-                    if (elemValue === undefined) {
+                    if (elemValue !== undefined) {
                         elemValue = isChecked;
                     } else if (!isChecked) {

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:62:25
                 }
             } else {
                 if (isCheckbox) {
-                    if (elemValue === undefined) {
+                    if (false) {
                         elemValue = isChecked;
                     } else if (!isChecked) {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:64:44
                 if (isCheckbox) {
                     if (elemValue === undefined) {
                         elemValue = isChecked;
-                    } else if (!isChecked) {
-                        elemValue = undefined;
-                    }
+                    } else if (!isChecked) {}
                 }
                 ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'checked', elemValue, true);

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:64:32
                 if (isCheckbox) {
                     if (elemValue === undefined) {
                         elemValue = isChecked;
-                    } else if (!isChecked) {
+                    } else if (true) {
                         elemValue = undefined;
                     }

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:68:108
                         elemValue = undefined;
                     }
                 }
-                ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'checked', elemValue, true);
+                ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'checked', elemValue, false);
             }
         };

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:72:31
             }
         };
 
-        function updateView() {
-            // This updates the view value from the model value.
-            // It runs in response to changes in the bound (checked) value.
-            var modelValue = ko.utils.unwrapObservable(valueAccessor()),
-                elemValue = checkedValue();
-
-            if (valueIsArray) {
-                // When a checkbox is bound to an array, being checked represents its value being present in that array
-                element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
-                oldElemValue = elemValue;
-            } else if (isCheckbox && elemValue === undefined) {
-                // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
-                // being checked represents the value being trueish
-                element.checked = !!modelValue;
-            } else {
-                // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value
-                element.checked = (checkedValue() === modelValue);
-            }
-        };
+        function updateView() {};
 
         var isCheckbox = element.type == "checkbox",

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:78:17
             var modelValue = ko.utils.unwrapObservable(valueAccessor()),
                 elemValue = checkedValue();
 
-            if (valueIsArray) {
+            if (true) {
                 // When a checkbox is bound to an array, being checked represents its value being present in that array
                 element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:78:31
             var modelValue = ko.utils.unwrapObservable(valueAccessor()),
                 elemValue = checkedValue();
 
-            if (valueIsArray) {
-                // When a checkbox is bound to an array, being checked represents its value being present in that array
-                element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
-                oldElemValue = elemValue;
-            } else if (isCheckbox && elemValue === undefined) {
+            if (valueIsArray) {} else if (isCheckbox && elemValue === undefined) {
                 // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
                 // being checked represents the value being trueish

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:80:35
 
             if (valueIsArray) {
                 // When a checkbox is bound to an array, being checked represents its value being present in that array
-                element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
+                element.checked = true;
                 oldElemValue = elemValue;
             } else if (isCheckbox && elemValue === undefined) {

[Survived] EqualityOperator
src/binding/defaultBindings/checked.js:80:35
 
             if (valueIsArray) {
                 // When a checkbox is bound to an array, being checked represents its value being present in that array
-                element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
+                element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) < 0;
                 oldElemValue = elemValue;
             } else if (isCheckbox && elemValue === undefined) {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:82:63
                 // When a checkbox is bound to an array, being checked represents its value being present in that array
                 element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
                 oldElemValue = elemValue;
-            } else if (isCheckbox && elemValue === undefined) {
-                // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
-                // being checked represents the value being trueish
-                element.checked = !!modelValue;
-            } else {
+            } else if (isCheckbox && elemValue === undefined) {} else {
                 // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value
                 element.checked = (checkedValue() === modelValue);

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:82:24
                 // When a checkbox is bound to an array, being checked represents its value being present in that array
                 element.checked = ko.utils.arrayIndexOf(modelValue, elemValue) >= 0;
                 oldElemValue = elemValue;
-            } else if (isCheckbox && elemValue === undefined) {
+            } else if (true) {
                 // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
                 // being checked represents the value being trueish

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:85:36
             } else if (isCheckbox && elemValue === undefined) {
                 // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
                 // being checked represents the value being trueish
-                element.checked = !!modelValue;
+                element.checked = !modelValue;
             } else {
                 // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:86:20
                 // When a checkbox is bound to any other value (not an array) and "checkedValue" is not defined,
                 // being checked represents the value being trueish
                 element.checked = !!modelValue;
-            } else {
-                // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value
-                element.checked = (checkedValue() === modelValue);
-            }
+            } else {}
         };
 

[Survived] EqualityOperator
src/binding/defaultBindings/checked.js:88:36
                 element.checked = !!modelValue;
             } else {
                 // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value
-                element.checked = (checkedValue() === modelValue);
+                element.checked = (checkedValue() !== modelValue);
             }
         };

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:88:36
                 element.checked = !!modelValue;
             } else {
                 // Otherwise, being checked means that the checkbox or radio button's value corresponds to the model value
-                element.checked = (checkedValue() === modelValue);
+                element.checked = (true);
             }
         };

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:92:26
             }
         };
 
-        var isCheckbox = element.type == "checkbox",
+        var isCheckbox = true,
             isRadio = element.type == "radio";
 

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:92:26
             }
         };
 
-        var isCheckbox = element.type == "checkbox",
+        var isCheckbox = false,
             isRadio = element.type == "radio";
 

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:93:23
         };
 
         var isCheckbox = element.type == "checkbox",
-            isRadio = element.type == "radio";
+            isRadio = false;
 
         // Only bind to check boxes and radio buttons

[Survived] EqualityOperator
src/binding/defaultBindings/checked.js:93:23
         };
 
         var isCheckbox = element.type == "checkbox",
-            isRadio = element.type == "radio";
+            isRadio = element.type != "radio";
 
         // Only bind to check boxes and radio buttons

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:96:38
             isRadio = element.type == "radio";
 
         // Only bind to check boxes and radio buttons
-        if (!isCheckbox && !isRadio) {
-            return;
-        }
+        if (!isCheckbox && !isRadio) {}
 
         var rawValue = valueAccessor(),

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:96:28
             isRadio = element.type == "radio";
 
         // Only bind to check boxes and radio buttons
-        if (!isCheckbox && !isRadio) {
+        if (!isCheckbox && isRadio) {
             return;
         }

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:101:28
         }
 
         var rawValue = valueAccessor(),
-            valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
+            valueIsArray = true,
             rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
             useElementValue = isRadio || valueIsArray,

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:101:28
         }
 
         var rawValue = valueAccessor(),
-            valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
+            valueIsArray = false,
             rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
             useElementValue = isRadio || valueIsArray,

[Survived] LogicalOperator
src/binding/defaultBindings/checked.js:102:46
 
         var rawValue = valueAccessor(),
             valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
-            rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
+            rawValueIsNonArrayObservable = !(valueIsArray || rawValue.push && rawValue.splice),
             useElementValue = isRadio || valueIsArray,
             oldElemValue = valueIsArray ? checkedValue() : undefined;

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:102:46
 
         var rawValue = valueAccessor(),
             valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
-            rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
+            rawValueIsNonArrayObservable = !(false),
             useElementValue = isRadio || valueIsArray,
             oldElemValue = valueIsArray ? checkedValue() : undefined;

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:103:31
         var rawValue = valueAccessor(),
             valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
             rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
-            useElementValue = isRadio || valueIsArray,
+            useElementValue = false,
             oldElemValue = valueIsArray ? checkedValue() : undefined;
 

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:103:31
         var rawValue = valueAccessor(),
             valueIsArray = isCheckbox && (ko.utils.unwrapObservable(rawValue) instanceof Array),
             rawValueIsNonArrayObservable = !(valueIsArray && rawValue.push && rawValue.splice),
-            useElementValue = isRadio || valueIsArray,
+            useElementValue = true,
             oldElemValue = valueIsArray ? checkedValue() : undefined;
 

[Survived] LogicalOperator
src/binding/defaultBindings/checked.js:107:13
             oldElemValue = valueIsArray ? checkedValue() : undefined;
 
         // IE 6 won't allow radio buttons to be selected unless they have a name
-        if (isRadio && !element.name)
+        if (isRadio || !element.name)
             ko.bindingHandlers['uniqueName']['init'](element, function() { return true });
 

[Survived] ConditionalExpression
src/binding/defaultBindings/checked.js:107:13
             oldElemValue = valueIsArray ? checkedValue() : undefined;
 
         // IE 6 won't allow radio buttons to be selected unless they have a name
-        if (isRadio && !element.name)
+        if (false)
             ko.bindingHandlers['uniqueName']['init'](element, function() { return true });
 

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:108:74
 
         // IE 6 won't allow radio buttons to be selected unless they have a name
         if (isRadio && !element.name)
-            ko.bindingHandlers['uniqueName']['init'](element, function() { return true });
+            ko.bindingHandlers['uniqueName']['init'](element, function() {});
 
         // Set up two computeds to update the binding:

[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:108:83
 
         // IE 6 won't allow radio buttons to be selected unless they have a name
         if (isRadio && !element.name)
-            ko.bindingHandlers['uniqueName']['init'](element, function() { return true });
+            ko.bindingHandlers['uniqueName']['init'](element, function() { return false });
 
         // Set up two computeds to update the binding:

[Survived] StringLiteral
src/binding/defaultBindings/checked.js:114:48
 
         // The first responds to changes in the checkedValue value and to element clicks
         ko.computed(updateModel, null, { disposeWhenNodeIsRemoved: element });
-        ko.utils.registerEventHandler(element, "click", updateModel);
+        ko.utils.registerEventHandler(element, "", updateModel);
 
         // The second responds to changes in the model value (the one associated with the checked binding)
