[Survived] BooleanLiteral
src/binding/defaultBindings/checked.js:122:52
         rawValue = undefined;
     }
 };
-ko.expressionRewriting.twoWayBindings['checked'] = true;
+ko.expressionRewriting.twoWayBindings['checked'] = false;
 
 ko.bindingHandlers['checkedValue'] = {

[Survived] BlockStatement
src/binding/defaultBindings/checked.js:125:49
 ko.expressionRewriting.twoWayBindings['checked'] = true;
 
 ko.bindingHandlers['checkedValue'] = {
-    'update': function (element, valueAccessor) {
-        element.value = ko.utils.unwrapObservable(valueAccessor());
-    }
+    'update': function (element, valueAccessor) {}
 };
 
