[Survived] StringLiteral
src/binding/defaultBindings/click.js:2:26
 // 'click' is just a shorthand for the usual full-length event:{click:handler}
-makeEventHandlerShortcut('click');
+makeEventHandlerShortcut("");
 
