[Survived] ObjectLiteral
src/binding/defaultBindings/submit.js:1:32
-ko.bindingHandlers['submit'] = {
-    'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
-        if (typeof valueAccessor() != "function")
-            throw new Error("The value for a submit binding must be a function");
-        ko.utils.registerEventHandler(element, "submit", function (event) {
-            var handlerReturnValue;
-            var value = valueAccessor();
-            try { handlerReturnValue = value.call(bindingContext['$data'], element); }
-            finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
-                    if (event.preventDefault)
-                        event.preventDefault();
-                    else
-                        event.returnValue = false;
-                }
-            }
-        });
-    }
-};
+ko.bindingHandlers['submit'] = {};
 

[Survived] BlockStatement
src/binding/defaultBindings/submit.js:2:87
 ko.bindingHandlers['submit'] = {
-    'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
-        if (typeof valueAccessor() != "function")
-            throw new Error("The value for a submit binding must be a function");
-        ko.utils.registerEventHandler(element, "submit", function (event) {
-            var handlerReturnValue;
-            var value = valueAccessor();
-            try { handlerReturnValue = value.call(bindingContext['$data'], element); }
-            finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
-                    if (event.preventDefault)
-                        event.preventDefault();
-                    else
-                        event.returnValue = false;
-                }
-            }
-        });
-    }
+    'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {}
 };
 

[Survived] ConditionalExpression
src/binding/defaultBindings/submit.js:3:13
 ko.bindingHandlers['submit'] = {
     'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
-        if (typeof valueAccessor() != "function")
+        if (true)
             throw new Error("The value for a submit binding must be a function");
         ko.utils.registerEventHandler(element, "submit", function (event) {

[Survived] EqualityOperator
src/binding/defaultBindings/submit.js:3:13
 ko.bindingHandlers['submit'] = {
     'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
-        if (typeof valueAccessor() != "function")
+        if (typeof valueAccessor() == "function")
             throw new Error("The value for a submit binding must be a function");
         ko.utils.registerEventHandler(element, "submit", function (event) {

[Survived] StringLiteral
src/binding/defaultBindings/submit.js:4:29
 ko.bindingHandlers['submit'] = {
     'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
         if (typeof valueAccessor() != "function")
-            throw new Error("The value for a submit binding must be a function");
+            throw new Error("");
         ko.utils.registerEventHandler(element, "submit", function (event) {
             var handlerReturnValue;

[Survived] BlockStatement
src/binding/defaultBindings/submit.js:5:75
     'init': function (element, valueAccessor, allBindings, viewModel, bindingContext) {
         if (typeof valueAccessor() != "function")
             throw new Error("The value for a submit binding must be a function");
-        ko.utils.registerEventHandler(element, "submit", function (event) {
-            var handlerReturnValue;
-            var value = valueAccessor();
-            try { handlerReturnValue = value.call(bindingContext['$data'], element); }
-            finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
-                    if (event.preventDefault)
-                        event.preventDefault();
-                    else
-                        event.returnValue = false;
-                }
-            }
-        });
+        ko.utils.registerEventHandler(element, "submit", function (event) {});
     }
 };

[Survived] BlockStatement
src/binding/defaultBindings/submit.js:8:17
         ko.utils.registerEventHandler(element, "submit", function (event) {
             var handlerReturnValue;
             var value = valueAccessor();
-            try { handlerReturnValue = value.call(bindingContext['$data'], element); }
+            try {}
             finally {
                 if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.

[Survived] BlockStatement
src/binding/defaultBindings/submit.js:9:21
             var handlerReturnValue;
             var value = valueAccessor();
             try { handlerReturnValue = value.call(bindingContext['$data'], element); }
-            finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
-                    if (event.preventDefault)
-                        event.preventDefault();
-                    else
-                        event.returnValue = false;
-                }
-            }
+            finally {}
         });
     }

[Survived] BooleanLiteral
src/binding/defaultBindings/submit.js:10:44
             var value = valueAccessor();
             try { handlerReturnValue = value.call(bindingContext['$data'], element); }
             finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
+                if (handlerReturnValue !== false) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
                     if (event.preventDefault)
                         event.preventDefault();

[Survived] EqualityOperator
src/binding/defaultBindings/submit.js:10:21
             var value = valueAccessor();
             try { handlerReturnValue = value.call(bindingContext['$data'], element); }
             finally {
-                if (handlerReturnValue !== true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
+                if (handlerReturnValue === true) { // Normally we want to prevent default action. Developer can override this be explicitly returning true.
                     if (event.preventDefault)
                         event.preventDefault();
