[Survived] ObjectLiteral
src/binding/defaultBindings/text.js:1:30
-ko.bindingHandlers['text'] = {
-    'init': function() {
-        // Prevent binding on the dynamically-injected text node (as developers are unlikely to expect that, and it has security implications).
-        // It should also make things faster, as we no longer have to consider whether the text node might be bindable.
-        return { 'controlsDescendantBindings': true };
-    },
-    'update': function (element, valueAccessor) {
-        ko.utils.setTextContent(element, valueAccessor());
-    }
-};
+ko.bindingHandlers['text'] = {};
 ko.virtualElements.allowedBindings['text'] = true;
 

[Survived] BlockStatement
src/binding/defaultBindings/text.js:2:24
 ko.bindingHandlers['text'] = {
-    'init': function() {
-        // Prevent binding on the dynamically-injected text node (as developers are unlikely to expect that, and it has security implications).
-        // It should also make things faster, as we no longer have to consider whether the text node might be bindable.
-        return { 'controlsDescendantBindings': true };
-    },
+    'init': function() {},
     'update': function (element, valueAccessor) {
         ko.utils.setTextContent(element, valueAccessor());

[Survived] BooleanLiteral
src/binding/defaultBindings/text.js:5:48
     'init': function() {
         // Prevent binding on the dynamically-injected text node (as developers are unlikely to expect that, and it has security implications).
         // It should also make things faster, as we no longer have to consider whether the text node might be bindable.
-        return { 'controlsDescendantBindings': true };
+        return { 'controlsDescendantBindings': false };
     },
     'update': function (element, valueAccessor) {

[Survived] BlockStatement
src/binding/defaultBindings/text.js:7:49
         // It should also make things faster, as we no longer have to consider whether the text node might be bindable.
         return { 'controlsDescendantBindings': true };
     },
-    'update': function (element, valueAccessor) {
-        ko.utils.setTextContent(element, valueAccessor());
-    }
+    'update': function (element, valueAccessor) {}
 };
 ko.virtualElements.allowedBindings['text'] = true;

[Survived] BooleanLiteral
src/binding/defaultBindings/text.js:11:46
         ko.utils.setTextContent(element, valueAccessor());
     }
 };
-ko.virtualElements.allowedBindings['text'] = true;
+ko.virtualElements.allowedBindings['text'] = false;
 
