[Survived] StringLiteral
src/binding/defaultBindings/uniqueName.js:1:20
-ko.bindingHandlers['uniqueName'] = {
+ko.bindingHandlers[""] = {
     'init': function (element, valueAccessor) {
         if (valueAccessor()) {

[Survived] BlockStatement
src/binding/defaultBindings/uniqueName.js:2:47
 ko.bindingHandlers['uniqueName'] = {
-    'init': function (element, valueAccessor) {
-        if (valueAccessor()) {
-            var name = "ko_unique_" + (++ko.bindingHandlers['uniqueName'].currentIndex);
-            ko.utils.setElementName(element, name);
-        }
-    }
+    'init': function (element, valueAccessor) {}
 };
 ko.bindingHandlers['uniqueName'].currentIndex = 0;

[Survived] ConditionalExpression
src/binding/defaultBindings/uniqueName.js:3:13
 ko.bindingHandlers['uniqueName'] = {
     'init': function (element, valueAccessor) {
-        if (valueAccessor()) {
+        if (true) {
             var name = "ko_unique_" + (++ko.bindingHandlers['uniqueName'].currentIndex);
             ko.utils.setElementName(element, name);

[Survived] BlockStatement
src/binding/defaultBindings/uniqueName.js:3:30
 ko.bindingHandlers['uniqueName'] = {
     'init': function (element, valueAccessor) {
-        if (valueAccessor()) {
-            var name = "ko_unique_" + (++ko.bindingHandlers['uniqueName'].currentIndex);
-            ko.utils.setElementName(element, name);
-        }
+        if (valueAccessor()) {}
     }
 };

[Survived] UpdateOperator
src/binding/defaultBindings/uniqueName.js:4:40
 ko.bindingHandlers['uniqueName'] = {
     'init': function (element, valueAccessor) {
         if (valueAccessor()) {
-            var name = "ko_unique_" + (++ko.bindingHandlers['uniqueName'].currentIndex);
+            var name = "ko_unique_" + (--ko.bindingHandlers['uniqueName'].currentIndex);
             ko.utils.setElementName(element, name);
         }
