[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:4:30
 ko.bindingHandlers['value'] = {
     'init': function (element, valueAccessor, allBindings) {
         var tagName = ko.utils.tagNameLower(element),
-            isInputElement = tagName == "input";
+            isInputElement = true;
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:4:30
 ko.bindingHandlers['value'] = {
     'init': function (element, valueAccessor, allBindings) {
         var tagName = ko.utils.tagNameLower(element),
-            isInputElement = tagName == "input";
+            isInputElement = tagName != "input";
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:7:13
             isInputElement = tagName == "input";
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (isInputElement && (element.type == "checkbox" || element.type == "radio")) {
+        if (isInputElement || element.type == "checkbox" || element.type == "radio") {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:7:32
             isInputElement = tagName == "input";
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (isInputElement && (element.type == "checkbox" || element.type == "radio")) {
+        if (isInputElement && (false || element.type == "radio")) {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] ArrayDeclaration
src/binding/defaultBindings/value.js:12:29
             return;
         }
 
-        var eventsToCatch = [];
+        var eventsToCatch = ["Stryker was here"];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;

[Survived] StringLiteral
src/binding/defaultBindings/value.js:13:54
         }
 
         var eventsToCatch = [];
-        var requestedEventsToCatch = allBindings.get("valueUpdate");
+        var requestedEventsToCatch = allBindings.get("");
         var propertyChangedFired = false;
         var elementValueBeforeEvent = null;

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:14:36
 
         var eventsToCatch = [];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
-        var propertyChangedFired = false;
+        var propertyChangedFired = true;
         var elementValueBeforeEvent = null;
 

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:17:13
         var propertyChangedFired = false;
         var elementValueBeforeEvent = null;
 
-        if (requestedEventsToCatch) {
+        if (false) {
             // Allow both individual event names, and arrays of event names
             if (typeof requestedEventsToCatch == "string") {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:17:13
         var propertyChangedFired = false;
         var elementValueBeforeEvent = null;
 
-        if (requestedEventsToCatch) {
+        if (true) {
             // Allow both individual event names, and arrays of event names
             if (typeof requestedEventsToCatch == "string") {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:19:60
 
         if (requestedEventsToCatch) {
             // Allow both individual event names, and arrays of event names
-            if (typeof requestedEventsToCatch == "string") {
-                eventsToCatch = [requestedEventsToCatch];
-            } else {
+            if (typeof requestedEventsToCatch == "string") {} else {
                 eventsToCatch = ko.utils.arrayGetDistinctValues(requestedEventsToCatch);
             }

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:19:17
 
         if (requestedEventsToCatch) {
             // Allow both individual event names, and arrays of event names
-            if (typeof requestedEventsToCatch == "string") {
+            if (false) {
                 eventsToCatch = [requestedEventsToCatch];
             } else {

[Survived] ArrayDeclaration
src/binding/defaultBindings/value.js:20:33
         if (requestedEventsToCatch) {
             // Allow both individual event names, and arrays of event names
             if (typeof requestedEventsToCatch == "string") {
-                eventsToCatch = [requestedEventsToCatch];
+                eventsToCatch = [];
             } else {
                 eventsToCatch = ko.utils.arrayGetDistinctValues(requestedEventsToCatch);

[Survived] BlockStatement
src/binding/defaultBindings/value.js:21:20
             // Allow both individual event names, and arrays of event names
             if (typeof requestedEventsToCatch == "string") {
                 eventsToCatch = [requestedEventsToCatch];
-            } else {
-                eventsToCatch = ko.utils.arrayGetDistinctValues(requestedEventsToCatch);
-            }
+            } else {}
             ko.utils.arrayRemoveItem(eventsToCatch, "change");  // We'll subscribe to "change" events later
         }

[Survived] BlockStatement
src/binding/defaultBindings/value.js:27:45
             ko.utils.arrayRemoveItem(eventsToCatch, "change");  // We'll subscribe to "change" events later
         }
 
-        var valueUpdateHandler = function() {
-            elementValueBeforeEvent = null;
-            propertyChangedFired = false;
-            var modelValue = valueAccessor();
-            var elementValue = ko.selectExtensions.readValue(element);
-            ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'value', elementValue);
-        }
+        var valueUpdateHandler = function() {}
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:29:36
 
         var valueUpdateHandler = function() {
             elementValueBeforeEvent = null;
-            propertyChangedFired = false;
+            propertyChangedFired = true;
             var modelValue = valueAccessor();
             var elementValue = ko.selectExtensions.readValue(element);

[Survived] StringLiteral
src/binding/defaultBindings/value.js:32:82
             propertyChangedFired = false;
             var modelValue = valueAccessor();
             var elementValue = ko.selectExtensions.readValue(element);
-            ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'value', elementValue);
+            ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, "", elementValue);
         }
 

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:37:40
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
+        var ieAutoCompleteHackNeeded = ko.utils.ieVersion || isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:37:40
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+        var ieAutoCompleteHackNeeded = true;
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:38:94
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete != "off" && (!element.form || false);
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:38:77
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete != "off" && (true);
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] UnaryOperator
src/binding/defaultBindings/value.js:39:99
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
+        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == +1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:39:13
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
+        if (false) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:40:107
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
-            ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
+            ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "blur", function() {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:40:82
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
-            ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
+            ko.utils.registerEventHandler(element, "propertychange", function () {});
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "blur", function() {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:41:73
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
-            ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
+            ko.utils.registerEventHandler(element, "focus", function () {});
             ko.utils.registerEventHandler(element, "blur", function() {
                 if (propertyChangedFired) {

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:41:98
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
-            ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
+            ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "blur", function() {
                 if (propertyChangedFired) {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:42:71
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
-            ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
-                    valueUpdateHandler();
-                }
-            });
+            ko.utils.registerEventHandler(element, "blur", function() {});
         }
 

[Survived] BlockStatement
src/binding/defaultBindings/value.js:43:43
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
-                    valueUpdateHandler();
-                }
+                if (propertyChangedFired) {}
             });
         }

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:43:21
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
+                if (false) {
                     valueUpdateHandler();
                 }

[Survived] BlockStatement
src/binding/defaultBindings/value.js:49:66
             });
         }
 
-        ko.utils.arrayForEach(eventsToCatch, function(eventName) {
-            // The syntax "after<eventname>" means "run the handler asynchronously after the event"
-            // This is useful, for example, to catch "keydown" events after the browser has updated the control
-            // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
-            var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    ko.utils.setTimeout(valueUpdateHandler, 0);
-                };
-                eventName = eventName.substring("after".length);
-            }
-            ko.utils.registerEventHandler(element, eventName, handler);
-        });
+        ko.utils.arrayForEach(eventsToCatch, function(eventName) {});
 
         var updateFromModel;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:54:17
             // This is useful, for example, to catch "keydown" events after the browser has updated the control
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
+            if (false) {
                 handler = function() {
                     // The elementValueBeforeEvent variable is non-null *only* during the brief gap between

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:54:17
             // This is useful, for example, to catch "keydown" events after the browser has updated the control
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
+            if (true) {
                 handler = function() {
                     // The elementValueBeforeEvent variable is non-null *only* during the brief gap between

[Survived] BlockStatement
src/binding/defaultBindings/value.js:55:38
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
             if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    ko.utils.setTimeout(valueUpdateHandler, 0);
-                };
+                handler = function() {};
                 eventName = eventName.substring("after".length);
             }

[Survived] MethodExpression
src/binding/defaultBindings/value.js:66:29
                     elementValueBeforeEvent = ko.selectExtensions.readValue(element);
                     ko.utils.setTimeout(valueUpdateHandler, 0);
                 };
-                eventName = eventName.substring("after".length);
+                eventName = eventName;
             }
             ko.utils.registerEventHandler(element, eventName, handler);

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:73:13
 
         var updateFromModel;
 
-        if (isInputElement && element.type == "file") {
+        if (true) {
             // For file input elements, can only write the empty string
             updateFromModel = function () {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:73:13
 
         var updateFromModel;
 
-        if (isInputElement && element.type == "file") {
+        if (false) {
             // For file input elements, can only write the empty string
             updateFromModel = function () {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:75:43
 
         if (isInputElement && element.type == "file") {
             // For file input elements, can only write the empty string
-            updateFromModel = function () {
-                var newValue = ko.utils.unwrapObservable(valueAccessor());
-                if (newValue === null || newValue === undefined || newValue === "") {
-                    element.value = "";
-                } else {
-                    ko.dependencyDetection.ignore(valueUpdateHandler);  // reset the model to match the element
-                }
-            }
+            updateFromModel = function () {}
         } else {
             updateFromModel = function () {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:77:42
             // For file input elements, can only write the empty string
             updateFromModel = function () {
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
-                if (newValue === null || newValue === undefined || newValue === "") {
+                if (newValue === null || false || newValue === "") {
                     element.value = "";
                 } else {

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:77:21
             // For file input elements, can only write the empty string
             updateFromModel = function () {
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
-                if (newValue === null || newValue === undefined || newValue === "") {
+                if (newValue === null && newValue === undefined || newValue === "") {
                     element.value = "";
                 } else {

[Survived] StringLiteral
src/binding/defaultBindings/value.js:78:37
             updateFromModel = function () {
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
                 if (newValue === null || newValue === undefined || newValue === "") {
-                    element.value = "";
+                    element.value = "Stryker was here!";
                 } else {
                     ko.dependencyDetection.ignore(valueUpdateHandler);  // reset the model to match the element

[Survived] BlockStatement
src/binding/defaultBindings/value.js:79:24
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
                 if (newValue === null || newValue === undefined || newValue === "") {
                     element.value = "";
-                } else {
-                    ko.dependencyDetection.ignore(valueUpdateHandler);  // reset the model to match the element
-                }
+                } else {}
             }
         } else {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:84:43
                 }
             }
         } else {
-            updateFromModel = function () {
-                var newValue = ko.utils.unwrapObservable(valueAccessor());
-                var elementValue = ko.selectExtensions.readValue(element);
-
-                if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
-                    ko.utils.setTimeout(updateFromModel, 0);
-                    return;
-                }
-
-                var valueHasChanged = newValue !== elementValue;
-
-                if (valueHasChanged || elementValue === undefined) {
-                    if (tagName === "select") {
-                        var allowUnset = allBindings.get('valueAllowUnset');
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                        if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                            // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                            // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                            ko.dependencyDetection.ignore(valueUpdateHandler);
-                        }
-                    } else {
-                        ko.selectExtensions.writeValue(element, newValue);
-                    }
-                }
-            };
+            updateFromModel = function () {};
         }
 

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:88:57
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
                 var elementValue = ko.selectExtensions.readValue(element);
 
-                if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
+                if (elementValueBeforeEvent !== null && true) {
                     ko.utils.setTimeout(updateFromModel, 0);
                     return;

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:88:21
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
                 var elementValue = ko.selectExtensions.readValue(element);
 
-                if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
+                if (elementValueBeforeEvent === null && newValue === elementValueBeforeEvent) {
                     ko.utils.setTimeout(updateFromModel, 0);
                     return;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:93:39
                     return;
                 }
 
-                var valueHasChanged = newValue !== elementValue;
+                var valueHasChanged = true;
 
                 if (valueHasChanged || elementValue === undefined) {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:93:39
                     return;
                 }
 
-                var valueHasChanged = newValue !== elementValue;
+                var valueHasChanged = false;
 
                 if (valueHasChanged || elementValue === undefined) {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:95:68
 
                 var valueHasChanged = newValue !== elementValue;
 
-                if (valueHasChanged || elementValue === undefined) {
-                    if (tagName === "select") {
-                        var allowUnset = allBindings.get('valueAllowUnset');
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                        if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                            // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                            // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                            ko.dependencyDetection.ignore(valueUpdateHandler);
-                        }
-                    } else {
-                        ko.selectExtensions.writeValue(element, newValue);
-                    }
-                }
+                if (valueHasChanged || elementValue === undefined) {}
             };
         }

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:95:21
 
                 var valueHasChanged = newValue !== elementValue;
 
-                if (valueHasChanged || elementValue === undefined) {
+                if (valueHasChanged && elementValue === undefined) {
                     if (tagName === "select") {
                         var allowUnset = allBindings.get('valueAllowUnset');

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:96:25
                 var valueHasChanged = newValue !== elementValue;
 
                 if (valueHasChanged || elementValue === undefined) {
-                    if (tagName === "select") {
+                    if (true) {
                         var allowUnset = allBindings.get('valueAllowUnset');
                         ko.selectExtensions.writeValue(element, newValue, allowUnset);
