[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:116:33
                             mapData = lastMappingResult[lastMappingResultIndex];
 
                             // Stop tracking changes to the mapping for these nodes
-                            if (mapData.dependentObservable) {
+                            if (true) {
                                 mapData.dependentObservable.dispose();
                                 mapData.dependentObservable = undefined;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:122:33
                             }
 
                             // Queue these nodes for later removal
-                            if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
+                            if (false) {
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:122:33
                             }
 
                             // Queue these nodes for later removal
-                            if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
+                            if (true) {
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:123:37
 
                             // Queue these nodes for later removal
                             if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
+                                if (false) {
                                     newMappingResult.push(mapData);
                                     countWaitingForRemove++;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:123:62
 
                             // Queue these nodes for later removal
                             if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
-                                    newMappingResult.push(mapData);
-                                    countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
-                                        mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks[mapData.indexObservable.peek()] = mapData;
-                                    }
-                                }
+                                if (options['beforeRemove']) {}
                                 if (mapData) {
                                     nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:125:37
                             if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);
-                                    countWaitingForRemove++;
+                                    countWaitingForRemove--;
                                     if (mapData.arrayEntry === deletedItemDummyValue) {
                                         mapData = null;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:126:41
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);
                                     countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
+                                    if (true) {
                                         mapData = null;
                                     } else {

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:126:41
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);
                                     countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
+                                    if (false) {
                                         mapData = null;
                                     } else {

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:128:44
                                     countWaitingForRemove++;
                                     if (mapData.arrayEntry === deletedItemDummyValue) {
                                         mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks[mapData.indexObservable.peek()] = mapData;
-                                    }
+                                    } else {}
                                 }
                                 if (mapData) {

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:132:46
                                         itemsForBeforeRemoveCallbacks[mapData.indexObservable.peek()] = mapData;
                                     }
                                 }
-                                if (mapData) {
-                                    nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);
-                                }
+                                if (mapData) {}
                             }
                         }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:132:37
                                         itemsForBeforeRemoveCallbacks[mapData.indexObservable.peek()] = mapData;
                                     }
                                 }
-                                if (mapData) {
+                                if (false) {
                                     nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);
                                 }

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:137:25
                                 }
                             }
                         }
-                        lastMappingResultIndex++;
+                        lastMappingResultIndex--;
                         break;
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:140:21
                         lastMappingResultIndex++;
                         break;
 
-                    case "added":
-                        while (currentArrayIndex < itemIndex) {
-                            itemMovedOrRetained(lastMappingResultIndex++);
-                        }
-                        if (movedIndex !== undefined) {
-                            itemsToMoveFirstIndexes.push(newMappingResult.length);
-                            itemMovedOrRetained(movedIndex);
-                        } else {
-                            itemAdded(editScriptItem['value']);
-                        }
-                        break;
+                    case "added":
                 }
             }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:141:32
                         break;
 
                     case "added":
-                        while (currentArrayIndex < itemIndex) {
+                        while (false) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:141:32
                         break;
 
                     case "added":
-                        while (currentArrayIndex < itemIndex) {
+                        while (currentArrayIndex >= itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:142:49
 
                     case "added":
                         while (currentArrayIndex < itemIndex) {
-                            itemMovedOrRetained(lastMappingResultIndex++);
+                            itemMovedOrRetained(lastMappingResultIndex--);
                         }
                         if (movedIndex !== undefined) {

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:144:29
                         while (currentArrayIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }
-                        if (movedIndex !== undefined) {
+                        if (movedIndex === undefined) {
                             itemsToMoveFirstIndexes.push(newMappingResult.length);
                             itemMovedOrRetained(movedIndex);

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:144:55
                         while (currentArrayIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }
-                        if (movedIndex !== undefined) {
-                            itemsToMoveFirstIndexes.push(newMappingResult.length);
-                            itemMovedOrRetained(movedIndex);
-                        } else {
+                        if (movedIndex !== undefined) {} else {
                             itemAdded(editScriptItem['value']);
                         }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:147:32
                         if (movedIndex !== undefined) {
                             itemsToMoveFirstIndexes.push(newMappingResult.length);
                             itemMovedOrRetained(movedIndex);
-                        } else {
-                            itemAdded(editScriptItem['value']);
-                        }
+                        } else {}
                         break;
                 }

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:154:20
                 }
             }
 
-            while (currentArrayIndex < array.length) {
+            while (currentArrayIndex >= array.length) {
                 itemMovedOrRetained(lastMappingResultIndex++);
             }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:154:20
                 }
             }
 
-            while (currentArrayIndex < array.length) {
+            while (false) {
                 itemMovedOrRetained(lastMappingResultIndex++);
             }

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:155:37
             }
 
             while (currentArrayIndex < array.length) {
-                itemMovedOrRetained(lastMappingResultIndex++);
+                itemMovedOrRetained(lastMappingResultIndex--);
             }
 

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:176:13
 
         // Since most browsers remove the focus from an element when it's moved to another location,
         // save the focused element and try to restore it later.
-        try {
-            activeElement = domNode.ownerDocument.activeElement;
-        } catch(e) {
+        try {} catch(e) {
             // IE9 throws if you access activeElement during page load (see issue #703)
         }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:183:13
         }
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
-        if (itemsToMoveFirstIndexes.length) {
+        if (false) {
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:183:13
         }
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
-        if (itemsToMoveFirstIndexes.length) {
+        if (true) {
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:184:20
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
         if (itemsToMoveFirstIndexes.length) {
-            while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
+            while (false) {
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:184:20
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
         if (itemsToMoveFirstIndexes.length) {
-            while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
+            while ((i = itemsToMoveFirstIndexes.shift()) == undefined) {
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:186:44
         if (itemsToMoveFirstIndexes.length) {
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];
-                for (lastNode = undefined; i; ) {
+                for (lastNode = undefined; false; ) {
                     if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
                         lastNode = mappedNodes[mappedNodes.length - 1];

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:186:49
         if (itemsToMoveFirstIndexes.length) {
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];
-                for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
-                        lastNode = mappedNodes[mappedNodes.length - 1];
-                        break;
-                    }
-                }
+                for (lastNode = undefined; i; ) {}
                 for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:187:25
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
+                    if (false) {
                         lastNode = mappedNodes[mappedNodes.length - 1];
                         break;

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:187:57
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
+                    if ((mappedNodes = newMappingResult[++i].mappedNodes) && mappedNodes.length) {
                         lastNode = mappedNodes[mappedNodes.length - 1];
                         break;

[Survived] ArithmeticOperator
src/binding/editDetection/arrayToDomNodeChildren.js:188:48
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {
                     if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
-                        lastNode = mappedNodes[mappedNodes.length - 1];
+                        lastNode = mappedNodes[mappedNodes.length + 1];
                         break;
                     }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:192:29
                         break;
                     }
                 }
-                for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
+                for (j = 0; false; lastNode = nodeToInsert, j++) {
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
                 }

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:192:93
                         break;
                     }
                 }
-                for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
+                for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j--) {
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
                 }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:199:21
         }
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
-        for (i = 0; mapData = newMappingResult[i]; i++) {
+        for (i = 0; false; i++) {
             // Get nodes for newly added items
             if (!mapData.mappedNodes)

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:199:52
         }
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
-        for (i = 0; mapData = newMappingResult[i]; i++) {
+        for (i = 0; mapData = newMappingResult[i]; i--) {
             // Get nodes for newly added items
             if (!mapData.mappedNodes)

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:201:17
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
         for (i = 0; mapData = newMappingResult[i]; i++) {
             // Get nodes for newly added items
-            if (!mapData.mappedNodes)
+            if (false)
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:201:17
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
         for (i = 0; mapData = newMappingResult[i]; i++) {
             // Get nodes for newly added items
-            if (!mapData.mappedNodes)
+            if (true)
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:205:25
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 
             // Put nodes in the right place if they aren't there already
-            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
+            for (j = 0; false; lastNode = nodeToInsert, j++) {
                 ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
             }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:205:94
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 
             // Put nodes in the right place if they aren't there already
-            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
-                ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
-            }
+            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {}
 
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:210:17
             }
 
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)
-            if (!mapData.initialized && callbackAfterAddingNodes) {
+            if (true) {
                 callbackAfterAddingNodes(mapData.arrayEntry, mapData.mappedNodes, mapData.indexObservable);
                 mapData.initialized = true;

[Survived] BooleanLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:210:17
             }
 
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)
-            if (!mapData.initialized && callbackAfterAddingNodes) {
+            if (mapData.initialized && callbackAfterAddingNodes) {
                 callbackAfterAddingNodes(mapData.arrayEntry, mapData.mappedNodes, mapData.indexObservable);
                 mapData.initialized = true;

[Survived] BooleanLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:212:39
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)
             if (!mapData.initialized && callbackAfterAddingNodes) {
                 callbackAfterAddingNodes(mapData.arrayEntry, mapData.mappedNodes, mapData.indexObservable);
-                mapData.initialized = true;
+                mapData.initialized = false;
                 lastNode = mapData.mappedNodes[mapData.mappedNodes.length - 1];     // get the last node again since it may have been changed by a preprocessor
             }

[Survived] ArithmeticOperator
src/binding/editDetection/arrayToDomNodeChildren.js:213:48
             if (!mapData.initialized && callbackAfterAddingNodes) {
                 callbackAfterAddingNodes(mapData.arrayEntry, mapData.mappedNodes, mapData.indexObservable);
                 mapData.initialized = true;
-                lastNode = mapData.mappedNodes[mapData.mappedNodes.length - 1];     // get the last node again since it may have been changed by a preprocessor
+                lastNode = mapData.mappedNodes[mapData.mappedNodes.length + 1];     // get the last node again since it may have been changed by a preprocessor
             }
         }

[Survived] LogicalOperator
src/binding/editDetection/arrayToDomNodeChildren.js:218:13
         }
 
         // Restore the focused element if it had lost focus
-        if (activeElement && domNode.ownerDocument.activeElement != activeElement && typeof activeElement.focus === "function") {
+        if (activeElement || domNode.ownerDocument.activeElement != activeElement && typeof activeElement.focus === "function") {
             activeElement.focus();
         }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:218:13
         }
 
         // Restore the focused element if it had lost focus
-        if (activeElement && domNode.ownerDocument.activeElement != activeElement && typeof activeElement.focus === "function") {
+        if (false) {
             activeElement.focus();
         }

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:232:21
         // Replace the stored values of deleted items with a dummy value. This provides two benefits: it marks this item
         // as already "removed" so we won't call beforeRemove for it again, and it ensures that the item won't match up
         // with an actual item in the array and appear as "retained" or "moved".
-        for (i = 0; i < itemsForBeforeRemoveCallbacks.length; ++i) {
+        for (i = 0; i >= itemsForBeforeRemoveCallbacks.length; ++i) {
             if (itemsForBeforeRemoveCallbacks[i]) {
                 itemsForBeforeRemoveCallbacks[i].arrayEntry = deletedItemDummyValue;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:232:21
         // Replace the stored values of deleted items with a dummy value. This provides two benefits: it marks this item
         // as already "removed" so we won't call beforeRemove for it again, and it ensures that the item won't match up
         // with an actual item in the array and appear as "retained" or "moved".
-        for (i = 0; i < itemsForBeforeRemoveCallbacks.length; ++i) {
+        for (i = 0; false; ++i) {
             if (itemsForBeforeRemoveCallbacks[i]) {
                 itemsForBeforeRemoveCallbacks[i].arrayEntry = deletedItemDummyValue;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:233:17
         // as already "removed" so we won't call beforeRemove for it again, and it ensures that the item won't match up
         // with an actual item in the array and appear as "retained" or "moved".
         for (i = 0; i < itemsForBeforeRemoveCallbacks.length; ++i) {
-            if (itemsForBeforeRemoveCallbacks[i]) {
+            if (false) {
                 itemsForBeforeRemoveCallbacks[i].arrayEntry = deletedItemDummyValue;
             }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:233:51
         // as already "removed" so we won't call beforeRemove for it again, and it ensures that the item won't match up
         // with an actual item in the array and appear as "retained" or "moved".
         for (i = 0; i < itemsForBeforeRemoveCallbacks.length; ++i) {
-            if (itemsForBeforeRemoveCallbacks[i]) {
-                itemsForBeforeRemoveCallbacks[i].arrayEntry = deletedItemDummyValue;
-            }
+            if (itemsForBeforeRemoveCallbacks[i]) {}
         }
 
