[Survived] ConditionalExpression
src/binding/expressionRewriting.js:114:26
     var twoWayBindings = {};
 
     function preProcessBindings(bindingsStringOrKeyValueArray, bindingOptions) {
-        bindingOptions = bindingOptions || {};
+        bindingOptions = true;
 
         function processKeyValue(key, val) {

[Survived] BlockStatement
src/binding/expressionRewriting.js:116:44
     function preProcessBindings(bindingsStringOrKeyValueArray, bindingOptions) {
         bindingOptions = bindingOptions || {};
 
-        function processKeyValue(key, val) {
-            var writableVal;
-            function callPreprocessHook(obj) {
-                return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
-            }
-            if (!bindingParams) {
-                if (!callPreprocessHook(ko['getBindingHandler'](key)))
-                    return;
-
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
-                    // For two-way bindings, provide a write method in case the value
-                    // isn't a writable observable.
-                    var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
-                    propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
-                }
-            }
-            // Values are wrapped in a function so that each value can be accessed independently
-            if (makeValueAccessors) {
-                val = 'function(){return ' + val + ' }';
-            }
-            resultStrings.push("'" + key + "':" + val);
-        }
+        function processKeyValue(key, val) {}
 
         var resultStrings = [],

[Survived] BlockStatement
src/binding/expressionRewriting.js:118:46
 
         function processKeyValue(key, val) {
             var writableVal;
-            function callPreprocessHook(obj) {
-                return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
-            }
+            function callPreprocessHook(obj) {}
             if (!bindingParams) {
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))

[Survived] LogicalOperator
src/binding/expressionRewriting.js:119:25
         function processKeyValue(key, val) {
             var writableVal;
             function callPreprocessHook(obj) {
-                return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
+                return (obj || obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
             if (!bindingParams) {

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:119:25
         function processKeyValue(key, val) {
             var writableVal;
             function callPreprocessHook(obj) {
-                return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
+                return (true) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
             if (!bindingParams) {

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:121:17
             function callPreprocessHook(obj) {
                 return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
-            if (!bindingParams) {
+            if (false) {
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;

[Survived] BlockStatement
src/binding/expressionRewriting.js:121:33
             function callPreprocessHook(obj) {
                 return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
-            if (!bindingParams) {
-                if (!callPreprocessHook(ko['getBindingHandler'](key)))
-                    return;
-
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
-                    // For two-way bindings, provide a write method in case the value
-                    // isn't a writable observable.
-                    var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
-                    propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
-                }
-            }
+            if (!bindingParams) {}
             // Values are wrapped in a function so that each value can be accessed independently
             if (makeValueAccessors) {

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:122:21
                 return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
             if (!bindingParams) {
-                if (!callPreprocessHook(ko['getBindingHandler'](key)))
+                if (false)
                     return;
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:122:21
                 return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
             if (!bindingParams) {
-                if (!callPreprocessHook(ko['getBindingHandler'](key)))
+                if (true)
                     return;
 

[Survived] LogicalOperator
src/binding/expressionRewriting.js:125:21
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;
 
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
+                if (twoWayBindings[key] || (writableVal = getWriteableValue(val))) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.

[Survived] BlockStatement
src/binding/expressionRewriting.js:125:84
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;
 
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
-                    // For two-way bindings, provide a write method in case the value
-                    // isn't a writable observable.
-                    var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
-                    propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
-                }
+                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {}
             }
             // Values are wrapped in a function so that each value can be accessed independently

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:128:36
                 if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.
-                    var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
+                    var writeKey = false ? twoWayBindings[key] : key;
                     propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
                 }

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:128:36
                 if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.
-                    var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
+                    var writeKey = true ? twoWayBindings[key] : key;
                     propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
                 }

[Survived] StringLiteral
src/binding/expressionRewriting.js:129:56
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.
                     var writeKey = typeof twoWayBindings[key] == 'string' ? twoWayBindings[key] : key;
-                    propertyAccessorResultStrings.push("'" + writeKey + "':function(_z){" + writableVal + "=_z}");
+                    propertyAccessorResultStrings.push("" + writeKey + "':function(_z){" + writableVal + "=_z}");
                 }
             }

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:133:17
                 }
             }
             // Values are wrapped in a function so that each value can be accessed independently
-            if (makeValueAccessors) {
+            if (true) {
                 val = 'function(){return ' + val + ' }';
             }

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:133:17
                 }
             }
             // Values are wrapped in a function so that each value can be accessed independently
-            if (makeValueAccessors) {
+            if (false) {
                 val = 'function(){return ' + val + ' }';
             }

[Timeout] StringLiteral
src/binding/expressionRewriting.js:134:23
             }
             // Values are wrapped in a function so that each value can be accessed independently
             if (makeValueAccessors) {
-                val = 'function(){return ' + val + ' }';
+                val = "" + val + ' }';
             }
             resultStrings.push("'" + key + "':" + val);

[Timeout] StringLiteral
src/binding/expressionRewriting.js:136:32
             if (makeValueAccessors) {
                 val = 'function(){return ' + val + ' }';
             }
-            resultStrings.push("'" + key + "':" + val);
+            resultStrings.push("" + key + "':" + val);
         }
 

[Timeout] StringLiteral
src/binding/expressionRewriting.js:136:44
             if (makeValueAccessors) {
                 val = 'function(){return ' + val + ' }';
             }
-            resultStrings.push("'" + key + "':" + val);
+            resultStrings.push("'" + key + "" + val);
         }
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:143:29
             propertyAccessorResultStrings = [],
             makeValueAccessors = bindingOptions['valueAccessors'],
             bindingParams = bindingOptions['bindingParams'],
-            keyValueArray = typeof bindingsStringOrKeyValueArray === "string" ?
+            keyValueArray = true ?
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:143:29
             propertyAccessorResultStrings = [],
             makeValueAccessors = bindingOptions['valueAccessors'],
             bindingParams = bindingOptions['bindingParams'],
-            keyValueArray = typeof bindingsStringOrKeyValueArray === "string" ?
+            keyValueArray = false ?
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 

[Survived] BlockStatement
src/binding/expressionRewriting.js:146:65
             keyValueArray = typeof bindingsStringOrKeyValueArray === "string" ?
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 
-        ko.utils.arrayForEach(keyValueArray, function(keyValue) {
-            processKeyValue(keyValue.key || keyValue['unknown'], keyValue.value);
-        });
+        ko.utils.arrayForEach(keyValueArray, function(keyValue) {});
 
         if (propertyAccessorResultStrings.length)

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:147:29
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 
         ko.utils.arrayForEach(keyValueArray, function(keyValue) {
-            processKeyValue(keyValue.key || keyValue['unknown'], keyValue.value);
+            processKeyValue(true, keyValue.value);
         });
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:147:29
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 
         ko.utils.arrayForEach(keyValueArray, function(keyValue) {
-            processKeyValue(keyValue.key || keyValue['unknown'], keyValue.value);
+            processKeyValue(false, keyValue.value);
         });
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:150:13
             processKeyValue(keyValue.key || keyValue['unknown'], keyValue.value);
         });
 
-        if (propertyAccessorResultStrings.length)
+        if (false)
             processKeyValue('_ko_property_writers', "{" + propertyAccessorResultStrings.join(",") + " }");
 

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:150:13
             processKeyValue(keyValue.key || keyValue['unknown'], keyValue.value);
         });
 
-        if (propertyAccessorResultStrings.length)
+        if (true)
             processKeyValue('_ko_property_writers', "{" + propertyAccessorResultStrings.join(",") + " }");
 

[Survived] StringLiteral
src/binding/expressionRewriting.js:153:35
         if (propertyAccessorResultStrings.length)
             processKeyValue('_ko_property_writers', "{" + propertyAccessorResultStrings.join(",") + " }");
 
-        return resultStrings.join(",");
+        return resultStrings.join("");
     }
 

[Survived] ArrayDeclaration
src/binding/expressionRewriting.js:157:35
     }
 
     return {
-        bindingRewriteValidators: [],
+        bindingRewriteValidators: ["Stryker was here"],
 
         twoWayBindings: twoWayBindings,

[Survived] BlockStatement
src/binding/expressionRewriting.js:165:64
 
         preProcessBindings: preProcessBindings,
 
-        keyValueArrayContainsKey: function(keyValueArray, key) {
-            for (var i = 0; i < keyValueArray.length; i++)
-                if (keyValueArray[i]['key'] == key)
-                    return true;
-            return false;
-        },
+        keyValueArrayContainsKey: function(keyValueArray, key) {},
 
         // Internal, private KO utility for updating model properties from within bindings

[Survived] UpdateOperator
src/binding/expressionRewriting.js:166:55
         preProcessBindings: preProcessBindings,
 
         keyValueArrayContainsKey: function(keyValueArray, key) {
-            for (var i = 0; i < keyValueArray.length; i++)
+            for (var i = 0; i < keyValueArray.length; i--)
                 if (keyValueArray[i]['key'] == key)
                     return true;

[Survived] EqualityOperator
src/binding/expressionRewriting.js:166:29
         preProcessBindings: preProcessBindings,
 
         keyValueArrayContainsKey: function(keyValueArray, key) {
-            for (var i = 0; i < keyValueArray.length; i++)
+            for (var i = 0; i >= keyValueArray.length; i++)
                 if (keyValueArray[i]['key'] == key)
                     return true;

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:167:21
 
         keyValueArrayContainsKey: function(keyValueArray, key) {
             for (var i = 0; i < keyValueArray.length; i++)
-                if (keyValueArray[i]['key'] == key)
+                if (true)
                     return true;
             return false;

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:167:21
 
         keyValueArrayContainsKey: function(keyValueArray, key) {
             for (var i = 0; i < keyValueArray.length; i++)
-                if (keyValueArray[i]['key'] == key)
+                if (false)
                     return true;
             return false;

[Survived] BooleanLiteral
src/binding/expressionRewriting.js:168:28
         keyValueArrayContainsKey: function(keyValueArray, key) {
             for (var i = 0; i < keyValueArray.length; i++)
                 if (keyValueArray[i]['key'] == key)
-                    return true;
+                    return false;
             return false;
         },

[Survived] BooleanLiteral
src/binding/expressionRewriting.js:169:20
             for (var i = 0; i < keyValueArray.length; i++)
                 if (keyValueArray[i]['key'] == key)
                     return true;
-            return false;
+            return true;
         },
 

[Survived] BlockStatement
src/binding/expressionRewriting.js:181:93
         // value:               The value to be written
         // checkIfDifferent:    If true, and if the property being written is a writable observable, the value will only be written if
         //                      it is !== existing value on that writable observable
-        writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
-            if (!property || !ko.isObservable(property)) {
-                var propWriters = allBindings.get('_ko_property_writers');
-                if (propWriters && propWriters[key])
-                    propWriters[key](value);
-            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
-                property(value);
-            }
-        }
+        writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {}
     };
 })();

[Survived] BlockStatement
src/binding/expressionRewriting.js:182:58
         // checkIfDifferent:    If true, and if the property being written is a writable observable, the value will only be written if
         //                      it is !== existing value on that writable observable
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
-            if (!property || !ko.isObservable(property)) {
-                var propWriters = allBindings.get('_ko_property_writers');
-                if (propWriters && propWriters[key])
-                    propWriters[key](value);
-            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
+            if (!property || !ko.isObservable(property)) {} else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
                 property(value);
             }

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:182:17
         // checkIfDifferent:    If true, and if the property being written is a writable observable, the value will only be written if
         //                      it is !== existing value on that writable observable
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
-            if (!property || !ko.isObservable(property)) {
+            if (false) {
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:184:21
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
             if (!property || !ko.isObservable(property)) {
                 var propWriters = allBindings.get('_ko_property_writers');
-                if (propWriters && propWriters[key])
+                if (false)
                     propWriters[key](value);
             } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:184:21
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
             if (!property || !ko.isObservable(property)) {
                 var propWriters = allBindings.get('_ko_property_writers');
-                if (propWriters && propWriters[key])
+                if (true)
                     propWriters[key](value);
             } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {

[Survived] LogicalOperator
src/binding/expressionRewriting.js:186:24
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])
                     propWriters[key](value);
-            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
+            } else if (ko.isWriteableObservable(property) || !checkIfDifferent || property.peek() !== value) {
                 property(value);
             }

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:186:24
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])
                     propWriters[key](value);
-            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
+            } else if (true) {
                 property(value);
             }

[Survived] StringLiteral
src/binding/expressionRewriting.js:195:17
 
 ko.exportSymbol('expressionRewriting', ko.expressionRewriting);
 ko.exportSymbol('expressionRewriting.bindingRewriteValidators', ko.expressionRewriting.bindingRewriteValidators);
-ko.exportSymbol('expressionRewriting.parseObjectLiteral', ko.expressionRewriting.parseObjectLiteral);
+ko.exportSymbol("", ko.expressionRewriting.parseObjectLiteral);
 ko.exportSymbol('expressionRewriting.preProcessBindings', ko.expressionRewriting.preProcessBindings);
 
