[Survived] StringLiteral
src/binding/selectExtensions.js:2:37
 (function () {
-    var hasDomDataExpandoProperty = '__ko__hasDomDataOptionValue__';
+    var hasDomDataExpandoProperty = "";
 
     // Normally, SELECT elements and their OPTIONs can only take value of type 'string' (because the values

[Survived] BlockStatement
src/binding/selectExtensions.js:8:39
     // are stored on DOM attributes). ko.selectExtensions provides a way for SELECTs/OPTIONs to have values
     // that are arbitrary objects. This is very convenient when implementing things like cascading dropdowns.
     ko.selectExtensions = {
-        readValue : function(element) {
-            switch (ko.utils.tagNameLower(element)) {
-                case 'option':
-                    if (element[hasDomDataExpandoProperty] === true)
-                        return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
-                    return ko.utils.ieVersion <= 7
-                        ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
-                        : element.value;
-                case 'select':
-                    return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
-                default:
-                    return element.value;
-            }
-        },
+        readValue : function(element) {},
 
         writeValue: function(element, value, allowUnset) {

[Survived] ConditionalExpression
src/binding/selectExtensions.js:10:17
     ko.selectExtensions = {
         readValue : function(element) {
             switch (ko.utils.tagNameLower(element)) {
-                case 'option':
-                    if (element[hasDomDataExpandoProperty] === true)
-                        return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
-                    return ko.utils.ieVersion <= 7
-                        ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
-                        : element.value;
+                case 'option':
                 case 'select':
                     return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;

[Survived] StringLiteral
src/binding/selectExtensions.js:10:22
     ko.selectExtensions = {
         readValue : function(element) {
             switch (ko.utils.tagNameLower(element)) {
-                case 'option':
+                case "":
                     if (element[hasDomDataExpandoProperty] === true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);

[Survived] ConditionalExpression
src/binding/selectExtensions.js:11:25
         readValue : function(element) {
             switch (ko.utils.tagNameLower(element)) {
                 case 'option':
-                    if (element[hasDomDataExpandoProperty] === true)
+                    if (true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
                     return ko.utils.ieVersion <= 7

[Survived] BooleanLiteral
src/binding/selectExtensions.js:11:64
         readValue : function(element) {
             switch (ko.utils.tagNameLower(element)) {
                 case 'option':
-                    if (element[hasDomDataExpandoProperty] === true)
+                    if (element[hasDomDataExpandoProperty] === false)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
                     return ko.utils.ieVersion <= 7

[Survived] ConditionalExpression
src/binding/selectExtensions.js:13:28
                 case 'option':
                     if (element[hasDomDataExpandoProperty] === true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
-                    return ko.utils.ieVersion <= 7
+                    return true
                         ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;

[Survived] EqualityOperator
src/binding/selectExtensions.js:13:28
                 case 'option':
                     if (element[hasDomDataExpandoProperty] === true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
-                    return ko.utils.ieVersion <= 7
+                    return ko.utils.ieVersion > 7
                         ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;

[Survived] LogicalOperator
src/binding/selectExtensions.js:14:28
                     if (element[hasDomDataExpandoProperty] === true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
                     return ko.utils.ieVersion <= 7
-                        ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
+                        ? (element.getAttributeNode('value') || element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;
                 case 'select':

[Survived] ConditionalExpression
src/binding/selectExtensions.js:14:28
                     if (element[hasDomDataExpandoProperty] === true)
                         return ko.utils.domData.get(element, ko.bindingHandlers.options.optionValueDomDataKey);
                     return ko.utils.ieVersion <= 7
-                        ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
+                        ? (true ? element.value : element.text)
                         : element.value;
                 case 'select':

[Survived] ConditionalExpression
src/binding/selectExtensions.js:16:17
                     return ko.utils.ieVersion <= 7
                         ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;
-                case 'select':
-                    return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
+                case 'select':
                 default:
                     return element.value;

[Survived] EqualityOperator
src/binding/selectExtensions.js:17:28
                         ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;
                 case 'select':
-                    return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
+                    return element.selectedIndex > 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
                 default:
                     return element.value;

[Survived] EqualityOperator
src/binding/selectExtensions.js:17:28
                         ? (element.getAttributeNode('value') && element.getAttributeNode('value').specified ? element.value : element.text)
                         : element.value;
                 case 'select':
-                    return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
+                    return element.selectedIndex < 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
                 default:
                     return element.value;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:18:17
                         : element.value;
                 case 'select':
                     return element.selectedIndex >= 0 ? ko.selectExtensions.readValue(element.options[element.selectedIndex]) : undefined;
-                default:
-                    return element.value;
+                default:
             }
         },

[Survived] ConditionalExpression
src/binding/selectExtensions.js:25:17
 
         writeValue: function(element, value, allowUnset) {
             switch (ko.utils.tagNameLower(element)) {
-                case 'option':
-                    if (typeof value === "string") {
-                        ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, undefined);
-                        if (hasDomDataExpandoProperty in element) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node
-                            delete element[hasDomDataExpandoProperty];
-                        }
-                        element.value = value;
-                    }
-                    else {
-                        // Store arbitrary object using DomData
-                        ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, value);
-                        element[hasDomDataExpandoProperty] = true;
-
-                        // Special treatment of numbers is just for backward compatibility. KO 1.2.1 wrote numerical values to element.value.
-                        element.value = typeof value === "number" ? value : "";
-                    }
-                    break;
+                case 'option':
                 case 'select':
                     if (value === "" || value === null)       // A blank string or null value will select the caption

[Survived] ConditionalExpression
src/binding/selectExtensions.js:26:25
         writeValue: function(element, value, allowUnset) {
             switch (ko.utils.tagNameLower(element)) {
                 case 'option':
-                    if (typeof value === "string") {
+                    if (false) {
                         ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, undefined);
                         if (hasDomDataExpandoProperty in element) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node

[Survived] EqualityOperator
src/binding/selectExtensions.js:26:25
         writeValue: function(element, value, allowUnset) {
             switch (ko.utils.tagNameLower(element)) {
                 case 'option':
-                    if (typeof value === "string") {
+                    if (typeof value !== "string") {
                         ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, undefined);
                         if (hasDomDataExpandoProperty in element) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node

[Survived] ConditionalExpression
src/binding/selectExtensions.js:28:29
                 case 'option':
                     if (typeof value === "string") {
                         ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, undefined);
-                        if (hasDomDataExpandoProperty in element) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node
+                        if (true) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node
                             delete element[hasDomDataExpandoProperty];
                         }

[Survived] BlockStatement
src/binding/selectExtensions.js:28:67
                 case 'option':
                     if (typeof value === "string") {
                         ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, undefined);
-                        if (hasDomDataExpandoProperty in element) { // IE <= 8 throws errors if you delete non-existent properties from a DOM node
-                            delete element[hasDomDataExpandoProperty];
-                        }
+                        if (hasDomDataExpandoProperty in element) {}
                         element.value = value;
                     }

[Survived] BlockStatement
src/binding/selectExtensions.js:33:26
                         }
                         element.value = value;
                     }
-                    else {
-                        // Store arbitrary object using DomData
-                        ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, value);
-                        element[hasDomDataExpandoProperty] = true;
-
-                        // Special treatment of numbers is just for backward compatibility. KO 1.2.1 wrote numerical values to element.value.
-                        element.value = typeof value === "number" ? value : "";
-                    }
+                    else {}
                     break;
                 case 'select':

[Survived] BooleanLiteral
src/binding/selectExtensions.js:36:62
                     else {
                         // Store arbitrary object using DomData
                         ko.utils.domData.set(element, ko.bindingHandlers.options.optionValueDomDataKey, value);
-                        element[hasDomDataExpandoProperty] = true;
+                        element[hasDomDataExpandoProperty] = false;
 
                         // Special treatment of numbers is just for backward compatibility. KO 1.2.1 wrote numerical values to element.value.

[Survived] ConditionalExpression
src/binding/selectExtensions.js:39:41
                         element[hasDomDataExpandoProperty] = true;
 
                         // Special treatment of numbers is just for backward compatibility. KO 1.2.1 wrote numerical values to element.value.
-                        element.value = typeof value === "number" ? value : "";
+                        element.value = true ? value : "";
                     }
                     break;

[Survived] EqualityOperator
src/binding/selectExtensions.js:39:41
                         element[hasDomDataExpandoProperty] = true;
 
                         // Special treatment of numbers is just for backward compatibility. KO 1.2.1 wrote numerical values to element.value.
-                        element.value = typeof value === "number" ? value : "";
+                        element.value = typeof value !== "number" ? value : "";
                     }
                     break;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:42:17
                         element.value = typeof value === "number" ? value : "";
                     }
                     break;
-                case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
-                        value = undefined;
-                    var selection = -1;
-                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
-                        optionValue = ko.selectExtensions.readValue(element.options[i]);
-                        // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue === "" && value === undefined)) {
-                            selection = i;
-                            break;
-                        }
-                    }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
-                        element.selectedIndex = selection;
-                        if (ko.utils.ieVersion === 6) {
-                            // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                            // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                            // to apply the value as well.
-                            ko.utils.setTimeout(function () {
-                                element.selectedIndex = selection;
-                            }, 0);
-                        }
-                    }
-                    break;
+                case 'select':
                 default:
                     if ((value === null) || (value === undefined))

[Survived] ConditionalExpression
src/binding/selectExtensions.js:43:25
                     }
                     break;
                 case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
+                    if (false)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:43:25
                     }
                     break;
                 case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
+                    if (false || value === null)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;

[Survived] UnaryOperator
src/binding/selectExtensions.js:45:37
                 case 'select':
                     if (value === "" || value === null)       // A blank string or null value will select the caption
                         value = undefined;
-                    var selection = -1;
+                    var selection = +1;
                     for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);

[Survived] UpdateOperator
src/binding/selectExtensions.js:46:85
                     if (value === "" || value === null)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;
-                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
+                    for (var i = 0, n = element.options.length, optionValue; i < n; --i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value

[Survived] EqualityOperator
src/binding/selectExtensions.js:46:78
                     if (value === "" || value === null)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;
-                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
+                    for (var i = 0, n = element.options.length, optionValue; i <= n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value

[Survived] ConditionalExpression
src/binding/selectExtensions.js:49:76
                     for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue === "" && value === undefined)) {
+                        if (optionValue == value || (optionValue === "" && true)) {
                             selection = i;
                             break;

[Survived] EqualityOperator
src/binding/selectExtensions.js:49:29
                     for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue === "" && value === undefined)) {
+                        if (optionValue != value || (optionValue === "" && value === undefined)) {
                             selection = i;
                             break;

[Survived] BlockStatement
src/binding/selectExtensions.js:54:100
                             break;
                         }
                     }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
-                        element.selectedIndex = selection;
-                        if (ko.utils.ieVersion === 6) {
-                            // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                            // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                            // to apply the value as well.
-                            ko.utils.setTimeout(function () {
-                                element.selectedIndex = selection;
-                            }, 0);
-                        }
-                    }
+                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {}
                     break;
                 default:

[Survived] EqualityOperator
src/binding/selectExtensions.js:54:81
                             break;
                         }
                     }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
+                    if (allowUnset || selection >= 0 || (value === undefined && element.size <= 1)) {
                         element.selectedIndex = selection;
                         if (ko.utils.ieVersion === 6) {

[Survived] EqualityOperator
src/binding/selectExtensions.js:56:29
                     }
                     if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
                         element.selectedIndex = selection;
-                        if (ko.utils.ieVersion === 6) {
+                        if (ko.utils.ieVersion !== 6) {
                             // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
                             // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread

[Survived] BlockStatement
src/binding/selectExtensions.js:56:55
                     }
                     if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
                         element.selectedIndex = selection;
-                        if (ko.utils.ieVersion === 6) {
-                            // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                            // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                            // to apply the value as well.
-                            ko.utils.setTimeout(function () {
-                                element.selectedIndex = selection;
-                            }, 0);
-                        }
+                        if (ko.utils.ieVersion === 6) {}
                     }
                     break;

[Survived] BlockStatement
src/binding/selectExtensions.js:60:61
                             // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
                             // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
                             // to apply the value as well.
-                            ko.utils.setTimeout(function () {
-                                element.selectedIndex = selection;
-                            }, 0);
+                            ko.utils.setTimeout(function () {}, 0);
                         }
                     }

[Survived] ConditionalExpression
src/binding/selectExtensions.js:66:17
                         }
                     }
                     break;
-                default:
-                    if ((value === null) || (value === undefined))
-                        value = "";
-                    element.value = value;
-                    break;
+                default:
             }
         }

[Survived] ConditionalExpression
src/binding/selectExtensions.js:67:25
                     }
                     break;
                 default:
-                    if ((value === null) || (value === undefined))
+                    if (true)
                         value = "";
                     element.value = value;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:67:46
                     }
                     break;
                 default:
-                    if ((value === null) || (value === undefined))
+                    if ((value === null) || (false))
                         value = "";
                     element.value = value;
