[Survived] BlockStatement
src/components/customElements.js:4:63
 (function (undefined) {
     // Overridable API for determining which component name applies to a given node. By overriding this,
     // you can for example map specific tagNames to components that are not preregistered.
-    ko.components['getComponentNameForNode'] = function(node) {
-        var tagNameLower = ko.utils.tagNameLower(node);
-        if (ko.components.isRegistered(tagNameLower)) {
-            // Try to determine that this node can be considered a *custom* element; see https://github.com/knockout/knockout/issues/1603
-            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {
-                return tagNameLower;
-            }
-        }
-    };
+    ko.components['getComponentNameForNode'] = function(node) {};
 
     ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {

[Survived] BlockStatement
src/components/customElements.js:6:55
     // you can for example map specific tagNames to components that are not preregistered.
     ko.components['getComponentNameForNode'] = function(node) {
         var tagNameLower = ko.utils.tagNameLower(node);
-        if (ko.components.isRegistered(tagNameLower)) {
-            // Try to determine that this node can be considered a *custom* element; see https://github.com/knockout/knockout/issues/1603
-            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {
-                return tagNameLower;
-            }
-        }
+        if (ko.components.isRegistered(tagNameLower)) {}
     };
 

[Survived] ConditionalExpression
src/components/customElements.js:6:13
     // you can for example map specific tagNames to components that are not preregistered.
     ko.components['getComponentNameForNode'] = function(node) {
         var tagNameLower = ko.utils.tagNameLower(node);
-        if (ko.components.isRegistered(tagNameLower)) {
+        if (true) {
             // Try to determine that this node can be considered a *custom* element; see https://github.com/knockout/knockout/issues/1603
             if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {

[Survived] BlockStatement
src/components/customElements.js:8:160
         var tagNameLower = ko.utils.tagNameLower(node);
         if (ko.components.isRegistered(tagNameLower)) {
             // Try to determine that this node can be considered a *custom* element; see https://github.com/knockout/knockout/issues/1603
-            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {
-                return tagNameLower;
-            }
+            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {}
         }
     };

[Survived] EqualityOperator
src/components/customElements.js:8:128
         var tagNameLower = ko.utils.tagNameLower(node);
         if (ko.components.isRegistered(tagNameLower)) {
             // Try to determine that this node can be considered a *custom* element; see https://github.com/knockout/knockout/issues/1603
-            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName === tagNameLower)) {
+            if (tagNameLower.indexOf('-') != -1 || ('' + node) == "[object HTMLUnknownElement]" || (ko.utils.ieVersion <= 8 && node.tagName !== tagNameLower)) {
                 return tagNameLower;
             }

[Survived] BlockStatement
src/components/customElements.js:14:109
         }
     };
 
-    ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {
-        // Determine if it's really a custom element matching a component
-        if (node.nodeType === 1) {
-            var componentName = ko.components['getComponentNameForNode'](node);
-            if (componentName) {
-                // It does represent a component, so add a component binding for it
-                allBindings = allBindings || {};
-
-                if (allBindings['component']) {
-                    // Avoid silently overwriting some other 'component' binding that may already be on the element
-                    throw new Error('Cannot use the "component" binding on a custom element matching a component');
-                }
-
-                var componentBindingValue = { 'name': componentName, 'params': getComponentParamsFromCustomElement(node, bindingContext) };
-
-                allBindings['component'] = valueAccessors
-                    ? function() { return componentBindingValue; }
-                    : componentBindingValue;
-            }
-        }
-
-        return allBindings;
-    }
+    ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {}
 
     var nativeBindingProviderInstance = new ko.bindingProvider();

[Survived] EqualityOperator
src/components/customElements.js:16:13
 
     ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {
         // Determine if it's really a custom element matching a component
-        if (node.nodeType === 1) {
+        if (node.nodeType !== 1) {
             var componentName = ko.components['getComponentNameForNode'](node);
             if (componentName) {

[Survived] ConditionalExpression
src/components/customElements.js:16:13
 
     ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {
         // Determine if it's really a custom element matching a component
-        if (node.nodeType === 1) {
+        if (false) {
             var componentName = ko.components['getComponentNameForNode'](node);
             if (componentName) {

[Survived] StringLiteral
src/components/customElements.js:17:47
     ko.components.addBindingsForCustomElement = function(allBindings, node, bindingContext, valueAccessors) {
         // Determine if it's really a custom element matching a component
         if (node.nodeType === 1) {
-            var componentName = ko.components['getComponentNameForNode'](node);
+            var componentName = ko.components[""](node);
             if (componentName) {
                 // It does represent a component, so add a component binding for it

[Survived] ConditionalExpression
src/components/customElements.js:18:17
         // Determine if it's really a custom element matching a component
         if (node.nodeType === 1) {
             var componentName = ko.components['getComponentNameForNode'](node);
-            if (componentName) {
+            if (true) {
                 // It does represent a component, so add a component binding for it
                 allBindings = allBindings || {};

[Survived] ConditionalExpression
src/components/customElements.js:18:17
         // Determine if it's really a custom element matching a component
         if (node.nodeType === 1) {
             var componentName = ko.components['getComponentNameForNode'](node);
-            if (componentName) {
+            if (false) {
                 // It does represent a component, so add a component binding for it
                 allBindings = allBindings || {};

[Survived] LogicalOperator
src/components/customElements.js:20:31
             var componentName = ko.components['getComponentNameForNode'](node);
             if (componentName) {
                 // It does represent a component, so add a component binding for it
-                allBindings = allBindings || {};
+                allBindings = allBindings && {};
 
                 if (allBindings['component']) {

[Survived] ConditionalExpression
src/components/customElements.js:20:31
             var componentName = ko.components['getComponentNameForNode'](node);
             if (componentName) {
                 // It does represent a component, so add a component binding for it
-                allBindings = allBindings || {};
+                allBindings = true;
 
                 if (allBindings['component']) {

[Survived] BlockStatement
src/components/customElements.js:22:47
                 // It does represent a component, so add a component binding for it
                 allBindings = allBindings || {};
 
-                if (allBindings['component']) {
-                    // Avoid silently overwriting some other 'component' binding that may already be on the element
-                    throw new Error('Cannot use the "component" binding on a custom element matching a component');
-                }
+                if (allBindings['component']) {}
 
                 var componentBindingValue = { 'name': componentName, 'params': getComponentParamsFromCustomElement(node, bindingContext) };

[Survived] ConditionalExpression
src/components/customElements.js:22:21
                 // It does represent a component, so add a component binding for it
                 allBindings = allBindings || {};
 
-                if (allBindings['component']) {
+                if (false) {
                     // Avoid silently overwriting some other 'component' binding that may already be on the element
                     throw new Error('Cannot use the "component" binding on a custom element matching a component');

[Survived] StringLiteral
src/components/customElements.js:24:37
 
                 if (allBindings['component']) {
                     // Avoid silently overwriting some other 'component' binding that may already be on the element
-                    throw new Error('Cannot use the "component" binding on a custom element matching a component');
+                    throw new Error("");
                 }
 

[Survived] BlockStatement
src/components/customElements.js:30:34
                 var componentBindingValue = { 'name': componentName, 'params': getComponentParamsFromCustomElement(node, bindingContext) };
 
                 allBindings['component'] = valueAccessors
-                    ? function() { return componentBindingValue; }
+                    ? function() {}
                     : componentBindingValue;
             }

[Survived] ConditionalExpression
src/components/customElements.js:43:13
     function getComponentParamsFromCustomElement(elem, bindingContext) {
         var paramsAttribute = elem.getAttribute('params');
 
-        if (paramsAttribute) {
+        if (true) {
             var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': true }),
                 rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {

[Survived] ConditionalExpression
src/components/customElements.js:43:13
     function getComponentParamsFromCustomElement(elem, bindingContext) {
         var paramsAttribute = elem.getAttribute('params');
 
-        if (paramsAttribute) {
+        if (false) {
             var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': true }),
                 rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {

[Survived] BooleanLiteral
src/components/customElements.js:44:138
         var paramsAttribute = elem.getAttribute('params');
 
         if (paramsAttribute) {
-            var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': true }),
+            var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': false, 'bindingParams': true }),
                 rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {
                     return ko.computed(paramValue, null, { disposeWhenNodeIsRemoved: elem });

[Survived] BooleanLiteral
src/components/customElements.js:44:161
         var paramsAttribute = elem.getAttribute('params');
 
         if (paramsAttribute) {
-            var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': true }),
+            var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': false }),
                 rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {
                     return ko.computed(paramValue, null, { disposeWhenNodeIsRemoved: elem });

[Survived] BlockStatement
src/components/customElements.js:45:101
 
         if (paramsAttribute) {
             var params = nativeBindingProviderInstance['parseBindingsString'](paramsAttribute, bindingContext, elem, { 'valueAccessors': true, 'bindingParams': true }),
-                rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {
-                    return ko.computed(paramValue, null, { disposeWhenNodeIsRemoved: elem });
-                }),
+                rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {}),
                 result = ko.utils.objectMap(rawParamComputedValues, function(paramValueComputed, paramName) {
                     var paramValue = paramValueComputed.peek();

[Survived] BlockStatement
src/components/customElements.js:48:109
                 rawParamComputedValues = ko.utils.objectMap(params, function(paramValue, paramName) {
                     return ko.computed(paramValue, null, { disposeWhenNodeIsRemoved: elem });
                 }),
-                result = ko.utils.objectMap(rawParamComputedValues, function(paramValueComputed, paramName) {
-                    var paramValue = paramValueComputed.peek();
-                    // Does the evaluation of the parameter value unwrap any observables?
-                    if (!paramValueComputed.isActive()) {
-                        // No it doesn't, so there's no need for any computed wrapper. Just pass through the supplied value directly.
-                        // Example: "someVal: firstName, age: 123" (whether or not firstName is an observable/computed)
-                        return paramValue;
-                    } else {
-                        // Yes it does. Supply a computed property that unwraps both the outer (binding expression)
-                        // level of observability, and any inner (resulting model value) level of observability.
-                        // This means the component doesn't have to worry about multiple unwrapping. If the value is a
-                        // writable observable, the computed will also be writable and pass the value on to the observable.
-                        return ko.computed({
-                            'read': function() {
-                                return ko.utils.unwrapObservable(paramValueComputed());
-                            },
-                            'write': ko.isWriteableObservable(paramValue) && function(value) {
-                                paramValueComputed()(value);
-                            },
-                            disposeWhenNodeIsRemoved: elem
-                        });
-                    }
-                });
+                result = ko.utils.objectMap(rawParamComputedValues, function(paramValueComputed, paramName) {});
 
             // Give access to the raw computeds, as long as that wouldn't overwrite any custom param also called '$raw'

[Survived] ConditionalExpression
src/components/customElements.js:51:25
                 result = ko.utils.objectMap(rawParamComputedValues, function(paramValueComputed, paramName) {
                     var paramValue = paramValueComputed.peek();
                     // Does the evaluation of the parameter value unwrap any observables?
-                    if (!paramValueComputed.isActive()) {
+                    if (true) {
                         // No it doesn't, so there's no need for any computed wrapper. Just pass through the supplied value directly.
                         // Example: "someVal: firstName, age: 123" (whether or not firstName is an observable/computed)

[Survived] BlockStatement
src/components/customElements.js:51:57
                 result = ko.utils.objectMap(rawParamComputedValues, function(paramValueComputed, paramName) {
                     var paramValue = paramValueComputed.peek();
                     // Does the evaluation of the parameter value unwrap any observables?
-                    if (!paramValueComputed.isActive()) {
-                        // No it doesn't, so there's no need for any computed wrapper. Just pass through the supplied value directly.
-                        // Example: "someVal: firstName, age: 123" (whether or not firstName is an observable/computed)
-                        return paramValue;
-                    } else {
+                    if (!paramValueComputed.isActive()) {} else {
                         // Yes it does. Supply a computed property that unwraps both the outer (binding expression)
                         // level of observability, and any inner (resulting model value) level of observability.

[Survived] BlockStatement
src/components/customElements.js:55:28
                         // No it doesn't, so there's no need for any computed wrapper. Just pass through the supplied value directly.
                         // Example: "someVal: firstName, age: 123" (whether or not firstName is an observable/computed)
                         return paramValue;
-                    } else {
-                        // Yes it does. Supply a computed property that unwraps both the outer (binding expression)
-                        // level of observability, and any inner (resulting model value) level of observability.
-                        // This means the component doesn't have to worry about multiple unwrapping. If the value is a
-                        // writable observable, the computed will also be writable and pass the value on to the observable.
-                        return ko.computed({
-                            'read': function() {
-                                return ko.utils.unwrapObservable(paramValueComputed());
-                            },
-                            'write': ko.isWriteableObservable(paramValue) && function(value) {
-                                paramValueComputed()(value);
-                            },
-                            disposeWhenNodeIsRemoved: elem
-                        });
-                    }
+                    } else {}
                 });
 

[Survived] ObjectLiteral
src/components/customElements.js:60:44
                         // level of observability, and any inner (resulting model value) level of observability.
                         // This means the component doesn't have to worry about multiple unwrapping. If the value is a
                         // writable observable, the computed will also be writable and pass the value on to the observable.
-                        return ko.computed({
-                            'read': function() {
-                                return ko.utils.unwrapObservable(paramValueComputed());
-                            },
-                            'write': ko.isWriteableObservable(paramValue) && function(value) {
-                                paramValueComputed()(value);
-                            },
-                            disposeWhenNodeIsRemoved: elem
-                        });
+                        return ko.computed({});
                     }
                 });

[Survived] BlockStatement
src/components/customElements.js:61:48
                         // This means the component doesn't have to worry about multiple unwrapping. If the value is a
                         // writable observable, the computed will also be writable and pass the value on to the observable.
                         return ko.computed({
-                            'read': function() {
-                                return ko.utils.unwrapObservable(paramValueComputed());
-                            },
+                            'read': function() {},
                             'write': ko.isWriteableObservable(paramValue) && function(value) {
                                 paramValueComputed()(value);

[Survived] LogicalOperator
src/components/customElements.js:64:38
                             'read': function() {
                                 return ko.utils.unwrapObservable(paramValueComputed());
                             },
-                            'write': ko.isWriteableObservable(paramValue) && function(value) {
-                                paramValueComputed()(value);
-                            },
+                            'write': ko.isWriteableObservable(paramValue) || function (value) {
+  paramValueComputed()(value);
+},
                             disposeWhenNodeIsRemoved: elem
                         });

[Survived] ConditionalExpression
src/components/customElements.js:64:38
                             'read': function() {
                                 return ko.utils.unwrapObservable(paramValueComputed());
                             },
-                            'write': ko.isWriteableObservable(paramValue) && function(value) {
-                                paramValueComputed()(value);
-                            },
+                            'write': false,
                             disposeWhenNodeIsRemoved: elem
                         });

[Survived] BooleanLiteral
src/components/customElements.js:75:17
             // Give access to the raw computeds, as long as that wouldn't overwrite any custom param also called '$raw'
             // This is in case the developer wants to react to outer (binding) observability separately from inner
             // (model value) observability, or in case the model value observable has subobservables.
-            if (!Object.prototype.hasOwnProperty.call(result, '$raw')) {
+            if (Object.prototype.hasOwnProperty.call(result, '$raw')) {
                 result['$raw'] = rawParamComputedValues;
             }

[Survived] BlockStatement
src/components/customElements.js:75:72
             // Give access to the raw computeds, as long as that wouldn't overwrite any custom param also called '$raw'
             // This is in case the developer wants to react to outer (binding) observability separately from inner
             // (model value) observability, or in case the model value observable has subobservables.
-            if (!Object.prototype.hasOwnProperty.call(result, '$raw')) {
-                result['$raw'] = rawParamComputedValues;
-            }
+            if (!Object.prototype.hasOwnProperty.call(result, '$raw')) {}
 
             return result;

[Survived] BlockStatement
src/components/customElements.js:80:16
             }
 
             return result;
-        } else {
-            // For consistency, absence of a "params" attribute is treated the same as the presence of
-            // any empty one. Otherwise component viewmodels need special code to check whether or not
-            // 'params' or 'params.$raw' is null/undefined before reading subproperties, which is annoying.
-            return { '$raw': {} };
-        }
+        } else {}
     }
 

[Survived] ObjectLiteral
src/components/customElements.js:84:20
             // For consistency, absence of a "params" attribute is treated the same as the presence of
             // any empty one. Otherwise component viewmodels need special code to check whether or not
             // 'params' or 'params.$raw' is null/undefined before reading subproperties, which is annoying.
-            return { '$raw': {} };
+            return {};
         }
     }

[Survived] EqualityOperator
src/components/customElements.js:91:9
     // --------------------------------------------------------------------------------
     // Compatibility code for older (pre-HTML5) IE browsers
 
-    if (ko.utils.ieVersion < 9) {
+    if (ko.utils.ieVersion <= 9) {
         // Whenever you preregister a component, enable it as a custom element in the current document
         ko.components['register'] = (function(originalFunction) {

[Survived] EqualityOperator
src/components/customElements.js:91:9
     // --------------------------------------------------------------------------------
     // Compatibility code for older (pre-HTML5) IE browsers
 
-    if (ko.utils.ieVersion < 9) {
+    if (ko.utils.ieVersion >= 9) {
         // Whenever you preregister a component, enable it as a custom element in the current document
         ko.components['register'] = (function(originalFunction) {

[Survived] BlockStatement
src/components/customElements.js:93:65
 
     if (ko.utils.ieVersion < 9) {
         // Whenever you preregister a component, enable it as a custom element in the current document
-        ko.components['register'] = (function(originalFunction) {
-            return function(componentName) {
-                document.createElement(componentName); // Allows IE<9 to parse markup containing the custom element
-                return originalFunction.apply(this, arguments);
-            }
-        })(ko.components['register']);
+        ko.components['register'] = (function(originalFunction) {})(ko.components['register']);
 
         // Whenever you create a document fragment, enable all preregistered component names as custom elements

[Survived] StringLiteral
src/components/customElements.js:93:23
 
     if (ko.utils.ieVersion < 9) {
         // Whenever you preregister a component, enable it as a custom element in the current document
-        ko.components['register'] = (function(originalFunction) {
+        ko.components[""] = (function(originalFunction) {
             return function(componentName) {
                 document.createElement(componentName); // Allows IE<9 to parse markup containing the custom element

[Survived] BlockStatement
src/components/customElements.js:94:44
     if (ko.utils.ieVersion < 9) {
         // Whenever you preregister a component, enable it as a custom element in the current document
         ko.components['register'] = (function(originalFunction) {
-            return function(componentName) {
-                document.createElement(componentName); // Allows IE<9 to parse markup containing the custom element
-                return originalFunction.apply(this, arguments);
-            }
+            return function(componentName) {}
         })(ko.components['register']);
 

[Survived] BlockStatement
src/components/customElements.js:102:71
 
         // Whenever you create a document fragment, enable all preregistered component names as custom elements
         // This is needed to make innerShiv/jQuery HTML parsing correctly handle the custom elements
-        document.createDocumentFragment = (function(originalFunction) {
-            return function() {
-                var newDocFrag = originalFunction(),
-                    allComponents = ko.components._allRegisteredComponents;
-                for (var componentName in allComponents) {
-                    if (Object.prototype.hasOwnProperty.call(allComponents, componentName)) {
-                        newDocFrag.createElement(componentName);
-                    }
-                }
-                return newDocFrag;
-            };
-        })(document.createDocumentFragment);
+        document.createDocumentFragment = (function(originalFunction) {})(document.createDocumentFragment);
     }
 })();

[Survived] BlockStatement
src/components/customElements.js:103:31
         // Whenever you create a document fragment, enable all preregistered component names as custom elements
         // This is needed to make innerShiv/jQuery HTML parsing correctly handle the custom elements
         document.createDocumentFragment = (function(originalFunction) {
-            return function() {
-                var newDocFrag = originalFunction(),
-                    allComponents = ko.components._allRegisteredComponents;
-                for (var componentName in allComponents) {
-                    if (Object.prototype.hasOwnProperty.call(allComponents, componentName)) {
-                        newDocFrag.createElement(componentName);
-                    }
-                }
-                return newDocFrag;
-            };
+            return function() {};
         })(document.createDocumentFragment);
     }

[Survived] BlockStatement
src/components/customElements.js:106:58
             return function() {
                 var newDocFrag = originalFunction(),
                     allComponents = ko.components._allRegisteredComponents;
-                for (var componentName in allComponents) {
-                    if (Object.prototype.hasOwnProperty.call(allComponents, componentName)) {
-                        newDocFrag.createElement(componentName);
-                    }
-                }
+                for (var componentName in allComponents) {}
                 return newDocFrag;
             };
