[Survived] ArithmeticOperator
src/subscribables/observableArray.changeTracking.js:141:35
                 // See https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice
                 var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
-                    endAddIndex = startIndex + argsLength - 2,
+                    endAddIndex = startIndex + argsLength + 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];

[Survived] MethodExpression
src/subscribables/observableArray.changeTracking.js:142:32
                 var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
-                    endIndex = Math.max(endDeleteIndex, endAddIndex),
+                    endIndex = Math.min(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {

[Survived] UpdateOperator
src/subscribables/observableArray.changeTracking.js:144:79
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];
-                for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
+                for (var index = startIndex, argsIndex = 2; index < endIndex; --index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));

[Survived] EqualityOperator
src/subscribables/observableArray.changeTracking.js:144:61
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];
-                for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
+                for (var index = startIndex, argsIndex = 2; index <= endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:145:25
                     endIndex = Math.max(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
-                    if (index < endDeleteIndex)
+                    if (true)
                         deletions.push(pushDiff('deleted', rawArray[index], index));
                     if (index < endAddIndex)

[Survived] EqualityOperator
src/subscribables/observableArray.changeTracking.js:145:25
                     endIndex = Math.max(endDeleteIndex, endAddIndex),
                     additions = [], deletions = [];
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
-                    if (index < endDeleteIndex)
+                    if (index >= endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));
                     if (index < endAddIndex)

[Survived] EqualityOperator
src/subscribables/observableArray.changeTracking.js:147:25
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));
-                    if (index < endAddIndex)
+                    if (index <= endAddIndex)
                         additions.push(pushDiff('added', args[argsIndex], index));
                 }

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:147:25
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));
-                    if (index < endAddIndex)
+                    if (false)
                         additions.push(pushDiff('added', args[argsIndex], index));
                 }

[Survived] StringLiteral
src/subscribables/observableArray.changeTracking.js:148:49
                     if (index < endDeleteIndex)
                         deletions.push(pushDiff('deleted', rawArray[index], index));
                     if (index < endAddIndex)
-                        additions.push(pushDiff('added', args[argsIndex], index));
+                        additions.push(pushDiff("", args[argsIndex], index));
                 }
                 ko.utils.findMovesInArrayComparison(deletions, additions);

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:153:13
                 ko.utils.findMovesInArrayComparison(deletions, additions);
                 break;
 
-            default:
-                return;
+            default:
         }
         cachedDiff = diff;
