[Survived] MethodExpression
src/subscribables/subscribable.js:139:41
             if (!isDirty || !self._notificationIsPending) {
                 didUpdate = !isDirty;
             }
-            self._changeSubscriptions = self._subscriptions[defaultEvent].slice(0);
+            self._changeSubscriptions = self._subscriptions[defaultEvent];
             self._notificationIsPending = ignoreBeforeChange = true;
             pendingValue = value;

[Survived] BooleanLiteral
src/subscribables/subscribable.js:140:64
                 didUpdate = !isDirty;
             }
             self._changeSubscriptions = self._subscriptions[defaultEvent].slice(0);
-            self._notificationIsPending = ignoreBeforeChange = true;
+            self._notificationIsPending = ignoreBeforeChange = false;
             pendingValue = value;
             finish();

[Survived] BlockStatement
src/subscribables/subscribable.js:144:51
             pendingValue = value;
             finish();
         };
-        self._limitBeforeChange = function(value) {
-            if (!ignoreBeforeChange) {
-                previousValue = value;
-                self._origNotifySubscribers(value, beforeChange);
-            }
-        };
+        self._limitBeforeChange = function(value) {};
         self._recordUpdate = function() {
             didUpdate = true;

[Survived] BooleanLiteral
src/subscribables/subscribable.js:145:17
             finish();
         };
         self._limitBeforeChange = function(value) {
-            if (!ignoreBeforeChange) {
+            if (ignoreBeforeChange) {
                 previousValue = value;
                 self._origNotifySubscribers(value, beforeChange);

[Survived] ConditionalExpression
src/subscribables/subscribable.js:145:17
             finish();
         };
         self._limitBeforeChange = function(value) {
-            if (!ignoreBeforeChange) {
+            if (false) {
                 previousValue = value;
                 self._origNotifySubscribers(value, beforeChange);

[Survived] BlockStatement
src/subscribables/subscribable.js:150:41
                 self._origNotifySubscribers(value, beforeChange);
             }
         };
-        self._recordUpdate = function() {
-            didUpdate = true;
-        };
+        self._recordUpdate = function() {};
         self._notifyNextChangeIfValueIsDifferent = function() {
             if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {

[Survived] BooleanLiteral
src/subscribables/subscribable.js:151:25
             }
         };
         self._recordUpdate = function() {
-            didUpdate = true;
+            didUpdate = false;
         };
         self._notifyNextChangeIfValueIsDifferent = function() {

[Survived] BlockStatement
src/subscribables/subscribable.js:153:63
         self._recordUpdate = function() {
             didUpdate = true;
         };
-        self._notifyNextChangeIfValueIsDifferent = function() {
-            if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {
-                notifyNextChange = true;
-            }
-        };
+        self._notifyNextChangeIfValueIsDifferent = function() {};
     },
 

[Survived] ConditionalExpression
src/subscribables/subscribable.js:154:17
             didUpdate = true;
         };
         self._notifyNextChangeIfValueIsDifferent = function() {
-            if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {
+            if (true) {
                 notifyNextChange = true;
             }

[Survived] BlockStatement
src/subscribables/subscribable.js:154:80
             didUpdate = true;
         };
         self._notifyNextChangeIfValueIsDifferent = function() {
-            if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {
-                notifyNextChange = true;
-            }
+            if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {}
         };
     },

[Survived] BooleanLiteral
src/subscribables/subscribable.js:155:36
         };
         self._notifyNextChangeIfValueIsDifferent = function() {
             if (self.isDifferent(previousValue, self.peek(true /*evaluate*/))) {
-                notifyNextChange = true;
+                notifyNextChange = false;
             }
         };

[Survived] BlockStatement
src/subscribables/subscribable.js:160:47
         };
     },
 
-    hasSubscriptionsForEvent: function(event) {
-        return this._subscriptions[event] && this._subscriptions[event].length;
-    },
+    hasSubscriptionsForEvent: function(event) {},
 
     getSubscriptionsCount: function (event) {

[Survived] ConditionalExpression
src/subscribables/subscribable.js:161:16
     },
 
     hasSubscriptionsForEvent: function(event) {
-        return this._subscriptions[event] && this._subscriptions[event].length;
+        return false;
     },
 

[Survived] ConditionalExpression
src/subscribables/subscribable.js:161:16
     },
 
     hasSubscriptionsForEvent: function(event) {
-        return this._subscriptions[event] && this._subscriptions[event].length;
+        return true;
     },
 

[Survived] BlockStatement
src/subscribables/subscribable.js:164:45
         return this._subscriptions[event] && this._subscriptions[event].length;
     },
 
-    getSubscriptionsCount: function (event) {
-        if (event) {
-            return this._subscriptions[event] && this._subscriptions[event].length || 0;
-        } else {
-            var total = 0;
-            ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
-                if (eventName !== 'dirty')
-                    total += subscriptions.length;
-            });
-            return total;
-        }
-    },
+    getSubscriptionsCount: function (event) {},
 
     isDifferent: function(oldValue, newValue) {

[Survived] ConditionalExpression
src/subscribables/subscribable.js:165:13
     },
 
     getSubscriptionsCount: function (event) {
-        if (event) {
+        if (false) {
             return this._subscriptions[event] && this._subscriptions[event].length || 0;
         } else {

[Survived] ConditionalExpression
src/subscribables/subscribable.js:165:13
     },
 
     getSubscriptionsCount: function (event) {
-        if (event) {
+        if (true) {
             return this._subscriptions[event] && this._subscriptions[event].length || 0;
         } else {

[Survived] LogicalOperator
src/subscribables/subscribable.js:166:20
 
     getSubscriptionsCount: function (event) {
         if (event) {
-            return this._subscriptions[event] && this._subscriptions[event].length || 0;
+            return this._subscriptions[event] || this._subscriptions[event].length || 0;
         } else {
             var total = 0;

[Survived] ConditionalExpression
src/subscribables/subscribable.js:166:20
 
     getSubscriptionsCount: function (event) {
         if (event) {
-            return this._subscriptions[event] && this._subscriptions[event].length || 0;
+            return true;
         } else {
             var total = 0;

[Survived] BlockStatement
src/subscribables/subscribable.js:167:16
     getSubscriptionsCount: function (event) {
         if (event) {
             return this._subscriptions[event] && this._subscriptions[event].length || 0;
-        } else {
-            var total = 0;
-            ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
-                if (eventName !== 'dirty')
-                    total += subscriptions.length;
-            });
-            return total;
-        }
+        } else {}
     },
 

[Survived] BlockStatement
src/subscribables/subscribable.js:169:92
             return this._subscriptions[event] && this._subscriptions[event].length || 0;
         } else {
             var total = 0;
-            ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
-                if (eventName !== 'dirty')
-                    total += subscriptions.length;
-            });
+            ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {});
             return total;
         }

[Survived] EqualityOperator
src/subscribables/subscribable.js:170:21
         } else {
             var total = 0;
             ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
-                if (eventName !== 'dirty')
+                if (eventName === 'dirty')
                     total += subscriptions.length;
             });

[Survived] ConditionalExpression
src/subscribables/subscribable.js:170:21
         } else {
             var total = 0;
             ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
-                if (eventName !== 'dirty')
+                if (false)
                     total += subscriptions.length;
             });

[Survived] AssignmentOperator
src/subscribables/subscribable.js:171:21
             var total = 0;
             ko.utils.objectForEach(this._subscriptions, function(eventName, subscriptions) {
                 if (eventName !== 'dirty')
-                    total += subscriptions.length;
+                    total -= subscriptions.length;
             });
             return total;

[Survived] BlockStatement
src/subscribables/subscribable.js:177:47
         }
     },
 
-    isDifferent: function(oldValue, newValue) {
-        return !this['equalityComparer'] || !this['equalityComparer'](oldValue, newValue);
-    },
+    isDifferent: function(oldValue, newValue) {},
 
     toString: function() {

[Survived] LogicalOperator
src/subscribables/subscribable.js:178:16
     },
 
     isDifferent: function(oldValue, newValue) {
-        return !this['equalityComparer'] || !this['equalityComparer'](oldValue, newValue);
+        return !this['equalityComparer'] && !this['equalityComparer'](oldValue, newValue);
     },
 

[Survived] ConditionalExpression
src/subscribables/subscribable.js:178:16
     },
 
     isDifferent: function(oldValue, newValue) {
-        return !this['equalityComparer'] || !this['equalityComparer'](oldValue, newValue);
+        return true;
     },
 

[Survived] BlockStatement
src/subscribables/subscribable.js:181:26
         return !this['equalityComparer'] || !this['equalityComparer'](oldValue, newValue);
     },
 
-    toString: function() {
-      return '[object Object]'
-    },
+    toString: function() {},
 
     extend: applyExtenders

[Survived] StringLiteral
src/subscribables/subscribable.js:188:39
     extend: applyExtenders
 };
 
-ko.exportProperty(ko_subscribable_fn, 'init', ko_subscribable_fn.init);
+ko.exportProperty(ko_subscribable_fn, "", ko_subscribable_fn.init);
 ko.exportProperty(ko_subscribable_fn, 'subscribe', ko_subscribable_fn.subscribe);
 ko.exportProperty(ko_subscribable_fn, 'extend', ko_subscribable_fn.extend);

[Survived] StringLiteral
src/subscribables/subscribable.js:189:39
 };
 
 ko.exportProperty(ko_subscribable_fn, 'init', ko_subscribable_fn.init);
-ko.exportProperty(ko_subscribable_fn, 'subscribe', ko_subscribable_fn.subscribe);
+ko.exportProperty(ko_subscribable_fn, "", ko_subscribable_fn.subscribe);
 ko.exportProperty(ko_subscribable_fn, 'extend', ko_subscribable_fn.extend);
 ko.exportProperty(ko_subscribable_fn, 'getSubscriptionsCount', ko_subscribable_fn.getSubscriptionsCount);

[Survived] StringLiteral
src/subscribables/subscribable.js:191:39
 ko.exportProperty(ko_subscribable_fn, 'init', ko_subscribable_fn.init);
 ko.exportProperty(ko_subscribable_fn, 'subscribe', ko_subscribable_fn.subscribe);
 ko.exportProperty(ko_subscribable_fn, 'extend', ko_subscribable_fn.extend);
-ko.exportProperty(ko_subscribable_fn, 'getSubscriptionsCount', ko_subscribable_fn.getSubscriptionsCount);
+ko.exportProperty(ko_subscribable_fn, "", ko_subscribable_fn.getSubscriptionsCount);
 
 // For browsers that support proto assignment, we overwrite the prototype of each

[Survived] ConditionalExpression
src/subscribables/subscribable.js:196:5
 // For browsers that support proto assignment, we overwrite the prototype of each
 // observable instance. Since observables are functions, we need Function.prototype
 // to still be in the prototype chain.
-if (ko.utils.canSetPrototype) {
+if (false) {
     ko.utils.setPrototypeOf(ko_subscribable_fn, Function.prototype);
 }

[Survived] ConditionalExpression
src/subscribables/subscribable.js:196:5
 // For browsers that support proto assignment, we overwrite the prototype of each
 // observable instance. Since observables are functions, we need Function.prototype
 // to still be in the prototype chain.
-if (ko.utils.canSetPrototype) {
+if (true) {
     ko.utils.setPrototypeOf(ko_subscribable_fn, Function.prototype);
 }

[Survived] BlockStatement
src/subscribables/subscribable.js:203:41
 ko.subscribable['fn'] = ko_subscribable_fn;
 
 
-ko.isSubscribable = function (instance) {
-    return instance != null && typeof instance.subscribe == "function" && typeof instance["notifySubscribers"] == "function";
-};
+ko.isSubscribable = function (instance) {};
 
 ko.exportSymbol('subscribable', ko.subscribable);

[Survived] ConditionalExpression
src/subscribables/subscribable.js:204:75
 
 
 ko.isSubscribable = function (instance) {
-    return instance != null && typeof instance.subscribe == "function" && typeof instance["notifySubscribers"] == "function";
+    return instance != null && typeof instance.subscribe == "function" && true;
 };
 

[Survived] LogicalOperator
src/subscribables/subscribable.js:204:12
 
 
 ko.isSubscribable = function (instance) {
-    return instance != null && typeof instance.subscribe == "function" && typeof instance["notifySubscribers"] == "function";
+    return instance != null || typeof instance.subscribe == "function" && typeof instance["notifySubscribers"] == "function";
 };
 

[Survived] StringLiteral
src/subscribables/subscribable.js:208:17
 };
 
 ko.exportSymbol('subscribable', ko.subscribable);
-ko.exportSymbol('isSubscribable', ko.isSubscribable);
+ko.exportSymbol("", ko.isSubscribable);
 
