[Survived] ArrayDeclaration
src/tasks.js:3:21
 ko.tasks = (function () {
     var scheduler,
-        taskQueue = [],
+        taskQueue = ["Stryker was here"],
         taskQueueLength = 0,
         nextHandle = 1,

[Survived] ConditionalExpression
src/tasks.js:8:9
         nextHandle = 1,
         nextIndexToProcess = 0;
 
-    if (window['MutationObserver']) {
+    if (false) {
         // Chrome 27+, Firefox 14+, IE 11+, Opera 15+, Safari 6.1+
         // From https://github.com/petkaantonov/bluebird * Copyright (c) 2014 Petka Antonov * License: MIT

[Survived] BlockStatement
src/tasks.js:8:37
         nextHandle = 1,
         nextIndexToProcess = 0;
 
-    if (window['MutationObserver']) {
-        // Chrome 27+, Firefox 14+, IE 11+, Opera 15+, Safari 6.1+
-        // From https://github.com/petkaantonov/bluebird * Copyright (c) 2014 Petka Antonov * License: MIT
-        scheduler = (function (callback) {
-            var div = document.createElement("div");
-            new MutationObserver(callback).observe(div, {attributes: true});
-            return function () { div.classList.toggle("foo"); };
-        })(scheduledProcess);
-    } else if (document && "onreadystatechange" in document.createElement("script")) {
+    if (window['MutationObserver']) {} else if (document && "onreadystatechange" in document.createElement("script")) {
         // IE 6-10
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT

[Survived] BlockStatement
src/tasks.js:11:42
     if (window['MutationObserver']) {
         // Chrome 27+, Firefox 14+, IE 11+, Opera 15+, Safari 6.1+
         // From https://github.com/petkaantonov/bluebird * Copyright (c) 2014 Petka Antonov * License: MIT
-        scheduler = (function (callback) {
-            var div = document.createElement("div");
-            new MutationObserver(callback).observe(div, {attributes: true});
-            return function () { div.classList.toggle("foo"); };
-        })(scheduledProcess);
+        scheduler = (function (callback) {})(scheduledProcess);
     } else if (document && "onreadystatechange" in document.createElement("script")) {
         // IE 6-10

[Survived] BooleanLiteral
src/tasks.js:13:70
         // From https://github.com/petkaantonov/bluebird * Copyright (c) 2014 Petka Antonov * License: MIT
         scheduler = (function (callback) {
             var div = document.createElement("div");
-            new MutationObserver(callback).observe(div, {attributes: true});
+            new MutationObserver(callback).observe(div, {attributes: false});
             return function () { div.classList.toggle("foo"); };
         })(scheduledProcess);

[Survived] BlockStatement
src/tasks.js:14:32
         scheduler = (function (callback) {
             var div = document.createElement("div");
             new MutationObserver(callback).observe(div, {attributes: true});
-            return function () { div.classList.toggle("foo"); };
+            return function () {};
         })(scheduledProcess);
     } else if (document && "onreadystatechange" in document.createElement("script")) {

[Survived] LogicalOperator
src/tasks.js:16:16
             new MutationObserver(callback).observe(div, {attributes: true});
             return function () { div.classList.toggle("foo"); };
         })(scheduledProcess);
-    } else if (document && "onreadystatechange" in document.createElement("script")) {
+    } else if (document || "onreadystatechange" in document.createElement("script")) {
         // IE 6-10
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT

[Survived] ConditionalExpression
src/tasks.js:16:16
             new MutationObserver(callback).observe(div, {attributes: true});
             return function () { div.classList.toggle("foo"); };
         })(scheduledProcess);
-    } else if (document && "onreadystatechange" in document.createElement("script")) {
+    } else if (false) {
         // IE 6-10
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT

[Survived] BlockStatement
src/tasks.js:19:41
     } else if (document && "onreadystatechange" in document.createElement("script")) {
         // IE 6-10
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT
-        scheduler = function (callback) {
-            var script = document.createElement("script");
-            script.onreadystatechange = function () {
-                script.onreadystatechange = null;
-                document.documentElement.removeChild(script);
-                script = null;
-                callback();
-            };
-            document.documentElement.appendChild(script);
-        };
+        scheduler = function (callback) {};
     } else {
         scheduler = function (callback) {

[Survived] StringLiteral
src/tasks.js:20:49
         // IE 6-10
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT
         scheduler = function (callback) {
-            var script = document.createElement("script");
+            var script = document.createElement("");
             script.onreadystatechange = function () {
                 script.onreadystatechange = null;

[Survived] BlockStatement
src/tasks.js:21:53
         // From https://github.com/YuzuJS/setImmediate * Copyright (c) 2012 Barnesandnoble.com, llc, Donavon West, and Domenic Denicola * License: MIT
         scheduler = function (callback) {
             var script = document.createElement("script");
-            script.onreadystatechange = function () {
-                script.onreadystatechange = null;
-                document.documentElement.removeChild(script);
-                script = null;
-                callback();
-            };
+            script.onreadystatechange = function () {};
             document.documentElement.appendChild(script);
         };

[Survived] BlockStatement
src/tasks.js:29:12
             };
             document.documentElement.appendChild(script);
         };
-    } else {
-        scheduler = function (callback) {
-            setTimeout(callback, 0);
-        };
-    }
+    } else {}
 
     function processTasks() {

[Survived] BlockStatement
src/tasks.js:30:41
             document.documentElement.appendChild(script);
         };
     } else {
-        scheduler = function (callback) {
-            setTimeout(callback, 0);
-        };
+        scheduler = function (callback) {};
     }
 

[Survived] BlockStatement
src/tasks.js:36:30
     }
 
     function processTasks() {
-        if (taskQueueLength) {
-            // Each mark represents the end of a logical group of tasks and the number of these groups is
-            // limited to prevent unchecked recursion.
-            var mark = taskQueueLength, countMarks = 0;
-
-            // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
-            for (var task; nextIndexToProcess < taskQueueLength; ) {
-                if (task = taskQueue[nextIndexToProcess++]) {
-                    if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
-                            nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
-                            ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));
-                            break;
-                        }
-                        mark = taskQueueLength;
-                    }
-                    try {
-                        task();
-                    } catch (ex) {
-                        ko.utils.deferError(ex);
-                    }
-                }
-            }
-        }
+        if (taskQueueLength) {}
     }
 

[Survived] ConditionalExpression
src/tasks.js:36:13
     }
 
     function processTasks() {
-        if (taskQueueLength) {
+        if (true) {
             // Each mark represents the end of a logical group of tasks and the number of these groups is
             // limited to prevent unchecked recursion.

[Survived] BlockStatement
src/tasks.js:42:68
             var mark = taskQueueLength, countMarks = 0;
 
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
-            for (var task; nextIndexToProcess < taskQueueLength; ) {
-                if (task = taskQueue[nextIndexToProcess++]) {
-                    if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
-                            nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
-                            ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));
-                            break;
-                        }
-                        mark = taskQueueLength;
-                    }
-                    try {
-                        task();
-                    } catch (ex) {
-                        ko.utils.deferError(ex);
-                    }
-                }
-            }
+            for (var task; nextIndexToProcess < taskQueueLength; ) {}
         }
     }

[Survived] ConditionalExpression
src/tasks.js:42:28
             var mark = taskQueueLength, countMarks = 0;
 
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
-            for (var task; nextIndexToProcess < taskQueueLength; ) {
+            for (var task; false; ) {
                 if (task = taskQueue[nextIndexToProcess++]) {
                     if (nextIndexToProcess > mark) {

[Survived] BlockStatement
src/tasks.js:43:61
 
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
             for (var task; nextIndexToProcess < taskQueueLength; ) {
-                if (task = taskQueue[nextIndexToProcess++]) {
-                    if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
-                            nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
-                            ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));
-                            break;
-                        }
-                        mark = taskQueueLength;
-                    }
-                    try {
-                        task();
-                    } catch (ex) {
-                        ko.utils.deferError(ex);
-                    }
-                }
+                if (task = taskQueue[nextIndexToProcess++]) {}
             }
         }

[Survived] UpdateOperator
src/tasks.js:43:38
 
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
             for (var task; nextIndexToProcess < taskQueueLength; ) {
-                if (task = taskQueue[nextIndexToProcess++]) {
+                if (task = taskQueue[nextIndexToProcess--]) {
                     if (nextIndexToProcess > mark) {
                         if (++countMarks >= 5000) {

[Survived] ConditionalExpression
src/tasks.js:44:25
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
             for (var task; nextIndexToProcess < taskQueueLength; ) {
                 if (task = taskQueue[nextIndexToProcess++]) {
-                    if (nextIndexToProcess > mark) {
+                    if (false) {
                         if (++countMarks >= 5000) {
                             nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion

[Survived] BlockStatement
src/tasks.js:44:52
             // nextIndexToProcess keeps track of where we are in the queue; processTasks can be called recursively without issue
             for (var task; nextIndexToProcess < taskQueueLength; ) {
                 if (task = taskQueue[nextIndexToProcess++]) {
-                    if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
-                            nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
-                            ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));
-                            break;
-                        }
-                        mark = taskQueueLength;
-                    }
+                    if (nextIndexToProcess > mark) {}
                     try {
                         task();

[Survived] UpdateOperator
src/tasks.js:45:29
             for (var task; nextIndexToProcess < taskQueueLength; ) {
                 if (task = taskQueue[nextIndexToProcess++]) {
                     if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
+                        if (--countMarks >= 5000) {
                             nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
                             ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));

[Survived] EqualityOperator
src/tasks.js:45:29
             for (var task; nextIndexToProcess < taskQueueLength; ) {
                 if (task = taskQueue[nextIndexToProcess++]) {
                     if (nextIndexToProcess > mark) {
-                        if (++countMarks >= 5000) {
+                        if (++countMarks < 5000) {
                             nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
                             ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));

[Survived] StringLiteral
src/tasks.js:47:55
                     if (nextIndexToProcess > mark) {
                         if (++countMarks >= 5000) {
                             nextIndexToProcess = taskQueueLength;   // skip all tasks remaining in the queue since any of them could be causing the recursion
-                            ko.utils.deferError(Error("'Too much recursion' after processing " + countMarks + " task groups."));
+                            ko.utils.deferError(Error("" + countMarks + " task groups."));
                             break;
                         }

[Survived] BlockStatement
src/tasks.js:52:25
                         }
                         mark = taskQueueLength;
                     }
-                    try {
-                        task();
-                    } catch (ex) {
+                    try {} catch (ex) {
                         ko.utils.deferError(ex);
                     }

[Survived] BlockStatement
src/tasks.js:54:34
                     }
                     try {
                         task();
-                    } catch (ex) {
-                        ko.utils.deferError(ex);
-                    }
+                    } catch (ex) {}
                 }
             }

[Survived] BlockStatement
src/tasks.js:62:33
         }
     }
 
-    function scheduledProcess() {
-        processTasks();
-
-        // Reset the queue
-        nextIndexToProcess = taskQueueLength = taskQueue.length = 0;
-    }
+    function scheduledProcess() {}
 
     function scheduleTaskProcessing() {

[Survived] BlockStatement
src/tasks.js:69:39
         nextIndexToProcess = taskQueueLength = taskQueue.length = 0;
     }
 
-    function scheduleTaskProcessing() {
-        ko.tasks['scheduler'](scheduledProcess);
-    }
+    function scheduleTaskProcessing() {}
 
     var tasks = {

[Survived] StringLiteral
src/tasks.js:70:18
     }
 
     function scheduleTaskProcessing() {
-        ko.tasks['scheduler'](scheduledProcess);
+        ko.tasks[""](scheduledProcess);
     }
 

[Survived] BlockStatement
src/tasks.js:76:35
     var tasks = {
         'scheduler': scheduler,     // Allow overriding the scheduler
 
-        schedule: function (func) {
-            if (!taskQueueLength) {
-                scheduleTaskProcessing();
-            }
-
-            taskQueue[taskQueueLength++] = func;
-            return nextHandle++;
-        },
+        schedule: function (func) {},
 
         cancel: function (handle) {

[Survived] ConditionalExpression
src/tasks.js:77:17
         'scheduler': scheduler,     // Allow overriding the scheduler
 
         schedule: function (func) {
-            if (!taskQueueLength) {
+            if (false) {
                 scheduleTaskProcessing();
             }

[Survived] BlockStatement
src/tasks.js:77:35
         'scheduler': scheduler,     // Allow overriding the scheduler
 
         schedule: function (func) {
-            if (!taskQueueLength) {
-                scheduleTaskProcessing();
-            }
+            if (!taskQueueLength) {}
 
             taskQueue[taskQueueLength++] = func;

[Survived] UpdateOperator
src/tasks.js:81:23
                 scheduleTaskProcessing();
             }
 
-            taskQueue[taskQueueLength++] = func;
+            taskQueue[taskQueueLength--] = func;
             return nextHandle++;
         },

[Survived] UpdateOperator
src/tasks.js:82:20
             }
 
             taskQueue[taskQueueLength++] = func;
-            return nextHandle++;
+            return nextHandle--;
         },
 

[Survived] BlockStatement
src/tasks.js:85:35
             return nextHandle++;
         },
 
-        cancel: function (handle) {
-            var index = handle - (nextHandle - taskQueueLength);
-            if (index >= nextIndexToProcess && index < taskQueueLength) {
-                taskQueue[index] = null;
-            }
-        },
+        cancel: function (handle) {},
 
         // For testing only: reset the queue and return the previous queue length

[Survived] ArithmeticOperator
src/tasks.js:86:25
         },
 
         cancel: function (handle) {
-            var index = handle - (nextHandle - taskQueueLength);
+            var index = handle + (nextHandle - taskQueueLength);
             if (index >= nextIndexToProcess && index < taskQueueLength) {
                 taskQueue[index] = null;

[Survived] ArithmeticOperator
src/tasks.js:86:35
         },
 
         cancel: function (handle) {
-            var index = handle - (nextHandle - taskQueueLength);
+            var index = handle - (nextHandle + taskQueueLength);
             if (index >= nextIndexToProcess && index < taskQueueLength) {
                 taskQueue[index] = null;

[Survived] ConditionalExpression
src/tasks.js:87:17
 
         cancel: function (handle) {
             var index = handle - (nextHandle - taskQueueLength);
-            if (index >= nextIndexToProcess && index < taskQueueLength) {
+            if (false) {
                 taskQueue[index] = null;
             }

[Survived] LogicalOperator
src/tasks.js:87:17
 
         cancel: function (handle) {
             var index = handle - (nextHandle - taskQueueLength);
-            if (index >= nextIndexToProcess && index < taskQueueLength) {
+            if (index >= nextIndexToProcess || index < taskQueueLength) {
                 taskQueue[index] = null;
             }

[Survived] BlockStatement
src/tasks.js:93:40
         },
 
         // For testing only: reset the queue and return the previous queue length
-        'resetForTesting': function () {
-            var length = taskQueueLength - nextIndexToProcess;
-            nextIndexToProcess = taskQueueLength = taskQueue.length = 0;
-            return length;
-        },
+        'resetForTesting': function () {},
 
         runEarly: processTasks

[Survived] ArithmeticOperator
src/tasks.js:94:26
 
         // For testing only: reset the queue and return the previous queue length
         'resetForTesting': function () {
-            var length = taskQueueLength - nextIndexToProcess;
+            var length = taskQueueLength + nextIndexToProcess;
             nextIndexToProcess = taskQueueLength = taskQueue.length = 0;
             return length;
