[Survived] BlockStatement
src/templating/native/nativeTemplateEngine.js:1:39
-ko.nativeTemplateEngine = function () {
-    this['allowTemplateRewriting'] = false;
-}
+ko.nativeTemplateEngine = function () {}
 
 ko.nativeTemplateEngine.prototype = new ko.templateEngine();

[Survived] BooleanLiteral
src/templating/native/nativeTemplateEngine.js:2:38
 ko.nativeTemplateEngine = function () {
-    this['allowTemplateRewriting'] = false;
+    this['allowTemplateRewriting'] = true;
 }
 

[Survived] BlockStatement
src/templating/native/nativeTemplateEngine.js:7:130
 
 ko.nativeTemplateEngine.prototype = new ko.templateEngine();
 ko.nativeTemplateEngine.prototype.constructor = ko.nativeTemplateEngine;
-ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
-    var useNodesIfAvailable = !(ko.utils.ieVersion < 9), // IE<9 cloneNode doesn't work properly
-        templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
-        templateNodes = templateNodesFunc ? templateSource['nodes']() : null;
-
-    if (templateNodes) {
-        return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
-    } else {
-        var templateText = templateSource['text']();
-        return ko.utils.parseHtmlFragment(templateText, templateDocument);
-    }
-};
+ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {};
 
 ko.nativeTemplateEngine.instance = new ko.nativeTemplateEngine();

[Survived] StringLiteral
src/templating/native/nativeTemplateEngine.js:7:35
 
 ko.nativeTemplateEngine.prototype = new ko.templateEngine();
 ko.nativeTemplateEngine.prototype.constructor = ko.nativeTemplateEngine;
-ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
+ko.nativeTemplateEngine.prototype[""] = function (templateSource, bindingContext, options, templateDocument) {
     var useNodesIfAvailable = !(ko.utils.ieVersion < 9), // IE<9 cloneNode doesn't work properly
         templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,

[Survived] EqualityOperator
src/templating/native/nativeTemplateEngine.js:8:33
 ko.nativeTemplateEngine.prototype = new ko.templateEngine();
 ko.nativeTemplateEngine.prototype.constructor = ko.nativeTemplateEngine;
 ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
-    var useNodesIfAvailable = !(ko.utils.ieVersion < 9), // IE<9 cloneNode doesn't work properly
+    var useNodesIfAvailable = !(ko.utils.ieVersion <= 9), // IE<9 cloneNode doesn't work properly
         templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;

[Survived] ConditionalExpression
src/templating/native/nativeTemplateEngine.js:8:33
 ko.nativeTemplateEngine.prototype = new ko.templateEngine();
 ko.nativeTemplateEngine.prototype.constructor = ko.nativeTemplateEngine;
 ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
-    var useNodesIfAvailable = !(ko.utils.ieVersion < 9), // IE<9 cloneNode doesn't work properly
+    var useNodesIfAvailable = !(false), // IE<9 cloneNode doesn't work properly
         templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;

[Survived] StringLiteral
src/templating/native/nativeTemplateEngine.js:9:66
 ko.nativeTemplateEngine.prototype.constructor = ko.nativeTemplateEngine;
 ko.nativeTemplateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
     var useNodesIfAvailable = !(ko.utils.ieVersion < 9), // IE<9 cloneNode doesn't work properly
-        templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
+        templateNodesFunc = useNodesIfAvailable ? templateSource[""] : null,
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;
 

[Survived] BlockStatement
src/templating/native/nativeTemplateEngine.js:12:24
         templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;
 
-    if (templateNodes) {
-        return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
-    } else {
+    if (templateNodes) {} else {
         var templateText = templateSource['text']();
         return ko.utils.parseHtmlFragment(templateText, templateDocument);

[Survived] ConditionalExpression
src/templating/native/nativeTemplateEngine.js:12:9
         templateNodesFunc = useNodesIfAvailable ? templateSource['nodes'] : null,
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;
 
-    if (templateNodes) {
+    if (false) {
         return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
     } else {

[Survived] BooleanLiteral
src/templating/native/nativeTemplateEngine.js:13:59
         templateNodes = templateNodesFunc ? templateSource['nodes']() : null;
 
     if (templateNodes) {
-        return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
+        return ko.utils.makeArray(templateNodes.cloneNode(false).childNodes);
     } else {
         var templateText = templateSource['text']();

[Survived] BlockStatement
src/templating/native/nativeTemplateEngine.js:14:12
 
     if (templateNodes) {
         return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
-    } else {
-        var templateText = templateSource['text']();
-        return ko.utils.parseHtmlFragment(templateText, templateDocument);
-    }
+    } else {}
 };
 

[Survived] StringLiteral
src/templating/native/nativeTemplateEngine.js:15:43
     if (templateNodes) {
         return ko.utils.makeArray(templateNodes.cloneNode(true).childNodes);
     } else {
-        var templateText = templateSource['text']();
+        var templateText = templateSource[""]();
         return ko.utils.parseHtmlFragment(templateText, templateDocument);
     }
