[Survived] BlockStatement
src/templating/templateEngine.js:30:124
 
 ko.templateEngine = function () { };
 
-ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
-    throw new Error("Override renderTemplateSource");
-};
+ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {};
 
 ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {

[Survived] StringLiteral
src/templating/templateEngine.js:30:29
 
 ko.templateEngine = function () { };
 
-ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options, templateDocument) {
+ko.templateEngine.prototype[""] = function (templateSource, bindingContext, options, templateDocument) {
     throw new Error("Override renderTemplateSource");
 };

[Survived] BlockStatement
src/templating/templateEngine.js:34:83
     throw new Error("Override renderTemplateSource");
 };
 
-ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {
-    throw new Error("Override createJavaScriptEvaluatorBlock");
-};
+ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {};
 
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {

[Survived] StringLiteral
src/templating/templateEngine.js:34:29
     throw new Error("Override renderTemplateSource");
 };
 
-ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {
+ko.templateEngine.prototype[""] = function (script) {
     throw new Error("Override createJavaScriptEvaluatorBlock");
 };

[Survived] BlockStatement
src/templating/templateEngine.js:38:90
     throw new Error("Override createJavaScriptEvaluatorBlock");
 };
 
-ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
-    // Named template
-    if (typeof template == "string") {
-        templateDocument = templateDocument || document;
-        var elem = templateDocument.getElementById(template);
-        if (!elem)
-            throw new Error("Cannot find template with ID " + template);
-        return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
-        // Anonymous template
-        return new ko.templateSources.anonymousTemplate(template);
-    } else
-        throw new Error("Unknown template type: " + template);
-};
+ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {};
 
 ko.templateEngine.prototype['renderTemplate'] = function (template, bindingContext, options, templateDocument) {

[Survived] BlockStatement
src/templating/templateEngine.js:40:38
 
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
-    if (typeof template == "string") {
-        templateDocument = templateDocument || document;
-        var elem = templateDocument.getElementById(template);
-        if (!elem)
-            throw new Error("Cannot find template with ID " + template);
-        return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
+    if (typeof template == "string") {} else if ((template.nodeType == 1) || (template.nodeType == 8)) {
         // Anonymous template
         return new ko.templateSources.anonymousTemplate(template);

[Survived] ConditionalExpression
src/templating/templateEngine.js:40:9
 
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
-    if (typeof template == "string") {
+    if (true) {
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);

[Survived] LogicalOperator
src/templating/templateEngine.js:41:28
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
     if (typeof template == "string") {
-        templateDocument = templateDocument || document;
+        templateDocument = templateDocument && document;
         var elem = templateDocument.getElementById(template);
         if (!elem)

[Survived] ConditionalExpression
src/templating/templateEngine.js:41:28
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
     if (typeof template == "string") {
-        templateDocument = templateDocument || document;
+        templateDocument = true;
         var elem = templateDocument.getElementById(template);
         if (!elem)

[Survived] BooleanLiteral
src/templating/templateEngine.js:43:13
     if (typeof template == "string") {
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);
-        if (!elem)
+        if (elem)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);

[Survived] ConditionalExpression
src/templating/templateEngine.js:43:13
     if (typeof template == "string") {
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);
-        if (!elem)
+        if (false)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);

[Survived] EqualityOperator
src/templating/templateEngine.js:46:45
         if (!elem)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
+    } else if ((template.nodeType == 1) || (template.nodeType != 8)) {
         // Anonymous template
         return new ko.templateSources.anonymousTemplate(template);

[Survived] LogicalOperator
src/templating/templateEngine.js:46:16
         if (!elem)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
+    } else if (template.nodeType == 1 && template.nodeType == 8) {
         // Anonymous template
         return new ko.templateSources.anonymousTemplate(template);

[Survived] BlockStatement
src/templating/templateEngine.js:53:112
         throw new Error("Unknown template type: " + template);
 };
 
-ko.templateEngine.prototype['renderTemplate'] = function (template, bindingContext, options, templateDocument) {
-    var templateSource = this['makeTemplateSource'](template, templateDocument);
-    return this['renderTemplateSource'](templateSource, bindingContext, options, templateDocument);
-};
+ko.templateEngine.prototype['renderTemplate'] = function (template, bindingContext, options, templateDocument) {};
 
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {

[Survived] BlockStatement
src/templating/templateEngine.js:58:92
     return this['renderTemplateSource'](templateSource, bindingContext, options, templateDocument);
 };
 
-ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
-    // Skip rewriting if requested
-    if (this['allowTemplateRewriting'] === false)
-        return true;
-    return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
-};
+ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {};
 
 ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {

[Survived] ConditionalExpression
src/templating/templateEngine.js:60:9
 
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
     // Skip rewriting if requested
-    if (this['allowTemplateRewriting'] === false)
+    if (true)
         return true;
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");

[Survived] EqualityOperator
src/templating/templateEngine.js:60:9
 
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
     // Skip rewriting if requested
-    if (this['allowTemplateRewriting'] === false)
+    if (this['allowTemplateRewriting'] !== false)
         return true;
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");

[Survived] BooleanLiteral
src/templating/templateEngine.js:61:16
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
     // Skip rewriting if requested
     if (this['allowTemplateRewriting'] === false)
-        return true;
+        return false;
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
 };

[Survived] StringLiteral
src/templating/templateEngine.js:62:17
     // Skip rewriting if requested
     if (this['allowTemplateRewriting'] === false)
         return true;
-    return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
+    return this[""](template, templateDocument)['data']("isRewritten");
 };
 

[Survived] StringLiteral
src/templating/templateEngine.js:62:67
     // Skip rewriting if requested
     if (this['allowTemplateRewriting'] === false)
         return true;
-    return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
+    return this['makeTemplateSource'](template, templateDocument)[""]("isRewritten");
 };
 

[Survived] BlockStatement
src/templating/templateEngine.js:65:106
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
 };
 
-ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {
-    var templateSource = this['makeTemplateSource'](template, templateDocument);
-    var rewritten = rewriterCallback(templateSource['text']());
-    templateSource['text'](rewritten);
-    templateSource['data']("isRewritten", true);
-};
+ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {};
 
 ko.exportSymbol('templateEngine', ko.templateEngine);

[Survived] StringLiteral
src/templating/templateEngine.js:68:20
 ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {
     var templateSource = this['makeTemplateSource'](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());
-    templateSource['text'](rewritten);
+    templateSource[""](rewritten);
     templateSource['data']("isRewritten", true);
 };

[Survived] BooleanLiteral
src/templating/templateEngine.js:69:43
     var templateSource = this['makeTemplateSource'](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());
     templateSource['text'](rewritten);
-    templateSource['data']("isRewritten", true);
+    templateSource['data']("isRewritten", false);
 };
 

[Survived] StringLiteral
src/templating/templateEngine.js:69:28
     var templateSource = this['makeTemplateSource'](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());
     templateSource['text'](rewritten);
-    templateSource['data']("isRewritten", true);
+    templateSource['data']("", true);
 };
 

[Survived] StringLiteral
src/templating/templateEngine.js:72:17
     templateSource['data']("isRewritten", true);
 };
 
-ko.exportSymbol('templateEngine', ko.templateEngine);
+ko.exportSymbol("", ko.templateEngine);
 
