[Survived] Regex
src/templating/templateRewriting.js:3:50
 
 ko.templateRewriting = (function () {
-    var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
+    var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[^a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
     var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([\s\S]*?)\s*-->/g;
 

[Survived] Regex
src/templating/templateRewriting.js:3:50
 
 ko.templateRewriting = (function () {
-    var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
+    var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
     var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([\s\S]*?)\s*-->/g;
 

[Survived] Regex
src/templating/templateRewriting.js:4:53
 
 ko.templateRewriting = (function () {
     var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
-    var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([\s\S]*?)\s*-->/g;
+    var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s([\s\S]*?)\s*-->/g;
 
     function validateDataBindValuesForRewriting(keyValueArray) {

[Survived] Regex
src/templating/templateRewriting.js:4:53
 
 ko.templateRewriting = (function () {
     var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
-    var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([\s\S]*?)\s*-->/g;
+    var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([^\s\S]*?)\s*-->/g;
 
     function validateDataBindValuesForRewriting(keyValueArray) {

[Survived] BlockStatement
src/templating/templateRewriting.js:6:64
     var memoizeDataBindingAttributeSyntaxRegex = /(<([a-z]+\d*)(?:\s+(?!data-bind\s*=\s*)[a-z0-9\-]+(?:=(?:\"[^\"]*\"|\'[^\']*\'|[^>]*))?)*\s+)data-bind\s*=\s*(["'])([\s\S]*?)\3/gi;
     var memoizeVirtualContainerBindingSyntaxRegex = /<!--\s*ko\b\s*([\s\S]*?)\s*-->/g;
 
-    function validateDataBindValuesForRewriting(keyValueArray) {
-        var allValidators = ko.expressionRewriting.bindingRewriteValidators;
-        for (var i = 0; i < keyValueArray.length; i++) {
-            var key = keyValueArray[i]['key'];
-            if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
-                var validator = allValidators[key];
-
-                if (typeof validator === "function") {
-                    var possibleErrorMessage = validator(keyValueArray[i]['value']);
-                    if (possibleErrorMessage)
-                        throw new Error(possibleErrorMessage);
-                } else if (!validator) {
-                    throw new Error("This template engine does not support the '" + key + "' binding within its templates");
-                }
-            }
-        }
-    }
+    function validateDataBindValuesForRewriting(keyValueArray) {}
 
     function constructMemoizedTagReplacement(dataBindAttributeValue, tagToRetain, nodeName, templateEngine) {

[Survived] EqualityOperator
src/templating/templateRewriting.js:8:25
 
     function validateDataBindValuesForRewriting(keyValueArray) {
         var allValidators = ko.expressionRewriting.bindingRewriteValidators;
-        for (var i = 0; i < keyValueArray.length; i++) {
+        for (var i = 0; i >= keyValueArray.length; i++) {
             var key = keyValueArray[i]['key'];
             if (Object.prototype.hasOwnProperty.call(allValidators, key)) {

[Survived] EqualityOperator
src/templating/templateRewriting.js:8:25
 
     function validateDataBindValuesForRewriting(keyValueArray) {
         var allValidators = ko.expressionRewriting.bindingRewriteValidators;
-        for (var i = 0; i < keyValueArray.length; i++) {
+        for (var i = 0; i <= keyValueArray.length; i++) {
             var key = keyValueArray[i]['key'];
             if (Object.prototype.hasOwnProperty.call(allValidators, key)) {

[Survived] StringLiteral
src/templating/templateRewriting.js:9:40
     function validateDataBindValuesForRewriting(keyValueArray) {
         var allValidators = ko.expressionRewriting.bindingRewriteValidators;
         for (var i = 0; i < keyValueArray.length; i++) {
-            var key = keyValueArray[i]['key'];
+            var key = keyValueArray[i][""];
             if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
                 var validator = allValidators[key];

[Survived] ConditionalExpression
src/templating/templateRewriting.js:10:17
         var allValidators = ko.expressionRewriting.bindingRewriteValidators;
         for (var i = 0; i < keyValueArray.length; i++) {
             var key = keyValueArray[i]['key'];
-            if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
+            if (true) {
                 var validator = allValidators[key];
 

[Survived] BlockStatement
src/templating/templateRewriting.js:10:75
         var allValidators = ko.expressionRewriting.bindingRewriteValidators;
         for (var i = 0; i < keyValueArray.length; i++) {
             var key = keyValueArray[i]['key'];
-            if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
-                var validator = allValidators[key];
-
-                if (typeof validator === "function") {
-                    var possibleErrorMessage = validator(keyValueArray[i]['value']);
-                    if (possibleErrorMessage)
-                        throw new Error(possibleErrorMessage);
-                } else if (!validator) {
-                    throw new Error("This template engine does not support the '" + key + "' binding within its templates");
-                }
-            }
+            if (Object.prototype.hasOwnProperty.call(allValidators, key)) {}
         }
     }

[Survived] BlockStatement
src/templating/templateRewriting.js:13:54
             if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
                 var validator = allValidators[key];
 
-                if (typeof validator === "function") {
-                    var possibleErrorMessage = validator(keyValueArray[i]['value']);
-                    if (possibleErrorMessage)
-                        throw new Error(possibleErrorMessage);
-                } else if (!validator) {
+                if (typeof validator === "function") {} else if (!validator) {
                     throw new Error("This template engine does not support the '" + key + "' binding within its templates");
                 }

[Survived] EqualityOperator
src/templating/templateRewriting.js:13:21
             if (Object.prototype.hasOwnProperty.call(allValidators, key)) {
                 var validator = allValidators[key];
 
-                if (typeof validator === "function") {
+                if (typeof validator !== "function") {
                     var possibleErrorMessage = validator(keyValueArray[i]['value']);
                     if (possibleErrorMessage)

[Survived] ConditionalExpression
src/templating/templateRewriting.js:15:25
 
                 if (typeof validator === "function") {
                     var possibleErrorMessage = validator(keyValueArray[i]['value']);
-                    if (possibleErrorMessage)
+                    if (false)
                         throw new Error(possibleErrorMessage);
                 } else if (!validator) {

[Survived] ConditionalExpression
src/templating/templateRewriting.js:15:25
 
                 if (typeof validator === "function") {
                     var possibleErrorMessage = validator(keyValueArray[i]['value']);
-                    if (possibleErrorMessage)
+                    if (true)
                         throw new Error(possibleErrorMessage);
                 } else if (!validator) {

[Survived] ConditionalExpression
src/templating/templateRewriting.js:17:28
                     var possibleErrorMessage = validator(keyValueArray[i]['value']);
                     if (possibleErrorMessage)
                         throw new Error(possibleErrorMessage);
-                } else if (!validator) {
+                } else if (true) {
                     throw new Error("This template engine does not support the '" + key + "' binding within its templates");
                 }

[Survived] BlockStatement
src/templating/templateRewriting.js:17:40
                     var possibleErrorMessage = validator(keyValueArray[i]['value']);
                     if (possibleErrorMessage)
                         throw new Error(possibleErrorMessage);
-                } else if (!validator) {
-                    throw new Error("This template engine does not support the '" + key + "' binding within its templates");
-                }
+                } else if (!validator) {}
             }
         }

[Survived] BlockStatement
src/templating/templateRewriting.js:24:109
         }
     }
 
-    function constructMemoizedTagReplacement(dataBindAttributeValue, tagToRetain, nodeName, templateEngine) {
-        var dataBindKeyValueArray = ko.expressionRewriting.parseObjectLiteral(dataBindAttributeValue);
-        validateDataBindValuesForRewriting(dataBindKeyValueArray);
-        var rewrittenDataBindAttributeValue = ko.expressionRewriting.preProcessBindings(dataBindKeyValueArray, {'valueAccessors':true});
-
-        // For no obvious reason, Opera fails to evaluate rewrittenDataBindAttributeValue unless it's wrapped in an additional
-        // anonymous function, even though Opera's built-in debugger can evaluate it anyway. No other browser requires this
-        // extra indirection.
-        var applyBindingsToNextSiblingScript =
-            "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toLowerCase() + "')";
-        return templateEngine['createJavaScriptEvaluatorBlock'](applyBindingsToNextSiblingScript) + tagToRetain;
-    }
+    function constructMemoizedTagReplacement(dataBindAttributeValue, tagToRetain, nodeName, templateEngine) {}
 
     return {

[Survived] BooleanLiteral
src/templating/templateRewriting.js:27:130
     function constructMemoizedTagReplacement(dataBindAttributeValue, tagToRetain, nodeName, templateEngine) {
         var dataBindKeyValueArray = ko.expressionRewriting.parseObjectLiteral(dataBindAttributeValue);
         validateDataBindValuesForRewriting(dataBindKeyValueArray);
-        var rewrittenDataBindAttributeValue = ko.expressionRewriting.preProcessBindings(dataBindKeyValueArray, {'valueAccessors':true});
+        var rewrittenDataBindAttributeValue = ko.expressionRewriting.preProcessBindings(dataBindKeyValueArray, {'valueAccessors':false});
 
         // For no obvious reason, Opera fails to evaluate rewrittenDataBindAttributeValue unless it's wrapped in an additional

[Survived] MethodExpression
src/templating/templateRewriting.js:33:136
         // anonymous function, even though Opera's built-in debugger can evaluate it anyway. No other browser requires this
         // extra indirection.
         var applyBindingsToNextSiblingScript =
-            "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toLowerCase() + "')";
+            "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toUpperCase() + "')";
         return templateEngine['createJavaScriptEvaluatorBlock'](applyBindingsToNextSiblingScript) + tagToRetain;
     }

[Survived] StringLiteral
src/templating/templateRewriting.js:33:161
         // anonymous function, even though Opera's built-in debugger can evaluate it anyway. No other browser requires this
         // extra indirection.
         var applyBindingsToNextSiblingScript =
-            "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toLowerCase() + "')";
+            "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toLowerCase() + "";
         return templateEngine['createJavaScriptEvaluatorBlock'](applyBindingsToNextSiblingScript) + tagToRetain;
     }

[Survived] ArithmeticOperator
src/templating/templateRewriting.js:34:16
         // extra indirection.
         var applyBindingsToNextSiblingScript =
             "ko.__tr_ambtns(function($context,$element){return(function(){return{ " + rewrittenDataBindAttributeValue + " } })()},'" + nodeName.toLowerCase() + "')";
-        return templateEngine['createJavaScriptEvaluatorBlock'](applyBindingsToNextSiblingScript) + tagToRetain;
+        return templateEngine['createJavaScriptEvaluatorBlock'](applyBindingsToNextSiblingScript) - tagToRetain;
     }
 

[Survived] BlockStatement
src/templating/templateRewriting.js:38:90
     }
 
     return {
-        ensureTemplateIsRewritten: function (template, templateEngine, templateDocument) {
-            if (!templateEngine['isTemplateRewritten'](template, templateDocument))
-                templateEngine['rewriteTemplate'](template, function (htmlString) {
-                    return ko.templateRewriting.memoizeBindingAttributeSyntax(htmlString, templateEngine);
-                }, templateDocument);
-        },
+        ensureTemplateIsRewritten: function (template, templateEngine, templateDocument) {},
 
         memoizeBindingAttributeSyntax: function (htmlString, templateEngine) {

[Survived] ConditionalExpression
src/templating/templateRewriting.js:39:17
 
     return {
         ensureTemplateIsRewritten: function (template, templateEngine, templateDocument) {
-            if (!templateEngine['isTemplateRewritten'](template, templateDocument))
+            if (true)
                 templateEngine['rewriteTemplate'](template, function (htmlString) {
                     return ko.templateRewriting.memoizeBindingAttributeSyntax(htmlString, templateEngine);

[Survived] ConditionalExpression
src/templating/templateRewriting.js:39:17
 
     return {
         ensureTemplateIsRewritten: function (template, templateEngine, templateDocument) {
-            if (!templateEngine['isTemplateRewritten'](template, templateDocument))
+            if (false)
                 templateEngine['rewriteTemplate'](template, function (htmlString) {
                     return ko.templateRewriting.memoizeBindingAttributeSyntax(htmlString, templateEngine);

[Survived] BlockStatement
src/templating/templateRewriting.js:40:83
     return {
         ensureTemplateIsRewritten: function (template, templateEngine, templateDocument) {
             if (!templateEngine['isTemplateRewritten'](template, templateDocument))
-                templateEngine['rewriteTemplate'](template, function (htmlString) {
-                    return ko.templateRewriting.memoizeBindingAttributeSyntax(htmlString, templateEngine);
-                }, templateDocument);
+                templateEngine['rewriteTemplate'](template, function (htmlString) {}, templateDocument);
         },
 

[Survived] BlockStatement
src/templating/templateRewriting.js:45:78
                 }, templateDocument);
         },
 
-        memoizeBindingAttributeSyntax: function (htmlString, templateEngine) {
-            return htmlString.replace(memoizeDataBindingAttributeSyntaxRegex, function () {
-                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[4], /* tagToRetain: */ arguments[1], /* nodeName: */ arguments[2], templateEngine);
-            }).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {
-                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[1], /* tagToRetain: */ "<!-- ko -->", /* nodeName: */ "#comment", templateEngine);
-            });
-        },
+        memoizeBindingAttributeSyntax: function (htmlString, templateEngine) {},
 
         applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {

[Survived] BlockStatement
src/templating/templateRewriting.js:46:91
         },
 
         memoizeBindingAttributeSyntax: function (htmlString, templateEngine) {
-            return htmlString.replace(memoizeDataBindingAttributeSyntaxRegex, function () {
-                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[4], /* tagToRetain: */ arguments[1], /* nodeName: */ arguments[2], templateEngine);
-            }).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {
+            return htmlString.replace(memoizeDataBindingAttributeSyntaxRegex, function () {}).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {
                 return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[1], /* tagToRetain: */ "<!-- ko -->", /* nodeName: */ "#comment", templateEngine);
             });

[Survived] BlockStatement
src/templating/templateRewriting.js:48:78
         memoizeBindingAttributeSyntax: function (htmlString, templateEngine) {
             return htmlString.replace(memoizeDataBindingAttributeSyntaxRegex, function () {
                 return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[4], /* tagToRetain: */ arguments[1], /* nodeName: */ arguments[2], templateEngine);
-            }).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {
-                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[1], /* tagToRetain: */ "<!-- ko -->", /* nodeName: */ "#comment", templateEngine);
-            });
+            }).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {});
         },
 

[Survived] StringLiteral
src/templating/templateRewriting.js:49:119
             return htmlString.replace(memoizeDataBindingAttributeSyntaxRegex, function () {
                 return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[4], /* tagToRetain: */ arguments[1], /* nodeName: */ arguments[2], templateEngine);
             }).replace(memoizeVirtualContainerBindingSyntaxRegex, function() {
-                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[1], /* tagToRetain: */ "<!-- ko -->", /* nodeName: */ "#comment", templateEngine);
+                return constructMemoizedTagReplacement(/* dataBindAttributeValue: */ arguments[1], /* tagToRetain: */ "", /* nodeName: */ "#comment", templateEngine);
             });
         },

[Survived] BlockStatement
src/templating/templateRewriting.js:53:75
             });
         },
 
-        applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {
-            return ko.memoization.memoize(function (domNode, bindingContext) {
-                var nodeToBind = domNode.nextSibling;
-                if (nodeToBind && nodeToBind.nodeName.toLowerCase() === nodeName) {
-                    ko.applyBindingAccessorsToNode(nodeToBind, bindings, bindingContext);
-                }
-            });
-        }
+        applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {}
     }
 })();

[Survived] BlockStatement
src/templating/templateRewriting.js:54:78
         },
 
         applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {
-            return ko.memoization.memoize(function (domNode, bindingContext) {
-                var nodeToBind = domNode.nextSibling;
-                if (nodeToBind && nodeToBind.nodeName.toLowerCase() === nodeName) {
-                    ko.applyBindingAccessorsToNode(nodeToBind, bindings, bindingContext);
-                }
-            });
+            return ko.memoization.memoize(function (domNode, bindingContext) {});
         }
     }

[Survived] ConditionalExpression
src/templating/templateRewriting.js:56:35
         applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {
             return ko.memoization.memoize(function (domNode, bindingContext) {
                 var nodeToBind = domNode.nextSibling;
-                if (nodeToBind && nodeToBind.nodeName.toLowerCase() === nodeName) {
+                if (nodeToBind && true) {
                     ko.applyBindingAccessorsToNode(nodeToBind, bindings, bindingContext);
                 }

[Survived] ConditionalExpression
src/templating/templateRewriting.js:56:21
         applyMemoizedBindingsToNextSibling: function (bindings, nodeName) {
             return ko.memoization.memoize(function (domNode, bindingContext) {
                 var nodeToBind = domNode.nextSibling;
-                if (nodeToBind && nodeToBind.nodeName.toLowerCase() === nodeName) {
+                if (false) {
                     ko.applyBindingAccessorsToNode(nodeToBind, bindings, bindingContext);
                 }
