[Survived] BlockStatement
src/templating/templateSources.js:36:55
         templateTemplate = 3,
         templateElement = 4;
 
-    ko.templateSources.domElement = function(element) {
-        this.domElement = element;
-
-        if (element) {
-            var tagNameLower = ko.utils.tagNameLower(element);
-            this.templateType =
-                tagNameLower === "script" ? templateScript :
-                tagNameLower === "textarea" ? templateTextArea :
-                    // For browsers with proper <template> element support, where the .content property gives a document fragment
-                tagNameLower == "template" && element.content && element.content.nodeType === 11 ? templateTemplate :
-                templateElement;
-        }
-    }
+    ko.templateSources.domElement = function(element) {}
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {

[Survived] ConditionalExpression
src/templating/templateSources.js:39:13
     ko.templateSources.domElement = function(element) {
         this.domElement = element;
 
-        if (element) {
+        if (true) {
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =

[Survived] ConditionalExpression
src/templating/templateSources.js:39:13
     ko.templateSources.domElement = function(element) {
         this.domElement = element;
 
-        if (element) {
+        if (false) {
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =

[Survived] ConditionalExpression
src/templating/templateSources.js:42:17
         if (element) {
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =
-                tagNameLower === "script" ? templateScript :
+                true ? templateScript :
                 tagNameLower === "textarea" ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment

[Survived] ConditionalExpression
src/templating/templateSources.js:42:17
         if (element) {
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =
-                tagNameLower === "script" ? templateScript :
+                false ? templateScript :
                 tagNameLower === "textarea" ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment

[Survived] ConditionalExpression
src/templating/templateSources.js:43:17
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =
                 tagNameLower === "script" ? templateScript :
-                tagNameLower === "textarea" ? templateTextArea :
+                true ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment
                 tagNameLower == "template" && element.content && element.content.nodeType === 11 ? templateTemplate :

[Survived] ConditionalExpression
src/templating/templateSources.js:43:17
             var tagNameLower = ko.utils.tagNameLower(element);
             this.templateType =
                 tagNameLower === "script" ? templateScript :
-                tagNameLower === "textarea" ? templateTextArea :
+                false ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment
                 tagNameLower == "template" && element.content && element.content.nodeType === 11 ? templateTemplate :

[Survived] ConditionalExpression
src/templating/templateSources.js:45:17
                 tagNameLower === "script" ? templateScript :
                 tagNameLower === "textarea" ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment
-                tagNameLower == "template" && element.content && element.content.nodeType === 11 ? templateTemplate :
+                false ? templateTemplate :
                 templateElement;
         }

[Survived] LogicalOperator
src/templating/templateSources.js:45:17
                 tagNameLower === "script" ? templateScript :
                 tagNameLower === "textarea" ? templateTextArea :
                     // For browsers with proper <template> element support, where the .content property gives a document fragment
-                tagNameLower == "template" && element.content && element.content.nodeType === 11 ? templateTemplate :
+                tagNameLower == "template" || element.content && element.content.nodeType === 11 ? templateTemplate :
                 templateElement;
         }

[Survived] BlockStatement
src/templating/templateSources.js:50:84
         }
     }
 
-    ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
-        var elemContentsProperty = this.templateType === templateScript ? "text"
-                                 : this.templateType === templateTextArea ? "value"
-                                 : "innerHTML";
-
-        if (arguments.length == 0) {
-            return this.domElement[elemContentsProperty];
-        } else {
-            var valueToWrite = arguments[0];
-            if (elemContentsProperty === "innerHTML")
-                ko.utils.setHtml(this.domElement, valueToWrite);
-            else
-                this.domElement[elemContentsProperty] = valueToWrite;
-        }
-    };
+    ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {};
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";

[Survived] ConditionalExpression
src/templating/templateSources.js:51:36
     }
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
-        var elemContentsProperty = this.templateType === templateScript ? "text"
+        var elemContentsProperty = true ? "text"
                                  : this.templateType === templateTextArea ? "value"
                                  : "innerHTML";

[Survived] ConditionalExpression
src/templating/templateSources.js:51:36
     }
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
-        var elemContentsProperty = this.templateType === templateScript ? "text"
+        var elemContentsProperty = false ? "text"
                                  : this.templateType === templateTextArea ? "value"
                                  : "innerHTML";

[Survived] EqualityOperator
src/templating/templateSources.js:52:36
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var elemContentsProperty = this.templateType === templateScript ? "text"
-                                 : this.templateType === templateTextArea ? "value"
+                                 : this.templateType !== templateTextArea ? "value"
                                  : "innerHTML";
 

[Survived] ConditionalExpression
src/templating/templateSources.js:52:36
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var elemContentsProperty = this.templateType === templateScript ? "text"
-                                 : this.templateType === templateTextArea ? "value"
+                                 : true ? "value"
                                  : "innerHTML";
 

[Survived] ConditionalExpression
src/templating/templateSources.js:55:13
                                  : this.templateType === templateTextArea ? "value"
                                  : "innerHTML";
 
-        if (arguments.length == 0) {
+        if (true) {
             return this.domElement[elemContentsProperty];
         } else {

[Survived] BlockStatement
src/templating/templateSources.js:55:36
                                  : this.templateType === templateTextArea ? "value"
                                  : "innerHTML";
 
-        if (arguments.length == 0) {
-            return this.domElement[elemContentsProperty];
-        } else {
+        if (arguments.length == 0) {} else {
             var valueToWrite = arguments[0];
             if (elemContentsProperty === "innerHTML")

[Survived] BlockStatement
src/templating/templateSources.js:57:16
 
         if (arguments.length == 0) {
             return this.domElement[elemContentsProperty];
-        } else {
-            var valueToWrite = arguments[0];
-            if (elemContentsProperty === "innerHTML")
-                ko.utils.setHtml(this.domElement, valueToWrite);
-            else
-                this.domElement[elemContentsProperty] = valueToWrite;
-        }
+        } else {}
     };
 

[Survived] ConditionalExpression
src/templating/templateSources.js:59:17
             return this.domElement[elemContentsProperty];
         } else {
             var valueToWrite = arguments[0];
-            if (elemContentsProperty === "innerHTML")
+            if (true)
                 ko.utils.setHtml(this.domElement, valueToWrite);
             else

[Survived] EqualityOperator
src/templating/templateSources.js:59:17
             return this.domElement[elemContentsProperty];
         } else {
             var valueToWrite = arguments[0];
-            if (elemContentsProperty === "innerHTML")
+            if (elemContentsProperty !== "innerHTML")
                 ko.utils.setHtml(this.domElement, valueToWrite);
             else

[Survived] BlockStatement
src/templating/templateSources.js:67:89
     };
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";
-    ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
-        if (arguments.length === 1) {
-            return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
-        } else {
-            ko.utils.domData.set(this.domElement, dataDomDataPrefix + key, arguments[1]);
-        }
-    };
+    ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {};
 
     var templatesDomDataKey = ko.utils.domData.nextKey();

[Survived] ConditionalExpression
src/templating/templateSources.js:68:13
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";
     ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
-        if (arguments.length === 1) {
+        if (false) {
             return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
         } else {

[Survived] EqualityOperator
src/templating/templateSources.js:68:13
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";
     ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
-        if (arguments.length === 1) {
+        if (arguments.length !== 1) {
             return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
         } else {

[Survived] ArithmeticOperator
src/templating/templateSources.js:69:58
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";
     ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
         if (arguments.length === 1) {
-            return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
+            return ko.utils.domData.get(this.domElement, dataDomDataPrefix - key);
         } else {
             ko.utils.domData.set(this.domElement, dataDomDataPrefix + key, arguments[1]);

[Survived] BlockStatement
src/templating/templateSources.js:70:16
     ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
         if (arguments.length === 1) {
             return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
-        } else {
-            ko.utils.domData.set(this.domElement, dataDomDataPrefix + key, arguments[1]);
-        }
+        } else {}
     };
 

[Survived] ArithmeticOperator
src/templating/templateSources.js:71:51
         if (arguments.length === 1) {
             return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
         } else {
-            ko.utils.domData.set(this.domElement, dataDomDataPrefix + key, arguments[1]);
+            ko.utils.domData.set(this.domElement, dataDomDataPrefix - key, arguments[1]);
         }
     };

[Survived] BlockStatement
src/templating/templateSources.js:76:42
     };
 
     var templatesDomDataKey = ko.utils.domData.nextKey();
-    function getTemplateDomData(element) {
-        return ko.utils.domData.get(element, templatesDomDataKey) || {};
-    }
+    function getTemplateDomData(element) {}
     function setTemplateDomData(element, data) {
         ko.utils.domData.set(element, templatesDomDataKey, data);

[Survived] LogicalOperator
src/templating/templateSources.js:77:16
 
     var templatesDomDataKey = ko.utils.domData.nextKey();
     function getTemplateDomData(element) {
-        return ko.utils.domData.get(element, templatesDomDataKey) || {};
+        return ko.utils.domData.get(element, templatesDomDataKey) && {};
     }
     function setTemplateDomData(element, data) {

[Survived] ConditionalExpression
src/templating/templateSources.js:77:16
 
     var templatesDomDataKey = ko.utils.domData.nextKey();
     function getTemplateDomData(element) {
-        return ko.utils.domData.get(element, templatesDomDataKey) || {};
+        return false;
     }
     function setTemplateDomData(element, data) {

[Survived] BlockStatement
src/templating/templateSources.js:79:48
     function getTemplateDomData(element) {
         return ko.utils.domData.get(element, templatesDomDataKey) || {};
     }
-    function setTemplateDomData(element, data) {
-        ko.utils.domData.set(element, templatesDomDataKey, data);
-    }
+    function setTemplateDomData(element, data) {}
 
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {

[Survived] StringLiteral
src/templating/templateSources.js:83:45
         ko.utils.domData.set(element, templatesDomDataKey, data);
     }
 
-    ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
+    ko.templateSources.domElement.prototype[""] = function(/* valueToWrite */) {
         var element = this.domElement;
         if (arguments.length == 0) {

[Survived] EqualityOperator
src/templating/templateSources.js:85:13
 
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
         var element = this.domElement;
-        if (arguments.length == 0) {
+        if (arguments.length != 0) {
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (

[Survived] ConditionalExpression
src/templating/templateSources.js:85:13
 
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
         var element = this.domElement;
-        if (arguments.length == 0) {
+        if (false) {
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (

[Survived] LogicalOperator
src/templating/templateSources.js:87:25
         var element = this.domElement;
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(element),
-                nodes = templateData.containerData || (
-                    this.templateType === templateTemplate ? element.content :
-                    this.templateType === templateElement ? element :
-                    undefined);
+                nodes = templateData.containerData && (this.templateType === templateTemplate ? element.content : this.templateType === templateElement ? element : undefined);
             if (!nodes || templateData.alwaysCheckText) {
                 // If the template is associated with an element that stores the template as text,

[Survived] ConditionalExpression
src/templating/templateSources.js:87:25
         var element = this.domElement;
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(element),
-                nodes = templateData.containerData || (
-                    this.templateType === templateTemplate ? element.content :
-                    this.templateType === templateElement ? element :
-                    undefined);
+                nodes = true;
             if (!nodes || templateData.alwaysCheckText) {
                 // If the template is associated with an element that stores the template as text,

[Survived] ConditionalExpression
src/templating/templateSources.js:88:21
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (
-                    this.templateType === templateTemplate ? element.content :
+                    true ? element.content :
                     this.templateType === templateElement ? element :
                     undefined);

[Survived] EqualityOperator
src/templating/templateSources.js:88:21
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (
-                    this.templateType === templateTemplate ? element.content :
+                    this.templateType !== templateTemplate ? element.content :
                     this.templateType === templateElement ? element :
                     undefined);

[Survived] ConditionalExpression
src/templating/templateSources.js:89:21
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (
                     this.templateType === templateTemplate ? element.content :
-                    this.templateType === templateElement ? element :
+                    false ? element :
                     undefined);
             if (!nodes || templateData.alwaysCheckText) {

[Survived] EqualityOperator
src/templating/templateSources.js:89:21
             var templateData = getTemplateDomData(element),
                 nodes = templateData.containerData || (
                     this.templateType === templateTemplate ? element.content :
-                    this.templateType === templateElement ? element :
+                    this.templateType !== templateElement ? element :
                     undefined);
             if (!nodes || templateData.alwaysCheckText) {

[Survived] ConditionalExpression
src/templating/templateSources.js:91:17
                     this.templateType === templateTemplate ? element.content :
                     this.templateType === templateElement ? element :
                     undefined);
-            if (!nodes || templateData.alwaysCheckText) {
+            if (false) {
                 // If the template is associated with an element that stores the template as text,
                 // parse and cache the nodes whenever there's new text content available. This allows

[Survived] LogicalOperator
src/templating/templateSources.js:91:17
                     this.templateType === templateTemplate ? element.content :
                     this.templateType === templateElement ? element :
                     undefined);
-            if (!nodes || templateData.alwaysCheckText) {
+            if (!nodes && templateData.alwaysCheckText) {
                 // If the template is associated with an element that stores the template as text,
                 // parse and cache the nodes whenever there's new text content available. This allows

[Survived] ConditionalExpression
src/templating/templateSources.js:96:21
                 // parse and cache the nodes whenever there's new text content available. This allows
                 // the user to update the template content by updating the text of template node.
                 var text = this['text']();
-                if (text && text !== templateData.textData) {
+                if (true) {
                     nodes = ko.utils.parseHtmlForTemplateNodes(text, element.ownerDocument);
                     setTemplateDomData(element, {containerData: nodes, textData: text, alwaysCheckText: true});

[Survived] EqualityOperator
src/templating/templateSources.js:96:29
                 // parse and cache the nodes whenever there's new text content available. This allows
                 // the user to update the template content by updating the text of template node.
                 var text = this['text']();
-                if (text && text !== templateData.textData) {
+                if (text && text === templateData.textData) {
                     nodes = ko.utils.parseHtmlForTemplateNodes(text, element.ownerDocument);
                     setTemplateDomData(element, {containerData: nodes, textData: text, alwaysCheckText: true});

[Survived] BooleanLiteral
src/templating/templateSources.js:98:105
                 var text = this['text']();
                 if (text && text !== templateData.textData) {
                     nodes = ko.utils.parseHtmlForTemplateNodes(text, element.ownerDocument);
-                    setTemplateDomData(element, {containerData: nodes, textData: text, alwaysCheckText: true});
+                    setTemplateDomData(element, {containerData: nodes, textData: text, alwaysCheckText: false});
                 }
             }

[Survived] ObjectLiteral
src/templating/templateSources.js:98:49
                 var text = this['text']();
                 if (text && text !== templateData.textData) {
                     nodes = ko.utils.parseHtmlForTemplateNodes(text, element.ownerDocument);
-                    setTemplateDomData(element, {containerData: nodes, textData: text, alwaysCheckText: true});
+                    setTemplateDomData(element, {});
                 }
             }

[Survived] BlockStatement
src/templating/templateSources.js:102:16
                 }
             }
             return nodes;
-        } else {
-            var valueToWrite = arguments[0];
-            if (this.templateType !== undefined) {
-                this['text']("");   // clear the text from the node
-            }
-            setTemplateDomData(element, {containerData: valueToWrite});
-        }
+        } else {}
     };
 

[Survived] EqualityOperator
src/templating/templateSources.js:104:17
             return nodes;
         } else {
             var valueToWrite = arguments[0];
-            if (this.templateType !== undefined) {
+            if (this.templateType === undefined) {
                 this['text']("");   // clear the text from the node
             }

[Survived] BlockStatement
src/templating/templateSources.js:104:50
             return nodes;
         } else {
             var valueToWrite = arguments[0];
-            if (this.templateType !== undefined) {
-                this['text']("");   // clear the text from the node
-            }
+            if (this.templateType !== undefined) {}
             setTemplateDomData(element, {containerData: valueToWrite});
         }

[Survived] StringLiteral
src/templating/templateSources.js:105:22
         } else {
             var valueToWrite = arguments[0];
             if (this.templateType !== undefined) {
-                this['text']("");   // clear the text from the node
+                this[""]("");   // clear the text from the node
             }
             setTemplateDomData(element, {containerData: valueToWrite});

[Survived] BlockStatement
src/templating/templateSources.js:116:62
     // For compatibility, you can also read "text"; it will be serialized from the nodes on demand.
     // Writing to "text" is still supported, but then the template data will not be available as DOM nodes.
 
-    ko.templateSources.anonymousTemplate = function(element) {
-        this.domElement = element;
-    }
+    ko.templateSources.anonymousTemplate = function(element) {}
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;

[Survived] BlockStatement
src/templating/templateSources.js:121:91
     }
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
-    ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
-            var templateData = getTemplateDomData(this.domElement);
-            if (templateData.textData === undefined && templateData.containerData)
-                templateData.textData = templateData.containerData.innerHTML;
-            return templateData.textData;
-        } else {
-            var valueToWrite = arguments[0];
-            setTemplateDomData(this.domElement, {textData: valueToWrite});
-        }
-    };
+    ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {};
 
     ko.exportSymbol('templateSources', ko.templateSources);

[Survived] ConditionalExpression
src/templating/templateSources.js:122:13
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
+        if (true) {
             var templateData = getTemplateDomData(this.domElement);
             if (templateData.textData === undefined && templateData.containerData)

[Survived] BlockStatement
src/templating/templateSources.js:122:36
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
-            var templateData = getTemplateDomData(this.domElement);
-            if (templateData.textData === undefined && templateData.containerData)
-                templateData.textData = templateData.containerData.innerHTML;
-            return templateData.textData;
-        } else {
+        if (arguments.length == 0) {} else {
             var valueToWrite = arguments[0];
             setTemplateDomData(this.domElement, {textData: valueToWrite});

[Survived] ConditionalExpression
src/templating/templateSources.js:124:17
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(this.domElement);
-            if (templateData.textData === undefined && templateData.containerData)
+            if (true)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;

[Survived] ConditionalExpression
src/templating/templateSources.js:124:17
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
             var templateData = getTemplateDomData(this.domElement);
-            if (templateData.textData === undefined && templateData.containerData)
+            if (true && templateData.containerData)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;

[Survived] BlockStatement
src/templating/templateSources.js:127:16
             if (templateData.textData === undefined && templateData.containerData)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;
-        } else {
-            var valueToWrite = arguments[0];
-            setTemplateDomData(this.domElement, {textData: valueToWrite});
-        }
+        } else {}
     };
 

[Survived] ObjectLiteral
src/templating/templateSources.js:129:49
             return templateData.textData;
         } else {
             var valueToWrite = arguments[0];
-            setTemplateDomData(this.domElement, {textData: valueToWrite});
+            setTemplateDomData(this.domElement, {});
         }
     };
