[Survived] StringLiteral
src/utils.domData.js:4:43
 
 ko.utils.domData = new (function () {
     var uniqueId = 0;
-    var dataStoreKeyExpandoPropertyName = "__ko__" + (new Date).getTime();
+    var dataStoreKeyExpandoPropertyName = "" + (new Date).getTime();
     var dataStore = {};
 

[Survived] ConditionalExpression
src/utils.domData.js:8:9
     var dataStore = {};
 
     var getDataForNode, clear;
-    if (!ko.utils.ieVersion) {
+    if (false) {
         // We considered using WeakMap, but it has a problem in IE 11 and Edge that prevents using
         // it cross-window, so instead we just store the data directly on the node.

[Survived] BlockStatement
src/utils.domData.js:8:30
     var dataStore = {};
 
     var getDataForNode, clear;
-    if (!ko.utils.ieVersion) {
-        // We considered using WeakMap, but it has a problem in IE 11 and Edge that prevents using
-        // it cross-window, so instead we just store the data directly on the node.
-        // See https://github.com/knockout/knockout/issues/2141
-        getDataForNode = function (node, createIfNotFound) {
-            var dataForNode = node[dataStoreKeyExpandoPropertyName];
-            if (!dataForNode && createIfNotFound) {
-                dataForNode = node[dataStoreKeyExpandoPropertyName] = {};
-            }
-            return dataForNode;
-        };
-        clear = function (node) {
-            if (node[dataStoreKeyExpandoPropertyName]) {
-                delete node[dataStoreKeyExpandoPropertyName];
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
-            }
-            return false;
-        };
-    } else {
+    if (!ko.utils.ieVersion) {} else {
         // Old IE versions have memory issues if you store objects on the node, so we use a
         // separate data storage and link to it from the node using a string key.

[Survived] BlockStatement
src/utils.domData.js:12:60
         // We considered using WeakMap, but it has a problem in IE 11 and Edge that prevents using
         // it cross-window, so instead we just store the data directly on the node.
         // See https://github.com/knockout/knockout/issues/2141
-        getDataForNode = function (node, createIfNotFound) {
-            var dataForNode = node[dataStoreKeyExpandoPropertyName];
-            if (!dataForNode && createIfNotFound) {
-                dataForNode = node[dataStoreKeyExpandoPropertyName] = {};
-            }
-            return dataForNode;
-        };
+        getDataForNode = function (node, createIfNotFound) {};
         clear = function (node) {
             if (node[dataStoreKeyExpandoPropertyName]) {

[Survived] LogicalOperator
src/utils.domData.js:14:17
         // See https://github.com/knockout/knockout/issues/2141
         getDataForNode = function (node, createIfNotFound) {
             var dataForNode = node[dataStoreKeyExpandoPropertyName];
-            if (!dataForNode && createIfNotFound) {
+            if (!dataForNode || createIfNotFound) {
                 dataForNode = node[dataStoreKeyExpandoPropertyName] = {};
             }

[Survived] BlockStatement
src/utils.domData.js:14:51
         // See https://github.com/knockout/knockout/issues/2141
         getDataForNode = function (node, createIfNotFound) {
             var dataForNode = node[dataStoreKeyExpandoPropertyName];
-            if (!dataForNode && createIfNotFound) {
-                dataForNode = node[dataStoreKeyExpandoPropertyName] = {};
-            }
+            if (!dataForNode && createIfNotFound) {}
             return dataForNode;
         };

[Survived] BlockStatement
src/utils.domData.js:19:33
             }
             return dataForNode;
         };
-        clear = function (node) {
-            if (node[dataStoreKeyExpandoPropertyName]) {
-                delete node[dataStoreKeyExpandoPropertyName];
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
-            }
-            return false;
-        };
+        clear = function (node) {};
     } else {
         // Old IE versions have memory issues if you store objects on the node, so we use a

[Survived] ConditionalExpression
src/utils.domData.js:20:17
             return dataForNode;
         };
         clear = function (node) {
-            if (node[dataStoreKeyExpandoPropertyName]) {
+            if (false) {
                 delete node[dataStoreKeyExpandoPropertyName];
                 return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended

[Survived] ConditionalExpression
src/utils.domData.js:20:17
             return dataForNode;
         };
         clear = function (node) {
-            if (node[dataStoreKeyExpandoPropertyName]) {
+            if (true) {
                 delete node[dataStoreKeyExpandoPropertyName];
                 return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended

[Survived] BooleanLiteral
src/utils.domData.js:22:24
         clear = function (node) {
             if (node[dataStoreKeyExpandoPropertyName]) {
                 delete node[dataStoreKeyExpandoPropertyName];
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
+                return false; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
             }
             return false;

[Survived] BlockStatement
src/utils.domData.js:26:12
             }
             return false;
         };
-    } else {
-        // Old IE versions have memory issues if you store objects on the node, so we use a
-        // separate data storage and link to it from the node using a string key.
-        getDataForNode = function (node, createIfNotFound) {
-            var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
-            if (!hasExistingDataStore) {
-                if (!createIfNotFound)
-                    return undefined;
-                dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;
-                dataStore[dataStoreKey] = {};
-            }
-            return dataStore[dataStoreKey];
-        };
-        clear = function (node) {
-            var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            if (dataStoreKey) {
-                delete dataStore[dataStoreKey];
-                node[dataStoreKeyExpandoPropertyName] = null;
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
-            }
-            return false;
-        };
-    }
+    } else {}
 
     return {

[Survived] BlockStatement
src/utils.domData.js:29:60
     } else {
         // Old IE versions have memory issues if you store objects on the node, so we use a
         // separate data storage and link to it from the node using a string key.
-        getDataForNode = function (node, createIfNotFound) {
-            var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
-            if (!hasExistingDataStore) {
-                if (!createIfNotFound)
-                    return undefined;
-                dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;
-                dataStore[dataStoreKey] = {};
-            }
-            return dataStore[dataStoreKey];
-        };
+        getDataForNode = function (node, createIfNotFound) {};
         clear = function (node) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];

[Survived] ConditionalExpression
src/utils.domData.js:31:57
         // separate data storage and link to it from the node using a string key.
         getDataForNode = function (node, createIfNotFound) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
+            var hasExistingDataStore = dataStoreKey && (true) && dataStore[dataStoreKey];
             if (!hasExistingDataStore) {
                 if (!createIfNotFound)

[Survived] LogicalOperator
src/utils.domData.js:31:40
         // separate data storage and link to it from the node using a string key.
         getDataForNode = function (node, createIfNotFound) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
+            var hasExistingDataStore = dataStoreKey && dataStoreKey !== "null" || dataStore[dataStoreKey];
             if (!hasExistingDataStore) {
                 if (!createIfNotFound)

[Survived] BlockStatement
src/utils.domData.js:32:40
         getDataForNode = function (node, createIfNotFound) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
             var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
-            if (!hasExistingDataStore) {
-                if (!createIfNotFound)
-                    return undefined;
-                dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;
-                dataStore[dataStoreKey] = {};
-            }
+            if (!hasExistingDataStore) {}
             return dataStore[dataStoreKey];
         };

[Survived] ConditionalExpression
src/utils.domData.js:32:17
         getDataForNode = function (node, createIfNotFound) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
             var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
-            if (!hasExistingDataStore) {
+            if (true) {
                 if (!createIfNotFound)
                     return undefined;

[Survived] ConditionalExpression
src/utils.domData.js:33:21
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
             var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
             if (!hasExistingDataStore) {
-                if (!createIfNotFound)
+                if (false)
                     return undefined;
                 dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;

[Survived] BooleanLiteral
src/utils.domData.js:33:21
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
             var hasExistingDataStore = dataStoreKey && (dataStoreKey !== "null") && dataStore[dataStoreKey];
             if (!hasExistingDataStore) {
-                if (!createIfNotFound)
+                if (createIfNotFound)
                     return undefined;
                 dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;

[Survived] UpdateOperator
src/utils.domData.js:35:79
             if (!hasExistingDataStore) {
                 if (!createIfNotFound)
                     return undefined;
-                dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId++;
+                dataStoreKey = node[dataStoreKeyExpandoPropertyName] = "ko" + uniqueId--;
                 dataStore[dataStoreKey] = {};
             }

[Survived] BlockStatement
src/utils.domData.js:40:33
             }
             return dataStore[dataStoreKey];
         };
-        clear = function (node) {
-            var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            if (dataStoreKey) {
-                delete dataStore[dataStoreKey];
-                node[dataStoreKeyExpandoPropertyName] = null;
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
-            }
-            return false;
-        };
+        clear = function (node) {};
     }
 

[Survived] ConditionalExpression
src/utils.domData.js:42:17
         };
         clear = function (node) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            if (dataStoreKey) {
+            if (true) {
                 delete dataStore[dataStoreKey];
                 node[dataStoreKeyExpandoPropertyName] = null;

[Survived] ConditionalExpression
src/utils.domData.js:42:17
         };
         clear = function (node) {
             var dataStoreKey = node[dataStoreKeyExpandoPropertyName];
-            if (dataStoreKey) {
+            if (false) {
                 delete dataStore[dataStoreKey];
                 node[dataStoreKeyExpandoPropertyName] = null;

[Survived] BooleanLiteral
src/utils.domData.js:45:24
             if (dataStoreKey) {
                 delete dataStore[dataStoreKey];
                 node[dataStoreKeyExpandoPropertyName] = null;
-                return true; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
+                return false; // Exposing "did clean" flag purely so specs can infer whether things have been cleaned up as intended
             }
             return false;

[Survived] BlockStatement
src/utils.domData.js:52:35
     }
 
     return {
-        get: function (node, key) {
-            var dataForNode = getDataForNode(node, false);
-            return dataForNode && dataForNode[key];
-        },
+        get: function (node, key) {},
         set: function (node, key, value) {
             // Make sure we don't actually create a new domData key if we are actually deleting a value

[Survived] BooleanLiteral
src/utils.domData.js:53:52
 
     return {
         get: function (node, key) {
-            var dataForNode = getDataForNode(node, false);
+            var dataForNode = getDataForNode(node, true);
             return dataForNode && dataForNode[key];
         },

[Survived] ConditionalExpression
src/utils.domData.js:54:20
     return {
         get: function (node, key) {
             var dataForNode = getDataForNode(node, false);
-            return dataForNode && dataForNode[key];
+            return false;
         },
         set: function (node, key, value) {

[Survived] LogicalOperator
src/utils.domData.js:54:20
     return {
         get: function (node, key) {
             var dataForNode = getDataForNode(node, false);
-            return dataForNode && dataForNode[key];
+            return dataForNode || dataForNode[key];
         },
         set: function (node, key, value) {

[Survived] BlockStatement
src/utils.domData.js:56:42
             var dataForNode = getDataForNode(node, false);
             return dataForNode && dataForNode[key];
         },
-        set: function (node, key, value) {
-            // Make sure we don't actually create a new domData key if we are actually deleting a value
-            var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
-            dataForNode && (dataForNode[key] = value);
-        },
+        set: function (node, key, value) {},
         getOrSet: function (node, key, value) {
             var dataForNode = getDataForNode(node, true /* createIfNotFound */);

[Survived] ConditionalExpression
src/utils.domData.js:58:52
         },
         set: function (node, key, value) {
             // Make sure we don't actually create a new domData key if we are actually deleting a value
-            var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
+            var dataForNode = getDataForNode(node, true /* createIfNotFound */);
             dataForNode && (dataForNode[key] = value);
         },

[Survived] ConditionalExpression
src/utils.domData.js:58:52
         },
         set: function (node, key, value) {
             // Make sure we don't actually create a new domData key if we are actually deleting a value
-            var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
+            var dataForNode = getDataForNode(node, false /* createIfNotFound */);
             dataForNode && (dataForNode[key] = value);
         },

[Survived] LogicalOperator
src/utils.domData.js:59:13
         set: function (node, key, value) {
             // Make sure we don't actually create a new domData key if we are actually deleting a value
             var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
-            dataForNode && (dataForNode[key] = value);
+            dataForNode || (dataForNode[key] = value);
         },
         getOrSet: function (node, key, value) {

[Survived] ConditionalExpression
src/utils.domData.js:59:13
         set: function (node, key, value) {
             // Make sure we don't actually create a new domData key if we are actually deleting a value
             var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
-            dataForNode && (dataForNode[key] = value);
+            false;
         },
         getOrSet: function (node, key, value) {

[Survived] BlockStatement
src/utils.domData.js:61:47
             var dataForNode = getDataForNode(node, value !== undefined /* createIfNotFound */);
             dataForNode && (dataForNode[key] = value);
         },
-        getOrSet: function (node, key, value) {
-            var dataForNode = getDataForNode(node, true /* createIfNotFound */);
-            return dataForNode[key] || (dataForNode[key] = value);
-        },
+        getOrSet: function (node, key, value) {},
         clear: clear,
 

[Survived] BooleanLiteral
src/utils.domData.js:62:52
             dataForNode && (dataForNode[key] = value);
         },
         getOrSet: function (node, key, value) {
-            var dataForNode = getDataForNode(node, true /* createIfNotFound */);
+            var dataForNode = getDataForNode(node, false /* createIfNotFound */);
             return dataForNode[key] || (dataForNode[key] = value);
         },

[Survived] ConditionalExpression
src/utils.domData.js:63:20
         },
         getOrSet: function (node, key, value) {
             var dataForNode = getDataForNode(node, true /* createIfNotFound */);
-            return dataForNode[key] || (dataForNode[key] = value);
+            return false;
         },
         clear: clear,

[Survived] LogicalOperator
src/utils.domData.js:63:20
         },
         getOrSet: function (node, key, value) {
             var dataForNode = getDataForNode(node, true /* createIfNotFound */);
-            return dataForNode[key] || (dataForNode[key] = value);
+            return dataForNode[key] && (dataForNode[key] = value);
         },
         clear: clear,

[Survived] BlockStatement
src/utils.domData.js:67:30
         },
         clear: clear,
 
-        nextKey: function () {
-            return (uniqueId++) + dataStoreKeyExpandoPropertyName;
-        }
+        nextKey: function () {}
     };
 })();

[Survived] UpdateOperator
src/utils.domData.js:68:21
         clear: clear,
 
         nextKey: function () {
-            return (uniqueId++) + dataStoreKeyExpandoPropertyName;
+            return (uniqueId--) + dataStoreKeyExpandoPropertyName;
         }
     };

[Survived] ArithmeticOperator
src/utils.domData.js:68:20
         clear: clear,
 
         nextKey: function () {
-            return (uniqueId++) + dataStoreKeyExpandoPropertyName;
+            return uniqueId++ - dataStoreKeyExpandoPropertyName;
         }
     };

[Survived] StringLiteral
src/utils.domData.js:74:17
 })();
 
 ko.exportSymbol('utils.domData', ko.utils.domData);
-ko.exportSymbol('utils.domData.clear', ko.utils.domData.clear); // Exporting only so specs can clear up after themselves fully
+ko.exportSymbol("", ko.utils.domData.clear); // Exporting only so specs can clear up after themselves fully
 
