[Survived] BlockStatement
src/utils.js:249:49
 
         replaceDomNodes: function (nodeToReplaceOrNodeArray, newNodesArray) {
             var nodesToReplaceArray = nodeToReplaceOrNodeArray.nodeType ? [nodeToReplaceOrNodeArray] : nodeToReplaceOrNodeArray;
-            if (nodesToReplaceArray.length > 0) {
-                var insertionPoint = nodesToReplaceArray[0];
-                var parent = insertionPoint.parentNode;
-                for (var i = 0, j = newNodesArray.length; i < j; i++)
-                    parent.insertBefore(newNodesArray[i], insertionPoint);
-                for (var i = 0, j = nodesToReplaceArray.length; i < j; i++) {
-                    ko.removeNode(nodesToReplaceArray[i]);
-                }
-            }
+            if (nodesToReplaceArray.length > 0) {}
         },
 

[Survived] ConditionalExpression
src/utils.js:249:17
 
         replaceDomNodes: function (nodeToReplaceOrNodeArray, newNodesArray) {
             var nodesToReplaceArray = nodeToReplaceOrNodeArray.nodeType ? [nodeToReplaceOrNodeArray] : nodeToReplaceOrNodeArray;
-            if (nodesToReplaceArray.length > 0) {
+            if (false) {
                 var insertionPoint = nodesToReplaceArray[0];
                 var parent = insertionPoint.parentNode;

[Survived] EqualityOperator
src/utils.js:252:59
             if (nodesToReplaceArray.length > 0) {
                 var insertionPoint = nodesToReplaceArray[0];
                 var parent = insertionPoint.parentNode;
-                for (var i = 0, j = newNodesArray.length; i < j; i++)
+                for (var i = 0, j = newNodesArray.length; i >= j; i++)
                     parent.insertBefore(newNodesArray[i], insertionPoint);
                 for (var i = 0, j = nodesToReplaceArray.length; i < j; i++) {

[Survived] UpdateOperator
src/utils.js:252:66
             if (nodesToReplaceArray.length > 0) {
                 var insertionPoint = nodesToReplaceArray[0];
                 var parent = insertionPoint.parentNode;
-                for (var i = 0, j = newNodesArray.length; i < j; i++)
+                for (var i = 0, j = newNodesArray.length; i < j; i--)
                     parent.insertBefore(newNodesArray[i], insertionPoint);
                 for (var i = 0, j = nodesToReplaceArray.length; i < j; i++) {

[Survived] UpdateOperator
src/utils.js:254:72
                 var parent = insertionPoint.parentNode;
                 for (var i = 0, j = newNodesArray.length; i < j; i++)
                     parent.insertBefore(newNodesArray[i], insertionPoint);
-                for (var i = 0, j = nodesToReplaceArray.length; i < j; i++) {
+                for (var i = 0, j = nodesToReplaceArray.length; i < j; i--) {
                     ko.removeNode(nodesToReplaceArray[i]);
                 }

[Survived] EqualityOperator
src/utils.js:254:65
                 var parent = insertionPoint.parentNode;
                 for (var i = 0, j = newNodesArray.length; i < j; i++)
                     parent.insertBefore(newNodesArray[i], insertionPoint);
-                for (var i = 0, j = nodesToReplaceArray.length; i < j; i++) {
+                for (var i = 0, j = nodesToReplaceArray.length; i <= j; i++) {
                     ko.removeNode(nodesToReplaceArray[i]);
                 }

[Survived] BlockStatement
src/utils.js:277:45
             //   [C] We want to output a continuous series of nodes. So, ignore any nodes that have already been removed,
             //       and include any nodes that have been inserted among the previous collection
 
-            if (continuousNodeArray.length) {
-                // The parent node can be a virtual element; so get the real parent node
-                parentNode = (parentNode.nodeType === 8 && parentNode.parentNode) || parentNode;
-
-                // Rule [A]
-                while (continuousNodeArray.length && continuousNodeArray[0].parentNode !== parentNode)
-                    continuousNodeArray.splice(0, 1);
-
-                // Rule [B]
-                while (continuousNodeArray.length > 1 && continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
-                    continuousNodeArray.length--;
-
-                // Rule [C]
-                if (continuousNodeArray.length > 1) {
-                    var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
-                    // Replace with the actual new continuous node set
-                    continuousNodeArray.length = 0;
-                    while (current !== last) {
-                        continuousNodeArray.push(current);
-                        current = current.nextSibling;
-                    }
-                    continuousNodeArray.push(last);
-                }
-            }
+            if (continuousNodeArray.length) {}
             return continuousNodeArray;
         },

[Survived] EqualityOperator
src/utils.js:279:31
 
             if (continuousNodeArray.length) {
                 // The parent node can be a virtual element; so get the real parent node
-                parentNode = (parentNode.nodeType === 8 && parentNode.parentNode) || parentNode;
+                parentNode = (parentNode.nodeType !== 8 && parentNode.parentNode) || parentNode;
 
                 // Rule [A]

[Survived] LogicalOperator
src/utils.js:279:30
 
             if (continuousNodeArray.length) {
                 // The parent node can be a virtual element; so get the real parent node
-                parentNode = (parentNode.nodeType === 8 && parentNode.parentNode) || parentNode;
+                parentNode = parentNode.nodeType === 8 && parentNode.parentNode && parentNode;
 
                 // Rule [A]

[Survived] ConditionalExpression
src/utils.js:282:24
                 parentNode = (parentNode.nodeType === 8 && parentNode.parentNode) || parentNode;
 
                 // Rule [A]
-                while (continuousNodeArray.length && continuousNodeArray[0].parentNode !== parentNode)
+                while (false)
                     continuousNodeArray.splice(0, 1);
 

[Survived] LogicalOperator
src/utils.js:282:24
                 parentNode = (parentNode.nodeType === 8 && parentNode.parentNode) || parentNode;
 
                 // Rule [A]
-                while (continuousNodeArray.length && continuousNodeArray[0].parentNode !== parentNode)
+                while (continuousNodeArray.length || continuousNodeArray[0].parentNode !== parentNode)
                     continuousNodeArray.splice(0, 1);
 

[Survived] ConditionalExpression
src/utils.js:286:24
                     continuousNodeArray.splice(0, 1);
 
                 // Rule [B]
-                while (continuousNodeArray.length > 1 && continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
+                while (true && continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
                     continuousNodeArray.length--;
 

[Survived] LogicalOperator
src/utils.js:286:24
                     continuousNodeArray.splice(0, 1);
 
                 // Rule [B]
-                while (continuousNodeArray.length > 1 && continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
+                while (continuousNodeArray.length > 1 || continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
                     continuousNodeArray.length--;
 

[Survived] UpdateOperator
src/utils.js:287:21
 
                 // Rule [B]
                 while (continuousNodeArray.length > 1 && continuousNodeArray[continuousNodeArray.length - 1].parentNode !== parentNode)
-                    continuousNodeArray.length--;
+                    continuousNodeArray.length++;
 
                 // Rule [C]

[Survived] EqualityOperator
src/utils.js:290:21
                     continuousNodeArray.length--;
 
                 // Rule [C]
-                if (continuousNodeArray.length > 1) {
+                if (continuousNodeArray.length <= 1) {
                     var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
                     // Replace with the actual new continuous node set

[Survived] BlockStatement
src/utils.js:290:53
                     continuousNodeArray.length--;
 
                 // Rule [C]
-                if (continuousNodeArray.length > 1) {
-                    var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
-                    // Replace with the actual new continuous node set
-                    continuousNodeArray.length = 0;
-                    while (current !== last) {
-                        continuousNodeArray.push(current);
-                        current = current.nextSibling;
-                    }
-                    continuousNodeArray.push(last);
-                }
+                if (continuousNodeArray.length > 1) {}
             }
             return continuousNodeArray;

[Survived] ArithmeticOperator
src/utils.js:291:86
 
                 // Rule [C]
                 if (continuousNodeArray.length > 1) {
-                    var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
+                    var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length + 1];
                     // Replace with the actual new continuous node set
                     continuousNodeArray.length = 0;

[Survived] BlockStatement
src/utils.js:294:46
                     var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
                     // Replace with the actual new continuous node set
                     continuousNodeArray.length = 0;
-                    while (current !== last) {
-                        continuousNodeArray.push(current);
-                        current = current.nextSibling;
-                    }
+                    while (current !== last) {}
                     continuousNodeArray.push(last);
                 }

[Survived] EqualityOperator
src/utils.js:294:28
                     var current = continuousNodeArray[0], last = continuousNodeArray[continuousNodeArray.length - 1];
                     // Replace with the actual new continuous node set
                     continuousNodeArray.length = 0;
-                    while (current !== last) {
+                    while (current === last) {
                         continuousNodeArray.push(current);
                         current = current.nextSibling;

[Survived] BlockStatement
src/utils.js:304:72
             return continuousNodeArray;
         },
 
-        setOptionNodeSelectionState: function (optionNode, isSelected) {
-            // IE6 sometimes throws "unknown error" if you try to write to .selected directly, whereas Firefox struggles with setAttribute. Pick one based on browser.
-            if (ieVersion < 7)
-                optionNode.setAttribute("selected", isSelected);
-            else
-                optionNode.selected = isSelected;
-        },
+        setOptionNodeSelectionState: function (optionNode, isSelected) {},
 
         stringTrim: function (string) {

[Survived] ConditionalExpression
src/utils.js:306:17
 
         setOptionNodeSelectionState: function (optionNode, isSelected) {
             // IE6 sometimes throws "unknown error" if you try to write to .selected directly, whereas Firefox struggles with setAttribute. Pick one based on browser.
-            if (ieVersion < 7)
+            if (true)
                 optionNode.setAttribute("selected", isSelected);
             else

[Survived] EqualityOperator
src/utils.js:306:17
 
         setOptionNodeSelectionState: function (optionNode, isSelected) {
             // IE6 sometimes throws "unknown error" if you try to write to .selected directly, whereas Firefox struggles with setAttribute. Pick one based on browser.
-            if (ieVersion < 7)
+            if (ieVersion <= 7)
                 optionNode.setAttribute("selected", isSelected);
             else

[Survived] StringLiteral
src/utils.js:307:41
         setOptionNodeSelectionState: function (optionNode, isSelected) {
             // IE6 sometimes throws "unknown error" if you try to write to .selected directly, whereas Firefox struggles with setAttribute. Pick one based on browser.
             if (ieVersion < 7)
-                optionNode.setAttribute("selected", isSelected);
+                optionNode.setAttribute("", isSelected);
             else
                 optionNode.selected = isSelected;

[Survived] BlockStatement
src/utils.js:312:39
                 optionNode.selected = isSelected;
         },
 
-        stringTrim: function (string) {
-            return string === null || string === undefined ? '' :
-                string.trim ?
-                    string.trim() :
-                    string.toString().replace(/^[\s\xa0]+|[\s\xa0]+$/g, '');
-        },
+        stringTrim: function (string) {},
 
         stringStartsWith: function (string, startsWith) {

[Survived] EqualityOperator
src/utils.js:313:39
         },
 
         stringTrim: function (string) {
-            return string === null || string === undefined ? '' :
+            return string === null || string !== undefined ? '' :
                 string.trim ?
                     string.trim() :

[Survived] ConditionalExpression
src/utils.js:313:39
         },
 
         stringTrim: function (string) {
-            return string === null || string === undefined ? '' :
+            return string === null || false ? '' :
                 string.trim ?
                     string.trim() :

[Survived] MethodExpression
src/utils.js:315:21
         stringTrim: function (string) {
             return string === null || string === undefined ? '' :
                 string.trim ?
-                    string.trim() :
+                    string :
                     string.toString().replace(/^[\s\xa0]+|[\s\xa0]+$/g, '');
         },

[Survived] Regex
src/utils.js:316:47
             return string === null || string === undefined ? '' :
                 string.trim ?
                     string.trim() :
-                    string.toString().replace(/^[\s\xa0]+|[\s\xa0]+$/g, '');
+                    string.toString().replace(/^[\S\xa0]+|[\s\xa0]+$/g, '');
         },
 

[Survived] Regex
src/utils.js:316:47
             return string === null || string === undefined ? '' :
                 string.trim ?
                     string.trim() :
-                    string.toString().replace(/^[\s\xa0]+|[\s\xa0]+$/g, '');
+                    string.toString().replace(/^[\s\xa0]+|[^\s\xa0]+$/g, '');
         },
 

[Survived] BlockStatement
src/utils.js:319:57
                     string.toString().replace(/^[\s\xa0]+|[\s\xa0]+$/g, '');
         },
 
-        stringStartsWith: function (string, startsWith) {
-            string = string || "";
-            if (startsWith.length > string.length)
-                return false;
-            return string.substring(0, startsWith.length) === startsWith;
-        },
+        stringStartsWith: function (string, startsWith) {},
 
         domNodeIsContainedBy: function (node, containedByNode) {

[Survived] ConditionalExpression
src/utils.js:320:22
         },
 
         stringStartsWith: function (string, startsWith) {
-            string = string || "";
+            string = false;
             if (startsWith.length > string.length)
                 return false;

[Survived] LogicalOperator
src/utils.js:320:22
         },
 
         stringStartsWith: function (string, startsWith) {
-            string = string || "";
+            string = string && "";
             if (startsWith.length > string.length)
                 return false;

[Survived] ConditionalExpression
src/utils.js:321:17
 
         stringStartsWith: function (string, startsWith) {
             string = string || "";
-            if (startsWith.length > string.length)
+            if (true)
                 return false;
             return string.substring(0, startsWith.length) === startsWith;

[Survived] EqualityOperator
src/utils.js:321:17
 
         stringStartsWith: function (string, startsWith) {
             string = string || "";
-            if (startsWith.length > string.length)
+            if (startsWith.length <= string.length)
                 return false;
             return string.substring(0, startsWith.length) === startsWith;

[Survived] BooleanLiteral
src/utils.js:322:24
         stringStartsWith: function (string, startsWith) {
             string = string || "";
             if (startsWith.length > string.length)
-                return false;
+                return true;
             return string.substring(0, startsWith.length) === startsWith;
         },

[Survived] ConditionalExpression
src/utils.js:323:20
             string = string || "";
             if (startsWith.length > string.length)
                 return false;
-            return string.substring(0, startsWith.length) === startsWith;
+            return true;
         },
 

[Survived] MethodExpression
src/utils.js:323:20
             string = string || "";
             if (startsWith.length > string.length)
                 return false;
-            return string.substring(0, startsWith.length) === startsWith;
+            return string === startsWith;
         },
 

[Survived] BlockStatement
src/utils.js:326:64
             return string.substring(0, startsWith.length) === startsWith;
         },
 
-        domNodeIsContainedBy: function (node, containedByNode) {
-            if (node === containedByNode)
-                return true;
-            if (node.nodeType === 11)
-                return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
-            if (containedByNode.contains)
-                return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
-            if (containedByNode.compareDocumentPosition)
-                return (containedByNode.compareDocumentPosition(node) & 16) == 16;
-            while (node && node != containedByNode) {
-                node = node.parentNode;
-            }
-            return !!node;
-        },
+        domNodeIsContainedBy: function (node, containedByNode) {},
 
         domNodeIsAttachedToDocument: function (node) {

[Survived] ConditionalExpression
src/utils.js:327:17
         },
 
         domNodeIsContainedBy: function (node, containedByNode) {
-            if (node === containedByNode)
+            if (true)
                 return true;
             if (node.nodeType === 11)

[Survived] ConditionalExpression
src/utils.js:327:17
         },
 
         domNodeIsContainedBy: function (node, containedByNode) {
-            if (node === containedByNode)
+            if (false)
                 return true;
             if (node.nodeType === 11)

[Survived] BooleanLiteral
src/utils.js:328:24
 
         domNodeIsContainedBy: function (node, containedByNode) {
             if (node === containedByNode)
-                return true;
+                return false;
             if (node.nodeType === 11)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8

[Survived] ConditionalExpression
src/utils.js:329:17
         domNodeIsContainedBy: function (node, containedByNode) {
             if (node === containedByNode)
                 return true;
-            if (node.nodeType === 11)
+            if (true)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)

[Survived] ConditionalExpression
src/utils.js:329:17
         domNodeIsContainedBy: function (node, containedByNode) {
             if (node === containedByNode)
                 return true;
-            if (node.nodeType === 11)
+            if (false)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)

[Survived] BooleanLiteral
src/utils.js:330:24
             if (node === containedByNode)
                 return true;
             if (node.nodeType === 11)
-                return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
+                return true; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);

[Survived] ConditionalExpression
src/utils.js:331:17
                 return true;
             if (node.nodeType === 11)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
-            if (containedByNode.contains)
+            if (true)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)

[Survived] ConditionalExpression
src/utils.js:331:17
                 return true;
             if (node.nodeType === 11)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
-            if (containedByNode.contains)
+            if (false)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)

[Survived] ConditionalExpression
src/utils.js:332:49
             if (node.nodeType === 11)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)
-                return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
+                return containedByNode.contains(false ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;

[Survived] ConditionalExpression
src/utils.js:332:49
             if (node.nodeType === 11)
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)
-                return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
+                return containedByNode.contains(true ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;

[Survived] ConditionalExpression
src/utils.js:333:17
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
-            if (containedByNode.compareDocumentPosition)
+            if (false)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;
             while (node && node != containedByNode) {

[Survived] ConditionalExpression
src/utils.js:333:17
                 return false; // Fixes issue #1162 - can't use node.contains for document fragments on IE8
             if (containedByNode.contains)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
-            if (containedByNode.compareDocumentPosition)
+            if (true)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;
             while (node && node != containedByNode) {

[Survived] ConditionalExpression
src/utils.js:334:24
             if (containedByNode.contains)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
-                return (containedByNode.compareDocumentPosition(node) & 16) == 16;
+                return true;
             while (node && node != containedByNode) {
                 node = node.parentNode;

[Survived] ConditionalExpression
src/utils.js:334:24
             if (containedByNode.contains)
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
-                return (containedByNode.compareDocumentPosition(node) & 16) == 16;
+                return false;
             while (node && node != containedByNode) {
                 node = node.parentNode;

[Survived] ConditionalExpression
src/utils.js:335:28
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;
-            while (node && node != containedByNode) {
+            while (node && true) {
                 node = node.parentNode;
             }

[Survived] BlockStatement
src/utils.js:335:53
                 return containedByNode.contains(node.nodeType !== 1 ? node.parentNode : node);
             if (containedByNode.compareDocumentPosition)
                 return (containedByNode.compareDocumentPosition(node) & 16) == 16;
-            while (node && node != containedByNode) {
-                node = node.parentNode;
-            }
+            while (node && node != containedByNode) {}
             return !!node;
         },

[Survived] BooleanLiteral
src/utils.js:338:20
             while (node && node != containedByNode) {
                 node = node.parentNode;
             }
-            return !!node;
+            return !node;
         },
 

[Survived] BlockStatement
src/utils.js:341:54
             return !!node;
         },
 
-        domNodeIsAttachedToDocument: function (node) {
-            return ko.utils.domNodeIsContainedBy(node, node.ownerDocument.documentElement);
-        },
+        domNodeIsAttachedToDocument: function (node) {},
 
         anyDomNodeIsAttachedToDocument: function(nodes) {

[Survived] BlockStatement
src/utils.js:345:57
             return ko.utils.domNodeIsContainedBy(node, node.ownerDocument.documentElement);
         },
 
-        anyDomNodeIsAttachedToDocument: function(nodes) {
-            return !!ko.utils.arrayFirst(nodes, ko.utils.domNodeIsAttachedToDocument);
-        },
+        anyDomNodeIsAttachedToDocument: function(nodes) {},
 
         tagNameLower: function(element) {

[Survived] BooleanLiteral
src/utils.js:346:21
         },
 
         anyDomNodeIsAttachedToDocument: function(nodes) {
-            return !!ko.utils.arrayFirst(nodes, ko.utils.domNodeIsAttachedToDocument);
+            return !ko.utils.arrayFirst(nodes, ko.utils.domNodeIsAttachedToDocument);
         },
 

[Survived] BlockStatement
src/utils.js:349:41
             return !!ko.utils.arrayFirst(nodes, ko.utils.domNodeIsAttachedToDocument);
         },
 
-        tagNameLower: function(element) {
-            // For HTML elements, tagName will always be upper case; for XHTML elements, it'll be lower case.
-            // Possible future optimization: If we know it's an element from an XHTML document (not HTML),
-            // we don't need to do the .toLowerCase() as it will always be lower case anyway.
-            return element && element.tagName && element.tagName.toLowerCase();
-        },
+        tagNameLower: function(element) {},
 
         catchFunctionErrors: function (delegate) {

[Survived] ConditionalExpression
src/utils.js:353:20
             // For HTML elements, tagName will always be upper case; for XHTML elements, it'll be lower case.
             // Possible future optimization: If we know it's an element from an XHTML document (not HTML),
             // we don't need to do the .toLowerCase() as it will always be lower case anyway.
-            return element && element.tagName && element.tagName.toLowerCase();
+            return true;
         },
 

[Survived] ConditionalExpression
src/utils.js:353:20
             // For HTML elements, tagName will always be upper case; for XHTML elements, it'll be lower case.
             // Possible future optimization: If we know it's an element from an XHTML document (not HTML),
             // we don't need to do the .toLowerCase() as it will always be lower case anyway.
-            return element && element.tagName && element.tagName.toLowerCase();
+            return true && element.tagName.toLowerCase();
         },
 

[Survived] BlockStatement
src/utils.js:356:50
             return element && element.tagName && element.tagName.toLowerCase();
         },
 
-        catchFunctionErrors: function (delegate) {
-            return ko['onError'] ? function () {
-                try {
-                    return delegate.apply(this, arguments);
-                } catch (e) {
-                    ko['onError'] && ko['onError'](e);
-                    throw e;
-                }
-            } : delegate;
-        },
+        catchFunctionErrors: function (delegate) {},
 
         setTimeout: function (handler, timeout) {

[Survived] BlockStatement
src/utils.js:357:48
         },
 
         catchFunctionErrors: function (delegate) {
-            return ko['onError'] ? function () {
-                try {
-                    return delegate.apply(this, arguments);
-                } catch (e) {
-                    ko['onError'] && ko['onError'](e);
-                    throw e;
-                }
-            } : delegate;
+            return ko['onError'] ? function () {} : delegate;
         },
 
