[Survived] StringLiteral
src/utils.js:357:23
         },
 
         catchFunctionErrors: function (delegate) {
-            return ko['onError'] ? function () {
+            return ko[""] ? function () {
                 try {
                     return delegate.apply(this, arguments);

[Survived] BlockStatement
src/utils.js:358:21
 
         catchFunctionErrors: function (delegate) {
             return ko['onError'] ? function () {
-                try {
-                    return delegate.apply(this, arguments);
-                } catch (e) {
+                try {} catch (e) {
                     ko['onError'] && ko['onError'](e);
                     throw e;

[Survived] BlockStatement
src/utils.js:360:29
             return ko['onError'] ? function () {
                 try {
                     return delegate.apply(this, arguments);
-                } catch (e) {
-                    ko['onError'] && ko['onError'](e);
-                    throw e;
-                }
+                } catch (e) {}
             } : delegate;
         },

[Survived] ConditionalExpression
src/utils.js:361:21
                 try {
                     return delegate.apply(this, arguments);
                 } catch (e) {
-                    ko['onError'] && ko['onError'](e);
+                    false;
                     throw e;
                 }

[Survived] ConditionalExpression
src/utils.js:361:21
                 try {
                     return delegate.apply(this, arguments);
                 } catch (e) {
-                    ko['onError'] && ko['onError'](e);
+                    true;
                     throw e;
                 }

[Survived] BlockStatement
src/utils.js:367:49
             } : delegate;
         },
 
-        setTimeout: function (handler, timeout) {
-            return setTimeout(ko.utils.catchFunctionErrors(handler), timeout);
-        },
+        setTimeout: function (handler, timeout) {},
 
         deferError: function (error) {

[Survived] BlockStatement
src/utils.js:371:38
             return setTimeout(ko.utils.catchFunctionErrors(handler), timeout);
         },
 
-        deferError: function (error) {
-            setTimeout(function () {
-                ko['onError'] && ko['onError'](error);
-                throw error;
-            }, 0);
-        },
+        deferError: function (error) {},
 
         registerEventHandler: function (element, eventType, handler) {

[Survived] BlockStatement
src/utils.js:372:36
         },
 
         deferError: function (error) {
-            setTimeout(function () {
-                ko['onError'] && ko['onError'](error);
-                throw error;
-            }, 0);
+            setTimeout(function () {}, 0);
         },
 

[Survived] ConditionalExpression
src/utils.js:373:17
 
         deferError: function (error) {
             setTimeout(function () {
-                ko['onError'] && ko['onError'](error);
+                false;
                 throw error;
             }, 0);

[Survived] LogicalOperator
src/utils.js:373:17
 
         deferError: function (error) {
             setTimeout(function () {
-                ko['onError'] && ko['onError'](error);
+                ko['onError'] || ko['onError'](error);
                 throw error;
             }, 0);

[Survived] BlockStatement
src/utils.js:378:70
             }, 0);
         },
 
-        registerEventHandler: function (element, eventType, handler) {
-            var wrappedHandler = ko.utils.catchFunctionErrors(handler);
-
-            var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
-            if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
-                if (!jQueryEventAttachName) {
-                    jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
-                }
-                jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
-            } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
-                element.addEventListener(eventType, wrappedHandler, false);
-            else if (typeof element.attachEvent != "undefined") {
-                var attachEventHandler = function (event) { wrappedHandler.call(element, event); },
-                    attachEventName = "on" + eventType;
-                element.attachEvent(attachEventName, attachEventHandler);
-
-                // IE does not dispose attachEvent handlers automatically (unlike with addEventListener)
-                // so to avoid leaks, we have to remove them manually. See bug #856
-                ko.utils.domNodeDisposal.addDisposeCallback(element, function() {
-                    element.detachEvent(attachEventName, attachEventHandler);
-                });
-            }
-        },
+        registerEventHandler: function (element, eventType, handler) {},
 
         triggerEvent: function (element, eventType) {

[Survived] BlockStatement
src/utils.js:382:94
             var wrappedHandler = ko.utils.catchFunctionErrors(handler);
 
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
-            if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
-                if (!jQueryEventAttachName) {
-                    jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
-                }
-                jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
-            } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
+            if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {} else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
                 element.addEventListener(eventType, wrappedHandler, false);
             else if (typeof element.attachEvent != "undefined") {

[Survived] LogicalOperator
src/utils.js:382:17
             var wrappedHandler = ko.utils.catchFunctionErrors(handler);
 
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
-            if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
+            if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent || jQueryInstance) {
                 if (!jQueryEventAttachName) {
                     jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';

[Survived] ConditionalExpression
src/utils.js:383:21
 
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
             if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
-                if (!jQueryEventAttachName) {
+                if (false) {
                     jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
                 }

[Survived] BooleanLiteral
src/utils.js:383:21
 
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
             if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
-                if (!jQueryEventAttachName) {
+                if (jQueryEventAttachName) {
                     jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
                 }

[Killed] EqualityOperator
src/utils.js:384:46
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
             if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
                 if (!jQueryEventAttachName) {
-                    jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
+                    jQueryEventAttachName = (typeof jQueryInstance(element)['on'] != 'function') ? 'on' : 'bind';
                 }
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
killedBy: All tests
statusReason: > knockout@3.5.1-pre test
> node spec/runner.node.js


Running Knockout tests in Node.js

Throttled dependent observables

[Survived] ConditionalExpression
src/utils.js:384:46
             var mustUseAttachEvent = eventsThatMustBeRegisteredUsingAttachEvent[eventType];
             if (!ko.options['useOnlyNativeEvents'] && !mustUseAttachEvent && jQueryInstance) {
                 if (!jQueryEventAttachName) {
-                    jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
+                    jQueryEventAttachName = (false) ? 'on' : 'bind';
                 }
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);

[Timeout] ConditionalExpression
src/utils.js:387:24
                     jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
                 }
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
-            } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
+            } else if (true)
                 element.addEventListener(eventType, wrappedHandler, false);
             else if (typeof element.attachEvent != "undefined") {

[Timeout] EqualityOperator
src/utils.js:387:47
                     jQueryEventAttachName = (typeof jQueryInstance(element)['on'] == 'function') ? 'on' : 'bind';
                 }
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
-            } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
+            } else if (!mustUseAttachEvent && typeof element.addEventListener != "function")
                 element.addEventListener(eventType, wrappedHandler, false);
             else if (typeof element.attachEvent != "undefined") {

[Timeout] BooleanLiteral
src/utils.js:388:69
                 }
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
             } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
-                element.addEventListener(eventType, wrappedHandler, false);
+                element.addEventListener(eventType, wrappedHandler, true);
             else if (typeof element.attachEvent != "undefined") {
                 var attachEventHandler = function (event) { wrappedHandler.call(element, event); },

[Survived] BlockStatement
src/utils.js:389:65
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
             } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
                 element.addEventListener(eventType, wrappedHandler, false);
-            else if (typeof element.attachEvent != "undefined") {
-                var attachEventHandler = function (event) { wrappedHandler.call(element, event); },
-                    attachEventName = "on" + eventType;
-                element.attachEvent(attachEventName, attachEventHandler);
-
-                // IE does not dispose attachEvent handlers automatically (unlike with addEventListener)
-                // so to avoid leaks, we have to remove them manually. See bug #856
-                ko.utils.domNodeDisposal.addDisposeCallback(element, function() {
-                    element.detachEvent(attachEventName, attachEventHandler);
-                });
-            }
+            else if (typeof element.attachEvent != "undefined") {}
         },
 

[Survived] ConditionalExpression
src/utils.js:389:22
                 jQueryInstance(element)[jQueryEventAttachName](eventType, wrappedHandler);
             } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
                 element.addEventListener(eventType, wrappedHandler, false);
-            else if (typeof element.attachEvent != "undefined") {
+            else if (false) {
                 var attachEventHandler = function (event) { wrappedHandler.call(element, event); },
                     attachEventName = "on" + eventType;

[Survived] BlockStatement
src/utils.js:390:59
             } else if (!mustUseAttachEvent && typeof element.addEventListener == "function")
                 element.addEventListener(eventType, wrappedHandler, false);
             else if (typeof element.attachEvent != "undefined") {
-                var attachEventHandler = function (event) { wrappedHandler.call(element, event); },
+                var attachEventHandler = function (event) {},
                     attachEventName = "on" + eventType;
                 element.attachEvent(attachEventName, attachEventHandler);

[Survived] BlockStatement
src/utils.js:396:81
 
                 // IE does not dispose attachEvent handlers automatically (unlike with addEventListener)
                 // so to avoid leaks, we have to remove them manually. See bug #856
-                ko.utils.domNodeDisposal.addDisposeCallback(element, function() {
-                    element.detachEvent(attachEventName, attachEventHandler);
-                });
+                ko.utils.domNodeDisposal.addDisposeCallback(element, function() {});
             }
         },

[Survived] ConditionalExpression
src/utils.js:403:17
         },
 
         triggerEvent: function (element, eventType) {
-            if (!(element && element.nodeType))
+            if (false)
                 throw new Error("element must be a DOM node when calling triggerEvent");
 

[Survived] LogicalOperator
src/utils.js:403:19
         },
 
         triggerEvent: function (element, eventType) {
-            if (!(element && element.nodeType))
+            if (!(element || element.nodeType))
                 throw new Error("element must be a DOM node when calling triggerEvent");
 

[Survived] StringLiteral
src/utils.js:404:33
 
         triggerEvent: function (element, eventType) {
             if (!(element && element.nodeType))
-                throw new Error("element must be a DOM node when calling triggerEvent");
+                throw new Error("");
 
             // For click events on checkboxes and radio buttons, jQuery toggles the element checked state *after* the

[Survived] ConditionalExpression
src/utils.js:412:17
             // In both cases, we'll use the click method instead.
             var useClickWorkaround = isClickOnCheckableElement(element, eventType);
 
-            if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
+            if (false) {
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {

[Survived] ConditionalExpression
src/utils.js:412:17
             // In both cases, we'll use the click method instead.
             var useClickWorkaround = isClickOnCheckableElement(element, eventType);
 
-            if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
+            if (true) {
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {

[Survived] StringLiteral
src/utils.js:413:41
             var useClickWorkaround = isClickOnCheckableElement(element, eventType);
 
             if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
-                jQueryInstance(element)['trigger'](eventType);
+                jQueryInstance(element)[""](eventType);
             } else if (typeof document.createEvent == "function") {
                 if (typeof element.dispatchEvent == "function") {

[Survived] EqualityOperator
src/utils.js:414:24
 
             if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
                 jQueryInstance(element)['trigger'](eventType);
-            } else if (typeof document.createEvent == "function") {
+            } else if (typeof document.createEvent != "function") {
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";

[Survived] ConditionalExpression
src/utils.js:414:24
 
             if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
                 jQueryInstance(element)['trigger'](eventType);
-            } else if (typeof document.createEvent == "function") {
+            } else if (false) {
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";

[Survived] ConditionalExpression
src/utils.js:415:21
             if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {
-                if (typeof element.dispatchEvent == "function") {
+                if (true) {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);

[Survived] ConditionalExpression
src/utils.js:415:21
             if (!ko.options['useOnlyNativeEvents'] && jQueryInstance && !useClickWorkaround) {
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {
-                if (typeof element.dispatchEvent == "function") {
+                if (false) {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);

[Survived] ConditionalExpression
src/utils.js:416:41
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {
                 if (typeof element.dispatchEvent == "function") {
-                    var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
+                    var eventCategory = true;
                     var event = document.createEvent(eventCategory);
                     event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);

[Survived] ConditionalExpression
src/utils.js:416:41
                 jQueryInstance(element)['trigger'](eventType);
             } else if (typeof document.createEvent == "function") {
                 if (typeof element.dispatchEvent == "function") {
-                    var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
+                    var eventCategory = false;
                     var event = document.createEvent(eventCategory);
                     event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);

[Survived] BooleanLiteral
src/utils.js:418:48
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);
-                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);
+                    event.initEvent(eventType, false, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);
                     element.dispatchEvent(event);
                 }

[Survived] BooleanLiteral
src/utils.js:418:97
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);
-                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);
+                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, true, false, 0, element);
                     element.dispatchEvent(event);
                 }

[Survived] BlockStatement
src/utils.js:423:61
                 }
                 else
                     throw new Error("The supplied element doesn't support dispatchEvent");
-            } else if (useClickWorkaround && element.click) {
-                element.click();
-            } else if (typeof element.fireEvent != "undefined") {
+            } else if (useClickWorkaround && element.click) {} else if (typeof element.fireEvent != "undefined") {
                 element.fireEvent("on" + eventType);
             } else {

[Survived] ConditionalExpression
src/utils.js:423:24
                 }
                 else
                     throw new Error("The supplied element doesn't support dispatchEvent");
-            } else if (useClickWorkaround && element.click) {
+            } else if (true) {
                 element.click();
             } else if (typeof element.fireEvent != "undefined") {

[Survived] EqualityOperator
src/utils.js:425:24
                     throw new Error("The supplied element doesn't support dispatchEvent");
             } else if (useClickWorkaround && element.click) {
                 element.click();
-            } else if (typeof element.fireEvent != "undefined") {
+            } else if (typeof element.fireEvent == "undefined") {
                 element.fireEvent("on" + eventType);
             } else {

[Survived] ConditionalExpression
src/utils.js:425:24
                     throw new Error("The supplied element doesn't support dispatchEvent");
             } else if (useClickWorkaround && element.click) {
                 element.click();
-            } else if (typeof element.fireEvent != "undefined") {
+            } else if (false) {
                 element.fireEvent("on" + eventType);
             } else {

[Survived] BlockStatement
src/utils.js:427:20
                 element.click();
             } else if (typeof element.fireEvent != "undefined") {
                 element.fireEvent("on" + eventType);
-            } else {
-                throw new Error("Browser doesn't support triggering events");
-            }
+            } else {}
         },
 

[Survived] BlockStatement
src/utils.js:432:44
             }
         },
 
-        unwrapObservable: function (value) {
-            return ko.isObservable(value) ? value() : value;
-        },
+        unwrapObservable: function (value) {},
 
         peekObservable: function (value) {

[Survived] BlockStatement
src/utils.js:436:42
             return ko.isObservable(value) ? value() : value;
         },
 
-        peekObservable: function (value) {
-            return ko.isObservable(value) ? value.peek() : value;
-        },
+        peekObservable: function (value) {},
 
         toggleDomNodeCssClass: toggleDomNodeCssClass,

[Survived] BlockStatement
src/utils.js:442:56
 
         toggleDomNodeCssClass: toggleDomNodeCssClass,
 
-        setTextContent: function(element, textContent) {
-            var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
-                value = "";
-
-            // We need there to be exactly one child: a text node.
-            // If there are no children, more than one, or if it's not a text node,
-            // we'll clear everything and create a single text node.
-            var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
-                ko.virtualElements.setDomNodeChildren(element, [element.ownerDocument.createTextNode(value)]);
-            } else {
-                innerTextNode.data = value;
-            }
-
-            ko.utils.forceRefresh(element);
-        },
+        setTextContent: function(element, textContent) {},
 
         setElementName: function(element, name) {

[Survived] ConditionalExpression
src/utils.js:444:38
 
         setTextContent: function(element, textContent) {
             var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
+            if ((value === null) || (false))
                 value = "";
 

[Survived] EqualityOperator
src/utils.js:444:38
 
         setTextContent: function(element, textContent) {
             var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
+            if ((value === null) || (value !== undefined))
                 value = "";
 

[Survived] ConditionalExpression
src/utils.js:451:35
             // If there are no children, more than one, or if it's not a text node,
             // we'll clear everything and create a single text node.
             var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
+            if (!innerTextNode || false || ko.virtualElements.nextSibling(innerTextNode)) {
                 ko.virtualElements.setDomNodeChildren(element, [element.ownerDocument.createTextNode(value)]);
             } else {

[Survived] BlockStatement
src/utils.js:451:113
             // If there are no children, more than one, or if it's not a text node,
             // we'll clear everything and create a single text node.
             var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
-                ko.virtualElements.setDomNodeChildren(element, [element.ownerDocument.createTextNode(value)]);
-            } else {
+            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {} else {
                 innerTextNode.data = value;
             }

[Survived] BlockStatement
src/utils.js:453:20
             var innerTextNode = ko.virtualElements.firstChild(element);
             if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
                 ko.virtualElements.setDomNodeChildren(element, [element.ownerDocument.createTextNode(value)]);
-            } else {
-                innerTextNode.data = value;
-            }
+            } else {}
 
             ko.utils.forceRefresh(element);

[Survived] BlockStatement
src/utils.js:460:49
             ko.utils.forceRefresh(element);
         },
 
-        setElementName: function(element, name) {
-            element.name = name;
-
-            // Workaround IE 6/7 issue
-            // - https://github.com/SteveSanderson/knockout/issues/197
-            // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
-                try {
-                    var escapedName = element.name.replace(/[&<>'"]/g, function(r){ return "&#" + r.charCodeAt(0) + ";"; });
-                    element.mergeAttributes(document.createElement("<input name='" + escapedName + "'/>"), false);
-                }
-                catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"
-            }
-        },
+        setElementName: function(element, name) {},
 
         forceRefresh: function(node) {

[Survived] EqualityOperator
src/utils.js:466:17
             // Workaround IE 6/7 issue
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
+            if (ieVersion > 7) {
                 try {
                     var escapedName = element.name.replace(/[&<>'"]/g, function(r){ return "&#" + r.charCodeAt(0) + ";"; });

[Survived] ConditionalExpression
src/utils.js:466:17
             // Workaround IE 6/7 issue
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
+            if (true) {
                 try {
                     var escapedName = element.name.replace(/[&<>'"]/g, function(r){ return "&#" + r.charCodeAt(0) + ";"; });

[Survived] BlockStatement
src/utils.js:467:21
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
             if (ieVersion <= 7) {
-                try {
-                    var escapedName = element.name.replace(/[&<>'"]/g, function(r){ return "&#" + r.charCodeAt(0) + ";"; });
-                    element.mergeAttributes(document.createElement("<input name='" + escapedName + "'/>"), false);
-                }
+                try {}
                 catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"
             }

[Survived] BlockStatement
src/utils.js:468:83
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
             if (ieVersion <= 7) {
                 try {
-                    var escapedName = element.name.replace(/[&<>'"]/g, function(r){ return "&#" + r.charCodeAt(0) + ";"; });
+                    var escapedName = element.name.replace(/[&<>'"]/g, function(r){});
                     element.mergeAttributes(document.createElement("<input name='" + escapedName + "'/>"), false);
                 }
