[Survived] StringLiteral
src/utils.js:607:17
 ko.exportSymbol('utils.arrayRemoveItem', ko.utils.arrayRemoveItem);
 ko.exportSymbol('utils.cloneNodes', ko.utils.cloneNodes);
 ko.exportSymbol('utils.createSymbolOrString', ko.utils.createSymbolOrString);
-ko.exportSymbol('utils.extend', ko.utils.extend);
+ko.exportSymbol("", ko.utils.extend);
 ko.exportSymbol('utils.fieldsIncludedWithJsonPost', ko.utils.fieldsIncludedWithJsonPost);
 ko.exportSymbol('utils.getFormFields', ko.utils.getFormFields);

[Survived] StringLiteral
src/utils.js:614:17
 ko.exportSymbol('utils.peekObservable', ko.utils.peekObservable);
 ko.exportSymbol('utils.postJson', ko.utils.postJson);
 ko.exportSymbol('utils.parseJson', ko.utils.parseJson);
-ko.exportSymbol('utils.registerEventHandler', ko.utils.registerEventHandler);
+ko.exportSymbol("", ko.utils.registerEventHandler);
 ko.exportSymbol('utils.stringifyJson', ko.utils.stringifyJson);
 ko.exportSymbol('utils.range', ko.utils.range);

[Survived] StringLiteral
src/utils.js:616:17
 ko.exportSymbol('utils.parseJson', ko.utils.parseJson);
 ko.exportSymbol('utils.registerEventHandler', ko.utils.registerEventHandler);
 ko.exportSymbol('utils.stringifyJson', ko.utils.stringifyJson);
-ko.exportSymbol('utils.range', ko.utils.range);
+ko.exportSymbol("", ko.utils.range);
 ko.exportSymbol('utils.toggleDomNodeCssClass', ko.utils.toggleDomNodeCssClass);
 ko.exportSymbol('utils.triggerEvent', ko.utils.triggerEvent);

[Survived] StringLiteral
src/utils.js:618:17
 ko.exportSymbol('utils.stringifyJson', ko.utils.stringifyJson);
 ko.exportSymbol('utils.range', ko.utils.range);
 ko.exportSymbol('utils.toggleDomNodeCssClass', ko.utils.toggleDomNodeCssClass);
-ko.exportSymbol('utils.triggerEvent', ko.utils.triggerEvent);
+ko.exportSymbol("", ko.utils.triggerEvent);
 ko.exportSymbol('utils.unwrapObservable', ko.utils.unwrapObservable);
 ko.exportSymbol('utils.objectForEach', ko.utils.objectForEach);

[Survived] StringLiteral
src/utils.js:620:17
 ko.exportSymbol('utils.toggleDomNodeCssClass', ko.utils.toggleDomNodeCssClass);
 ko.exportSymbol('utils.triggerEvent', ko.utils.triggerEvent);
 ko.exportSymbol('utils.unwrapObservable', ko.utils.unwrapObservable);
-ko.exportSymbol('utils.objectForEach', ko.utils.objectForEach);
+ko.exportSymbol("", ko.utils.objectForEach);
 ko.exportSymbol('utils.addOrRemoveItem', ko.utils.addOrRemoveItem);
 ko.exportSymbol('utils.setTextContent', ko.utils.setTextContent);

[Survived] ConditionalExpression
src/utils.js:625:5
 ko.exportSymbol('utils.setTextContent', ko.utils.setTextContent);
 ko.exportSymbol('unwrap', ko.utils.unwrapObservable); // Convenient shorthand, because this is used so commonly
 
-if (!Function.prototype['bind']) {
+if (false) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js

[Survived] ConditionalExpression
src/utils.js:625:5
 ko.exportSymbol('utils.setTextContent', ko.utils.setTextContent);
 ko.exportSymbol('unwrap', ko.utils.unwrapObservable); // Convenient shorthand, because this is used so commonly
 
-if (!Function.prototype['bind']) {
+if (true) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js

[Survived] BlockStatement
src/utils.js:628:52
 if (!Function.prototype['bind']) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
-    Function.prototype['bind'] = function (object) {
-        var originalFunction = this;
-        if (arguments.length === 1) {
-            return function () {
-                return originalFunction.apply(object, arguments);
-            };
-        } else {
-            var partialArgs = Array.prototype.slice.call(arguments, 1);
-            return function () {
-                var args = partialArgs.slice(0);
-                args.push.apply(args, arguments);
-                return originalFunction.apply(object, args);
-            };
-        }
-    };
+    Function.prototype['bind'] = function (object) {};
 }
 

[Survived] StringLiteral
src/utils.js:628:24
 if (!Function.prototype['bind']) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
-    Function.prototype['bind'] = function (object) {
+    Function.prototype[""] = function (object) {
         var originalFunction = this;
         if (arguments.length === 1) {

[Survived] ConditionalExpression
src/utils.js:630:13
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
     Function.prototype['bind'] = function (object) {
         var originalFunction = this;
-        if (arguments.length === 1) {
+        if (false) {
             return function () {
                 return originalFunction.apply(object, arguments);

[Survived] EqualityOperator
src/utils.js:630:13
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
     Function.prototype['bind'] = function (object) {
         var originalFunction = this;
-        if (arguments.length === 1) {
+        if (arguments.length !== 1) {
             return function () {
                 return originalFunction.apply(object, arguments);

[Survived] BlockStatement
src/utils.js:631:32
     Function.prototype['bind'] = function (object) {
         var originalFunction = this;
         if (arguments.length === 1) {
-            return function () {
-                return originalFunction.apply(object, arguments);
-            };
+            return function () {};
         } else {
             var partialArgs = Array.prototype.slice.call(arguments, 1);

[Survived] BlockStatement
src/utils.js:634:16
             return function () {
                 return originalFunction.apply(object, arguments);
             };
-        } else {
-            var partialArgs = Array.prototype.slice.call(arguments, 1);
-            return function () {
-                var args = partialArgs.slice(0);
-                args.push.apply(args, arguments);
-                return originalFunction.apply(object, args);
-            };
-        }
+        } else {}
     };
 }

[Survived] BlockStatement
src/utils.js:636:32
             };
         } else {
             var partialArgs = Array.prototype.slice.call(arguments, 1);
-            return function () {
-                var args = partialArgs.slice(0);
-                args.push.apply(args, arguments);
-                return originalFunction.apply(object, args);
-            };
+            return function () {};
         }
     };

[Survived] MethodExpression
src/utils.js:637:28
         } else {
             var partialArgs = Array.prototype.slice.call(arguments, 1);
             return function () {
-                var args = partialArgs.slice(0);
+                var args = partialArgs;
                 args.push.apply(args, arguments);
                 return originalFunction.apply(object, args);
