[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:8:13
         var eventsToCatch = ["change"];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;
-        if (requestedEventsToCatch) {
+        if (true) {
             if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
                 requestedEventsToCatch = [requestedEventsToCatch];

[Survived] BlockStatement
src/binding/defaultBindings/value.js:8:37
         var eventsToCatch = ["change"];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;
-        if (requestedEventsToCatch) {
-            if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
-                requestedEventsToCatch = [requestedEventsToCatch];
-            ko.utils.arrayPushAll(eventsToCatch, requestedEventsToCatch);
-            eventsToCatch = ko.utils.arrayGetDistinctValues(eventsToCatch);
-        }
+        if (requestedEventsToCatch) {}
 
         var valueUpdateHandler = function() {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:9:17
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;
         if (requestedEventsToCatch) {
-            if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
+            if (true) // Allow both individual event names, and arrays of event names
                 requestedEventsToCatch = [requestedEventsToCatch];
             ko.utils.arrayPushAll(eventsToCatch, requestedEventsToCatch);

[Survived] BlockStatement
src/binding/defaultBindings/value.js:15:45
             eventsToCatch = ko.utils.arrayGetDistinctValues(eventsToCatch);
         }
 
-        var valueUpdateHandler = function() {
-            propertyChangedFired = false;
-            var modelValue = valueAccessor();
-            var elementValue = ko.selectExtensions.readValue(element);
-            ko.expressionRewriting.writeValueToProperty(modelValue, allBindings, 'value', elementValue);
-        }
+        var valueUpdateHandler = function() {}
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:16:36
         }
 
         var valueUpdateHandler = function() {
-            propertyChangedFired = false;
+            propertyChangedFired = true;
             var modelValue = valueAccessor();
             var elementValue = ko.selectExtensions.readValue(element);

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:24:106
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
+        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type != "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:24:62
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
+        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() != "input" && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:25:43
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete == "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:25:94
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete != "off" && (!element.form || false);
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:26:41
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
+        if (ieAutoCompleteHackNeeded && true) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "blur", function() {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:28:71
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
-            ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
-                    valueUpdateHandler();
-                }
-            });
+            ko.utils.registerEventHandler(element, "blur", function() {});
         }
 

[Survived] BlockStatement
src/binding/defaultBindings/value.js:35:66
             });
         }
 
-        ko.utils.arrayForEach(eventsToCatch, function(eventName) {
-            // The syntax "after<eventname>" means "run the handler asynchronously after the event"
-            // This is useful, for example, to catch "keydown" events after the browser has updated the control
-            // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
-            var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() { setTimeout(valueUpdateHandler, 0) };
-                eventName = eventName.substring("after".length);
-            }
-            ko.utils.registerEventHandler(element, eventName, handler);
-        });
+        ko.utils.arrayForEach(eventsToCatch, function(eventName) {});
     },
     'update': function (element, valueAccessor) {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:40:64
             // This is useful, for example, to catch "keydown" events after the browser has updated the control
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() { setTimeout(valueUpdateHandler, 0) };
-                eventName = eventName.substring("after".length);
-            }
+            if (ko.utils.stringStartsWith(eventName, "after")) {}
             ko.utils.registerEventHandler(element, eventName, handler);
         });

[Survived] BlockStatement
src/binding/defaultBindings/value.js:41:38
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
             if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() { setTimeout(valueUpdateHandler, 0) };
+                handler = function() {};
                 eventName = eventName.substring("after".length);
             }

[Survived] MethodExpression
src/binding/defaultBindings/value.js:42:29
             var handler = valueUpdateHandler;
             if (ko.utils.stringStartsWith(eventName, "after")) {
                 handler = function() { setTimeout(valueUpdateHandler, 0) };
-                eventName = eventName.substring("after".length);
+                eventName = eventName;
             }
             ko.utils.registerEventHandler(element, eventName, handler);

[Survived] BlockStatement
src/binding/defaultBindings/value.js:47:49
             ko.utils.registerEventHandler(element, eventName, handler);
         });
     },
-    'update': function (element, valueAccessor) {
-        var valueIsSelectOption = ko.utils.tagNameLower(element) === "select";
-        var newValue = ko.utils.unwrapObservable(valueAccessor());
-        var elementValue = ko.selectExtensions.readValue(element);
-        var valueHasChanged = (newValue !== elementValue);
-
-        if (valueHasChanged) {
-            var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
-            applyValueAction();
-
-            if (valueIsSelectOption) {
-                if (newValue !== ko.selectExtensions.readValue(element)) {
-                    // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                    // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                } else {
-                    // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                    // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                    // to apply the value as well.
-                    setTimeout(applyValueAction, 0);
-                }
-            }
-        }
-    }
+    'update': function (element, valueAccessor) {}
 };
 ko.expressionRewriting.twoWayBindings['value'] = true;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:48:35
         });
     },
     'update': function (element, valueAccessor) {
-        var valueIsSelectOption = ko.utils.tagNameLower(element) === "select";
+        var valueIsSelectOption = true;
         var newValue = ko.utils.unwrapObservable(valueAccessor());
         var elementValue = ko.selectExtensions.readValue(element);

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:48:35
         });
     },
     'update': function (element, valueAccessor) {
-        var valueIsSelectOption = ko.utils.tagNameLower(element) === "select";
+        var valueIsSelectOption = false;
         var newValue = ko.utils.unwrapObservable(valueAccessor());
         var elementValue = ko.selectExtensions.readValue(element);

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:51:32
         var valueIsSelectOption = ko.utils.tagNameLower(element) === "select";
         var newValue = ko.utils.unwrapObservable(valueAccessor());
         var elementValue = ko.selectExtensions.readValue(element);
-        var valueHasChanged = (newValue !== elementValue);
+        var valueHasChanged = (false);
 
         if (valueHasChanged) {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:51:32
         var valueIsSelectOption = ko.utils.tagNameLower(element) === "select";
         var newValue = ko.utils.unwrapObservable(valueAccessor());
         var elementValue = ko.selectExtensions.readValue(element);
-        var valueHasChanged = (newValue !== elementValue);
+        var valueHasChanged = (newValue === elementValue);
 
         if (valueHasChanged) {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:53:30
         var elementValue = ko.selectExtensions.readValue(element);
         var valueHasChanged = (newValue !== elementValue);
 
-        if (valueHasChanged) {
-            var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
-            applyValueAction();
-
-            if (valueIsSelectOption) {
-                if (newValue !== ko.selectExtensions.readValue(element)) {
-                    // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                    // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                } else {
-                    // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                    // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                    // to apply the value as well.
-                    setTimeout(applyValueAction, 0);
-                }
-            }
-        }
+        if (valueHasChanged) {}
     }
 };

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:53:13
         var elementValue = ko.selectExtensions.readValue(element);
         var valueHasChanged = (newValue !== elementValue);
 
-        if (valueHasChanged) {
+        if (true) {
             var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
             applyValueAction();

[Survived] BlockStatement
src/binding/defaultBindings/value.js:54:48
         var valueHasChanged = (newValue !== elementValue);
 
         if (valueHasChanged) {
-            var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
+            var applyValueAction = function () {};
             applyValueAction();
 

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:57:17
             var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
             applyValueAction();
 
-            if (valueIsSelectOption) {
+            if (false) {
                 if (newValue !== ko.selectExtensions.readValue(element)) {
                     // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,

[Survived] BlockStatement
src/binding/defaultBindings/value.js:57:38
             var applyValueAction = function () { ko.selectExtensions.writeValue(element, newValue); };
             applyValueAction();
 
-            if (valueIsSelectOption) {
-                if (newValue !== ko.selectExtensions.readValue(element)) {
-                    // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                    // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                } else {
-                    // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                    // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                    // to apply the value as well.
-                    setTimeout(applyValueAction, 0);
-                }
-            }
+            if (valueIsSelectOption) {}
         }
     }

[Survived] BlockStatement
src/binding/defaultBindings/value.js:58:74
             applyValueAction();
 
             if (valueIsSelectOption) {
-                if (newValue !== ko.selectExtensions.readValue(element)) {
-                    // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                    // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                } else {
+                if (newValue !== ko.selectExtensions.readValue(element)) {} else {
                     // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
                     // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:58:21
             applyValueAction();
 
             if (valueIsSelectOption) {
-                if (newValue !== ko.selectExtensions.readValue(element)) {
+                if (false) {
                     // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                     // because you're not allowed to have a model value that disagrees with a visible UI selection.

[Survived] StringLiteral
src/binding/defaultBindings/value.js:61:90
                 if (newValue !== ko.selectExtensions.readValue(element)) {
                     // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                     // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
+                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, ""]);
                 } else {
                     // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread

[Survived] BlockStatement
src/binding/defaultBindings/value.js:62:24
                     // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                     // because you're not allowed to have a model value that disagrees with a visible UI selection.
                     ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                } else {
-                    // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                    // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                    // to apply the value as well.
-                    setTimeout(applyValueAction, 0);
-                }
+                } else {}
             }
         }
