[Survived] BlockStatement
src/subscribables/dependencyDetection.js:6:36
     var _frames = [];
 
     return {
-        begin: function (callback) {
-            _frames.push(callback && { callback: callback, distinctDependencies:[] });
-        },
+        begin: function (callback) {},
 
         end: function () {

[Survived] ConditionalExpression
src/subscribables/dependencyDetection.js:7:26
 
     return {
         begin: function (callback) {
-            _frames.push(callback && { callback: callback, distinctDependencies:[] });
+            _frames.push(true);
         },
 

[Survived] LogicalOperator
src/subscribables/dependencyDetection.js:7:26
 
     return {
         begin: function (callback) {
-            _frames.push(callback && { callback: callback, distinctDependencies:[] });
+            _frames.push(callback || {
+  callback: callback,
+  distinctDependencies: []
+});
         },
 

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:10:26
             _frames.push(callback && { callback: callback, distinctDependencies:[] });
         },
 
-        end: function () {
-            _frames.pop();
-        },
+        end: function () {},
 
         registerDependency: function (subscribable) {

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:14:53
             _frames.pop();
         },
 
-        registerDependency: function (subscribable) {
-            if (!ko.isSubscribable(subscribable))
-                throw new Error("Only subscribable things can act as dependencies");
-            if (_frames.length > 0) {
-                var topFrame = _frames[_frames.length - 1];
-                if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)
-                    return;
-                topFrame.distinctDependencies.push(subscribable);
-                topFrame.callback(subscribable);
-            }
-        },
+        registerDependency: function (subscribable) {},
 
         ignore: function(callback, callbackTarget, callbackArgs) {

[Survived] ConditionalExpression
src/subscribables/dependencyDetection.js:15:17
         },
 
         registerDependency: function (subscribable) {
-            if (!ko.isSubscribable(subscribable))
+            if (false)
                 throw new Error("Only subscribable things can act as dependencies");
             if (_frames.length > 0) {

[Survived] BooleanLiteral
src/subscribables/dependencyDetection.js:15:17
         },
 
         registerDependency: function (subscribable) {
-            if (!ko.isSubscribable(subscribable))
+            if (ko.isSubscribable(subscribable))
                 throw new Error("Only subscribable things can act as dependencies");
             if (_frames.length > 0) {

[Survived] StringLiteral
src/subscribables/dependencyDetection.js:16:33
 
         registerDependency: function (subscribable) {
             if (!ko.isSubscribable(subscribable))
-                throw new Error("Only subscribable things can act as dependencies");
+                throw new Error("");
             if (_frames.length > 0) {
                 var topFrame = _frames[_frames.length - 1];

[Survived] EqualityOperator
src/subscribables/dependencyDetection.js:17:17
         registerDependency: function (subscribable) {
             if (!ko.isSubscribable(subscribable))
                 throw new Error("Only subscribable things can act as dependencies");
-            if (_frames.length > 0) {
+            if (_frames.length >= 0) {
                 var topFrame = _frames[_frames.length - 1];
                 if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)

[Survived] ConditionalExpression
src/subscribables/dependencyDetection.js:17:17
         registerDependency: function (subscribable) {
             if (!ko.isSubscribable(subscribable))
                 throw new Error("Only subscribable things can act as dependencies");
-            if (_frames.length > 0) {
+            if (false) {
                 var topFrame = _frames[_frames.length - 1];
                 if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)

[Survived] ArithmeticOperator
src/subscribables/dependencyDetection.js:18:40
             if (!ko.isSubscribable(subscribable))
                 throw new Error("Only subscribable things can act as dependencies");
             if (_frames.length > 0) {
-                var topFrame = _frames[_frames.length - 1];
+                var topFrame = _frames[_frames.length + 1];
                 if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)
                     return;

[Survived] LogicalOperator
src/subscribables/dependencyDetection.js:19:21
                 throw new Error("Only subscribable things can act as dependencies");
             if (_frames.length > 0) {
                 var topFrame = _frames[_frames.length - 1];
-                if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)
+                if (!topFrame && ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)
                     return;
                 topFrame.distinctDependencies.push(subscribable);

[Survived] EqualityOperator
src/subscribables/dependencyDetection.js:19:34
                 throw new Error("Only subscribable things can act as dependencies");
             if (_frames.length > 0) {
                 var topFrame = _frames[_frames.length - 1];
-                if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) >= 0)
+                if (!topFrame || ko.utils.arrayIndexOf(topFrame.distinctDependencies, subscribable) > 0)
                     return;
                 topFrame.distinctDependencies.push(subscribable);

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:26:66
             }
         },
 
-        ignore: function(callback, callbackTarget, callbackArgs) {
-            try {
-                _frames.push(null);
-                return callback.apply(callbackTarget, callbackArgs || []);
-            } finally {
-                _frames.pop();
-            }
-        }
+        ignore: function(callback, callbackTarget, callbackArgs) {}
     };
 })();

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:27:17
         },
 
         ignore: function(callback, callbackTarget, callbackArgs) {
-            try {
-                _frames.push(null);
-                return callback.apply(callbackTarget, callbackArgs || []);
-            } finally {
+            try {} finally {
                 _frames.pop();
             }

[Survived] ConditionalExpression
src/subscribables/dependencyDetection.js:29:55
         ignore: function(callback, callbackTarget, callbackArgs) {
             try {
                 _frames.push(null);
-                return callback.apply(callbackTarget, callbackArgs || []);
+                return callback.apply(callbackTarget, true);
             } finally {
                 _frames.pop();

[Survived] LogicalOperator
src/subscribables/dependencyDetection.js:29:55
         ignore: function(callback, callbackTarget, callbackArgs) {
             try {
                 _frames.push(null);
-                return callback.apply(callbackTarget, callbackArgs || []);
+                return callback.apply(callbackTarget, callbackArgs && []);
             } finally {
                 _frames.pop();

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:30:23
             try {
                 _frames.push(null);
                 return callback.apply(callbackTarget, callbackArgs || []);
-            } finally {
-                _frames.pop();
-            }
+            } finally {}
         }
     };
