[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:4:44
 var arrayChangeEventName = 'arrayChange';
 ko.extenders['trackArrayChanges'] = function(target) {
     // Only modify the target observable once
-    if (target.cacheDiffForKnownOperation) {
-        return;
-    }
+    if (target.cacheDiffForKnownOperation) {}
     var trackingChanges = false,
         cachedDiff = null,

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:13:88
         underlyingSubscribeFunction = target.subscribe;
 
     // Intercept "subscribe" calls, and for array change events, ensure change tracking is enabled
-    target.subscribe = target['subscribe'] = function(callback, callbackTarget, event) {
-        if (event === arrayChangeEventName) {
-            trackChanges();
-        }
-        return underlyingSubscribeFunction.apply(this, arguments);
-    };
+    target.subscribe = target['subscribe'] = function(callback, callbackTarget, event) {};
 
     function trackChanges() {

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:14:45
 
     // Intercept "subscribe" calls, and for array change events, ensure change tracking is enabled
     target.subscribe = target['subscribe'] = function(callback, callbackTarget, event) {
-        if (event === arrayChangeEventName) {
-            trackChanges();
-        }
+        if (event === arrayChangeEventName) {}
         return underlyingSubscribeFunction.apply(this, arguments);
     };

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:14:13
 
     // Intercept "subscribe" calls, and for array change events, ensure change tracking is enabled
     target.subscribe = target['subscribe'] = function(callback, callbackTarget, event) {
-        if (event === arrayChangeEventName) {
+        if (false) {
             trackChanges();
         }

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:22:13
 
     function trackChanges() {
         // Calling 'trackChanges' multiple times is the same as calling it once
-        if (trackingChanges) {
+        if (true) {
             return;
         }

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:22:30
 
     function trackChanges() {
         // Calling 'trackChanges' multiple times is the same as calling it once
-        if (trackingChanges) {
-            return;
-        }
+        if (trackingChanges) {}
 
         trackingChanges = true;

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:30:70
 
         // Intercept "notifySubscribers" to track how many times it was called.
         var underlyingNotifySubscribersFunction = target['notifySubscribers'];
-        target['notifySubscribers'] = function(valueToNotify, event) {
-            if (!event || event === defaultEvent) {
-                ++pendingNotifications;
-            }
-            return underlyingNotifySubscribersFunction.apply(this, arguments);
-        };
+        target['notifySubscribers'] = function(valueToNotify, event) {};
 
         // Each time the array changes value, capture a clone so that on the next

[Survived] EqualityOperator
src/subscribables/observableArray.changeTracking.js:31:27
         // Intercept "notifySubscribers" to track how many times it was called.
         var underlyingNotifySubscribersFunction = target['notifySubscribers'];
         target['notifySubscribers'] = function(valueToNotify, event) {
-            if (!event || event === defaultEvent) {
+            if (!event || event !== defaultEvent) {
                 ++pendingNotifications;
             }

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:39:42
 
         // Each time the array changes value, capture a clone so that on the next
         // change it's possible to produce a diff
-        var previousContents = [].concat(target.peek() || []);
+        var previousContents = [].concat(true);
         cachedDiff = null;
         target.subscribe(function(currentContents) {

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:39:42
 
         // Each time the array changes value, capture a clone so that on the next
         // change it's possible to produce a diff
-        var previousContents = [].concat(target.peek() || []);
+        var previousContents = [].concat(false);
         cachedDiff = null;
         target.subscribe(function(currentContents) {

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:41:52
         // change it's possible to produce a diff
         var previousContents = [].concat(target.peek() || []);
         cachedDiff = null;
-        target.subscribe(function(currentContents) {
-            // Make a copy of the current contents and ensure it's an array
-            currentContents = [].concat(currentContents || []);
-
-            // Compute the diff and issue notifications, but only if someone is listening
-            if (target.hasSubscriptionsForEvent(arrayChangeEventName)) {
-                var changes = getChanges(previousContents, currentContents);
-                if (changes.length) {
-                    target['notifySubscribers'](changes, arrayChangeEventName);
-                }
-            }
-
-            // Eliminate references to the old, removed items, so they can be GCed
-            previousContents = currentContents;
-            cachedDiff = null;
-            pendingNotifications = 0;
-        });
+        target.subscribe(function(currentContents) {});
     }
 

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:43:41
         cachedDiff = null;
         target.subscribe(function(currentContents) {
             // Make a copy of the current contents and ensure it's an array
-            currentContents = [].concat(currentContents || []);
+            currentContents = [].concat(true);
 
             // Compute the diff and issue notifications, but only if someone is listening

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:43:41
         cachedDiff = null;
         target.subscribe(function(currentContents) {
             // Make a copy of the current contents and ensure it's an array
-            currentContents = [].concat(currentContents || []);
+            currentContents = [].concat(false);
 
             // Compute the diff and issue notifications, but only if someone is listening

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:48:21
             // Compute the diff and issue notifications, but only if someone is listening
             if (target.hasSubscriptionsForEvent(arrayChangeEventName)) {
                 var changes = getChanges(previousContents, currentContents);
-                if (changes.length) {
+                if (false) {
                     target['notifySubscribers'](changes, arrayChangeEventName);
                 }

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:48:37
             // Compute the diff and issue notifications, but only if someone is listening
             if (target.hasSubscriptionsForEvent(arrayChangeEventName)) {
                 var changes = getChanges(previousContents, currentContents);
-                if (changes.length) {
-                    target['notifySubscribers'](changes, arrayChangeEventName);
-                }
+                if (changes.length) {}
             }
 

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:60:60
         });
     }
 
-    function getChanges(previousContents, currentContents) {
-        // We try to re-use cached diffs.
-        // The only scenario where pendingNotifications > 1 is when using the KO 'deferred updates' plugin,
-        // which without this check would not be compatible with arrayChange notifications. Without that
-        // plugin, notifications are always issued immediately so we wouldn't be queueing up more than one.
-        if (!cachedDiff || pendingNotifications > 1) {
-            cachedDiff = ko.utils.compareArrays(previousContents, currentContents, { 'sparse': true });
-        }
-
-        return cachedDiff;
-    }
+    function getChanges(previousContents, currentContents) {}
 
     target.cacheDiffForKnownOperation = function(rawArray, operationName, args) {

[Survived] LogicalOperator
src/subscribables/observableArray.changeTracking.js:65:13
         // The only scenario where pendingNotifications > 1 is when using the KO 'deferred updates' plugin,
         // which without this check would not be compatible with arrayChange notifications. Without that
         // plugin, notifications are always issued immediately so we wouldn't be queueing up more than one.
-        if (!cachedDiff || pendingNotifications > 1) {
+        if (!cachedDiff && pendingNotifications > 1) {
             cachedDiff = ko.utils.compareArrays(previousContents, currentContents, { 'sparse': true });
         }

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:65:13
         // The only scenario where pendingNotifications > 1 is when using the KO 'deferred updates' plugin,
         // which without this check would not be compatible with arrayChange notifications. Without that
         // plugin, notifications are always issued immediately so we wouldn't be queueing up more than one.
-        if (!cachedDiff || pendingNotifications > 1) {
+        if (true) {
             cachedDiff = ko.utils.compareArrays(previousContents, currentContents, { 'sparse': true });
         }

[Survived] BooleanLiteral
src/subscribables/observableArray.changeTracking.js:66:96
         // which without this check would not be compatible with arrayChange notifications. Without that
         // plugin, notifications are always issued immediately so we wouldn't be queueing up more than one.
         if (!cachedDiff || pendingNotifications > 1) {
-            cachedDiff = ko.utils.compareArrays(previousContents, currentContents, { 'sparse': true });
+            cachedDiff = ko.utils.compareArrays(previousContents, currentContents, { 'sparse': false });
         }
 

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:75:13
     target.cacheDiffForKnownOperation = function(rawArray, operationName, args) {
         // Only run if we're currently tracking changes for this observable array
         // and there aren't any pending deferred notifications.
-        if (!trackingChanges || pendingNotifications) {
+        if (false) {
             return;
         }

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:75:13
     target.cacheDiffForKnownOperation = function(rawArray, operationName, args) {
         // Only run if we're currently tracking changes for this observable array
         // and there aren't any pending deferred notifications.
-        if (!trackingChanges || pendingNotifications) {
+        if (true) {
             return;
         }

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:83:49
             argsLength = args.length,
             offset = 0;
 
-        function pushDiff(status, value, index) {
-            diff.push({ 'status': status, 'value': value, 'index': index });
-        }
+        function pushDiff(status, value, index) {}
         switch (operationName) {
             case 'push':

[Survived] ObjectLiteral
src/subscribables/observableArray.changeTracking.js:84:23
             offset = 0;
 
         function pushDiff(status, value, index) {
-            diff.push({ 'status': status, 'value': value, 'index': index });
+            diff.push({});
         }
         switch (operationName) {

[Survived] BlockStatement
src/subscribables/observableArray.changeTracking.js:98:34
             case 'pop':
                 offset = arrayLength - 1;
             case 'shift':
-                if (arrayLength) {
-                    pushDiff('deleted', rawArray[offset], offset);
-                }
+                if (arrayLength) {}
                 break;
 

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:103:13
                 }
                 break;
 
-            case 'splice':
-                // Negative start index means 'from end of array'. After that we clamp to [0...arrayLength].
-                // See https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice
-                var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
-                    endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
-                    endAddIndex = startIndex + argsLength - 2,
-                    endIndex = Math.max(endDeleteIndex, endAddIndex);
-                for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
-                    if (index < endDeleteIndex)
-                        pushDiff('deleted', rawArray[index], index);
-                    if (index < endAddIndex)
-                        pushDiff('added', args[argsIndex], index);
-                }
-                break;
+            case 'splice':
 
             default:

[Survived] ArithmeticOperator
src/subscribables/observableArray.changeTracking.js:106:69
             case 'splice':
                 // Negative start index means 'from end of array'. After that we clamp to [0...arrayLength].
                 // See https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice
-                var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
+                var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength - args[0] : args[0]), arrayLength),
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:107:38
                 // Negative start index means 'from end of array'. After that we clamp to [0...arrayLength].
                 // See https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice
                 var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
-                    endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
+                    endDeleteIndex = true ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex);

[Survived] ArithmeticOperator
src/subscribables/observableArray.changeTracking.js:107:80
                 // Negative start index means 'from end of array'. After that we clamp to [0...arrayLength].
                 // See https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/splice
                 var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
-                    endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
+                    endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex - (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex);

[Survived] MethodExpression
src/subscribables/observableArray.changeTracking.js:109:32
                 var startIndex = Math.min(Math.max(0, args[0] < 0 ? arrayLength + args[0] : args[0]), arrayLength),
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
-                    endIndex = Math.max(endDeleteIndex, endAddIndex);
+                    endIndex = Math.min(endDeleteIndex, endAddIndex);
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)

[Survived] UpdateOperator
src/subscribables/observableArray.changeTracking.js:110:79
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex);
-                for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
+                for (var index = startIndex, argsIndex = 2; index < endIndex; --index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         pushDiff('deleted', rawArray[index], index);

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:110:61
                     endDeleteIndex = argsLength === 1 ? arrayLength : Math.min(startIndex + (args[1] || 0), arrayLength),
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex);
-                for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
+                for (var index = startIndex, argsIndex = 2; false; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         pushDiff('deleted', rawArray[index], index);

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:111:25
                     endAddIndex = startIndex + argsLength - 2,
                     endIndex = Math.max(endDeleteIndex, endAddIndex);
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
-                    if (index < endDeleteIndex)
+                    if (false)
                         pushDiff('deleted', rawArray[index], index);
                     if (index < endAddIndex)

[Survived] ConditionalExpression
src/subscribables/observableArray.changeTracking.js:113:25
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         pushDiff('deleted', rawArray[index], index);
-                    if (index < endAddIndex)
+                    if (false)
                         pushDiff('added', args[argsIndex], index);
                 }

[Survived] EqualityOperator
src/subscribables/observableArray.changeTracking.js:113:25
                 for (var index = startIndex, argsIndex = 2; index < endIndex; ++index, ++argsIndex) {
                     if (index < endDeleteIndex)
                         pushDiff('deleted', rawArray[index], index);
-                    if (index < endAddIndex)
+                    if (index >= endAddIndex)
                         pushDiff('added', args[argsIndex], index);
                 }
