[Survived] BlockStatement
src/subscribables/observableArray.js:1:47
-ko.observableArray = function (initialValues) {
-    initialValues = initialValues || [];
-
-    if (typeof initialValues != 'object' || !('length' in initialValues))
-        throw new Error("The argument passed when initializing an observable array must be an array, or null, or undefined.");
-
-    var result = ko.observable(initialValues);
-    ko.utils.extend(result, ko.observableArray['fn']);
-    return result.extend({'trackArrayChanges':true});
-};
+ko.observableArray = function (initialValues) {};
 
 ko.observableArray['fn'] = {

[Survived] StringLiteral
src/subscribables/observableArray.js:8:48
         throw new Error("The argument passed when initializing an observable array must be an array, or null, or undefined.");
 
     var result = ko.observable(initialValues);
-    ko.utils.extend(result, ko.observableArray['fn']);
+    ko.utils.extend(result, ko.observableArray[""]);
     return result.extend({'trackArrayChanges':true});
 };

[Survived] BooleanLiteral
src/subscribables/observableArray.js:9:47
 
     var result = ko.observable(initialValues);
     ko.utils.extend(result, ko.observableArray['fn']);
-    return result.extend({'trackArrayChanges':true});
+    return result.extend({'trackArrayChanges':false});
 };
 

[Survived] BlockStatement
src/subscribables/observableArray.js:13:43
 };
 
 ko.observableArray['fn'] = {
-    'remove': function (valueOrPredicate) {
-        var underlyingArray = this.peek();
-        var removedValues = [];
-        var predicate = typeof valueOrPredicate == "function" && !ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
-        for (var i = 0; i < underlyingArray.length; i++) {
-            var value = underlyingArray[i];
-            if (predicate(value)) {
-                if (removedValues.length === 0) {
-                    this.valueWillMutate();
-                }
-                removedValues.push(value);
-                underlyingArray.splice(i, 1);
-                i--;
-            }
-        }
-        if (removedValues.length) {
-            this.valueHasMutated();
-        }
-        return removedValues;
-    },
+    'remove': function (valueOrPredicate) {},
 
     'removeAll': function (arrayOfValues) {

[Survived] BlockStatement
src/subscribables/observableArray.js:28:35
                 i--;
             }
         }
-        if (removedValues.length) {
-            this.valueHasMutated();
-        }
+        if (removedValues.length) {}
         return removedValues;
     },

[Survived] ConditionalExpression
src/subscribables/observableArray.js:36:13
 
     'removeAll': function (arrayOfValues) {
         // If you passed zero args, we remove everything
-        if (arrayOfValues === undefined) {
+        if (true) {
             var underlyingArray = this.peek();
             var allValues = underlyingArray.slice(0);

[Survived] ConditionalExpression
src/subscribables/observableArray.js:48:20
         if (!arrayOfValues)
             return [];
         return this['remove'](function (value) {
-            return ko.utils.arrayIndexOf(arrayOfValues, value) >= 0;
+            return false;
         });
     },

[Survived] BlockStatement
src/subscribables/observableArray.js:52:44
         });
     },
 
-    'destroy': function (valueOrPredicate) {
-        var underlyingArray = this.peek();
-        var predicate = typeof valueOrPredicate == "function" && !ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
-        this.valueWillMutate();
-        for (var i = underlyingArray.length - 1; i >= 0; i--) {
-            var value = underlyingArray[i];
-            if (predicate(value))
-                underlyingArray[i]["_destroy"] = true;
-        }
-        this.valueHasMutated();
-    },
+    'destroy': function (valueOrPredicate) {},
 
     'destroyAll': function (arrayOfValues) {

[Survived] BooleanLiteral
src/subscribables/observableArray.js:54:66
 
     'destroy': function (valueOrPredicate) {
         var underlyingArray = this.peek();
-        var predicate = typeof valueOrPredicate == "function" && !ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
+        var predicate = typeof valueOrPredicate == "function" && ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
         this.valueWillMutate();
         for (var i = underlyingArray.length - 1; i >= 0; i--) {

[Survived] ConditionalExpression
src/subscribables/observableArray.js:54:25
 
     'destroy': function (valueOrPredicate) {
         var underlyingArray = this.peek();
-        var predicate = typeof valueOrPredicate == "function" && !ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
+        var predicate = false ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
         this.valueWillMutate();
         for (var i = underlyingArray.length - 1; i >= 0; i--) {

[Survived] ConditionalExpression
src/subscribables/observableArray.js:56:50
         var underlyingArray = this.peek();
         var predicate = typeof valueOrPredicate == "function" && !ko.isObservable(valueOrPredicate) ? valueOrPredicate : function (value) { return value === valueOrPredicate; };
         this.valueWillMutate();
-        for (var i = underlyingArray.length - 1; i >= 0; i--) {
+        for (var i = underlyingArray.length - 1; false; i--) {
             var value = underlyingArray[i];
             if (predicate(value))

[Survived] BooleanLiteral
src/subscribables/observableArray.js:59:50
         for (var i = underlyingArray.length - 1; i >= 0; i--) {
             var value = underlyingArray[i];
             if (predicate(value))
-                underlyingArray[i]["_destroy"] = true;
+                underlyingArray[i]["_destroy"] = false;
         }
         this.valueHasMutated();

[Survived] StringLiteral
src/subscribables/observableArray.js:59:36
         for (var i = underlyingArray.length - 1; i >= 0; i--) {
             var value = underlyingArray[i];
             if (predicate(value))
-                underlyingArray[i]["_destroy"] = true;
+                underlyingArray[i][""] = true;
         }
         this.valueHasMutated();

[Survived] ConditionalExpression
src/subscribables/observableArray.js:73:20
         if (!arrayOfValues)
             return [];
         return this['destroy'](function (value) {
-            return ko.utils.arrayIndexOf(arrayOfValues, value) >= 0;
+            return true;
         });
     },

[Survived] BlockStatement
src/subscribables/observableArray.js:82:43
         return ko.utils.arrayIndexOf(underlyingArray, item);
     },
 
-    'replace': function(oldItem, newItem) {
-        var index = this['indexOf'](oldItem);
-        if (index >= 0) {
-            this.valueWillMutate();
-            this.peek()[index] = newItem;
-            this.valueHasMutated();
-        }
-    }
+    'replace': function(oldItem, newItem) {}
 };
 

[Survived] StringLiteral
src/subscribables/observableArray.js:83:26
     },
 
     'replace': function(oldItem, newItem) {
-        var index = this['indexOf'](oldItem);
+        var index = this[""](oldItem);
         if (index >= 0) {
             this.valueWillMutate();

[Survived] BlockStatement
src/subscribables/observableArray.js:84:25
 
     'replace': function(oldItem, newItem) {
         var index = this['indexOf'](oldItem);
-        if (index >= 0) {
-            this.valueWillMutate();
-            this.peek()[index] = newItem;
-            this.valueHasMutated();
-        }
+        if (index >= 0) {}
     }
 };

[Survived] EqualityOperator
src/subscribables/observableArray.js:84:13
 
     'replace': function(oldItem, newItem) {
         var index = this['indexOf'](oldItem);
-        if (index >= 0) {
+        if (index > 0) {
             this.valueWillMutate();
             this.peek()[index] = newItem;

[Survived] BlockStatement
src/subscribables/observableArray.js:95:111
 // Populate ko.observableArray.fn with read/write functions from native arrays
 // Important: Do not add any additional functions here that may reasonably be used to *read* data from the array
 // because we'll eval them without causing subscriptions, so ko.computed output could end up getting stale
-ko.utils.arrayForEach(["pop", "push", "reverse", "shift", "sort", "splice", "unshift"], function (methodName) {
-    ko.observableArray['fn'][methodName] = function () {
-        // Use "peek" to avoid creating a subscription in any computed that we're executing in the context of
-        // (for consistency with mutating regular observables)
-        var underlyingArray = this.peek();
-        this.valueWillMutate();
-        this.cacheDiffForKnownOperation(underlyingArray, methodName, arguments);
-        var methodCallResult = underlyingArray[methodName].apply(underlyingArray, arguments);
-        this.valueHasMutated();
-        return methodCallResult;
-    };
-});
+ko.utils.arrayForEach(["pop", "push", "reverse", "shift", "sort", "splice", "unshift"], function (methodName) {});
 
 // Populate ko.observableArray.fn with read-only functions from native arrays

[Survived] StringLiteral
src/subscribables/observableArray.js:95:24
 // Populate ko.observableArray.fn with read/write functions from native arrays
 // Important: Do not add any additional functions here that may reasonably be used to *read* data from the array
 // because we'll eval them without causing subscriptions, so ko.computed output could end up getting stale
-ko.utils.arrayForEach(["pop", "push", "reverse", "shift", "sort", "splice", "unshift"], function (methodName) {
+ko.utils.arrayForEach(["", "push", "reverse", "shift", "sort", "splice", "unshift"], function (methodName) {
     ko.observableArray['fn'][methodName] = function () {
         // Use "peek" to avoid creating a subscription in any computed that we're executing in the context of

[Survived] BlockStatement
src/subscribables/observableArray.js:96:56
 // Important: Do not add any additional functions here that may reasonably be used to *read* data from the array
 // because we'll eval them without causing subscriptions, so ko.computed output could end up getting stale
 ko.utils.arrayForEach(["pop", "push", "reverse", "shift", "sort", "splice", "unshift"], function (methodName) {
-    ko.observableArray['fn'][methodName] = function () {
-        // Use "peek" to avoid creating a subscription in any computed that we're executing in the context of
-        // (for consistency with mutating regular observables)
-        var underlyingArray = this.peek();
-        this.valueWillMutate();
-        this.cacheDiffForKnownOperation(underlyingArray, methodName, arguments);
-        var methodCallResult = underlyingArray[methodName].apply(underlyingArray, arguments);
-        this.valueHasMutated();
-        return methodCallResult;
-    };
+    ko.observableArray['fn'][methodName] = function () {};
 });
 
