[Survived] BlockStatement
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:7:70
         // doesn't expose a version number, so we have to infer it.
         // Note that as of Knockout 1.3, we only support jQuery.tmpl 1.0.0pre and later,
         // which KO internally refers to as version "2", so older versions are no longer detected.
-        var jQueryTmplVersion = this.jQueryTmplVersion = (function() {
-            if ((typeof(jQuery) == "undefined") || !(jQuery['tmpl']))
-                return 0;
-            // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.
-            try {
-                if (jQuery['tmpl']['tag']['tmpl']['open'].toString().indexOf('__') >= 0) {
-                    // Since 1.0.0pre, custom tags should append markup to an array called "__"
-                    return 2; // Final version of jquery.tmpl
-                }
-            } catch(ex) { /* Apparently not the version we were looking for */ }
-
-            return 1; // Any older version that we don't support
-        })();
+        var jQueryTmplVersion = this.jQueryTmplVersion = (function() {})();
 
         function ensureHasReferencedJQueryTemplates() {

[Survived] EqualityOperator
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:8:18
         // Note that as of Knockout 1.3, we only support jQuery.tmpl 1.0.0pre and later,
         // which KO internally refers to as version "2", so older versions are no longer detected.
         var jQueryTmplVersion = this.jQueryTmplVersion = (function() {
-            if ((typeof(jQuery) == "undefined") || !(jQuery['tmpl']))
+            if ((typeof jQuery != "undefined") || !(jQuery['tmpl']))
                 return 0;
             // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.

[Survived] ConditionalExpression
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:8:17
         // Note that as of Knockout 1.3, we only support jQuery.tmpl 1.0.0pre and later,
         // which KO internally refers to as version "2", so older versions are no longer detected.
         var jQueryTmplVersion = this.jQueryTmplVersion = (function() {
-            if ((typeof(jQuery) == "undefined") || !(jQuery['tmpl']))
+            if (false)
                 return 0;
             // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.

[Survived] BlockStatement
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:11:17
             if ((typeof(jQuery) == "undefined") || !(jQuery['tmpl']))
                 return 0;
             // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.
-            try {
-                if (jQuery['tmpl']['tag']['tmpl']['open'].toString().indexOf('__') >= 0) {
-                    // Since 1.0.0pre, custom tags should append markup to an array called "__"
-                    return 2; // Final version of jquery.tmpl
-                }
-            } catch(ex) { /* Apparently not the version we were looking for */ }
+            try {} catch(ex) { /* Apparently not the version we were looking for */ }
 
             return 1; // Any older version that we don't support

[Survived] EqualityOperator
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:12:21
                 return 0;
             // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.
             try {
-                if (jQuery['tmpl']['tag']['tmpl']['open'].toString().indexOf('__') >= 0) {
+                if (jQuery['tmpl']['tag']['tmpl']['open'].toString().indexOf('__') < 0) {
                     // Since 1.0.0pre, custom tags should append markup to an array called "__"
                     return 2; // Final version of jquery.tmpl

[Survived] ConditionalExpression
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:12:21
                 return 0;
             // Since it exposes no official version number, we use our own numbering system. To be updated as jquery-tmpl evolves.
             try {
-                if (jQuery['tmpl']['tag']['tmpl']['open'].toString().indexOf('__') >= 0) {
+                if (true) {
                     // Since 1.0.0pre, custom tags should append markup to an array called "__"
                     return 2; // Final version of jquery.tmpl

[Survived] BlockStatement
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:26:81
                 throw new Error("Your version of jQuery.tmpl is too old. Please upgrade to jQuery.tmpl 1.0.0pre or later.");
         }
 
-        function executeTemplate(compiledTemplate, data, jQueryTemplateOptions) {
-            return jQuery['tmpl'](compiledTemplate, data, jQueryTemplateOptions);
-        }
+        function executeTemplate(compiledTemplate, data, jQueryTemplateOptions) {}
 
         this['renderTemplateSource'] = function(templateSource, bindingContext, options) {

[Survived] BlockStatement
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:30:90
             return jQuery['tmpl'](compiledTemplate, data, jQueryTemplateOptions);
         }
 
-        this['renderTemplateSource'] = function(templateSource, bindingContext, options) {
-            options = options || {};
-            ensureHasReferencedJQueryTemplates();
-
-            // Ensure we have stored a precompiled version of this template (don't want to reparse on every render)
-            var precompiled = templateSource['data']('precompiled');
-            if (!precompiled) {
-                var templateText = templateSource['text']() || "";
-                // Wrap in "with($whatever.koBindingContext) { ... }"
-                templateText = "{{ko_with $item.koBindingContext}}" + templateText + "{{/ko_with}}";
-
-                precompiled = jQuery['template'](null, templateText);
-                templateSource['data']('precompiled', precompiled);
-            }
-
-            var data = [bindingContext['$data']]; // Prewrap the data in an array to stop jquery.tmpl from trying to unwrap any arrays
-            var jQueryTemplateOptions = jQuery['extend']({ 'koBindingContext': bindingContext }, options['templateOptions']);
-
-            var resultNodes = executeTemplate(precompiled, data, jQueryTemplateOptions);
-            resultNodes['appendTo'](document.createElement("div")); // Using "appendTo" forces jQuery/jQuery.tmpl to perform necessary cleanup work
-
-            jQuery['fragments'] = {}; // Clear jQuery's fragment cache to avoid a memory leak after a large number of template renders
-            return resultNodes;
-        };
+        this['renderTemplateSource'] = function(templateSource, bindingContext, options) {};
 
         this['createJavaScriptEvaluatorBlock'] = function(script) {

[Survived] LogicalOperator
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:31:23
         }
 
         this['renderTemplateSource'] = function(templateSource, bindingContext, options) {
-            options = options || {};
+            options = options && {};
             ensureHasReferencedJQueryTemplates();
 

[Survived] ConditionalExpression
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:31:23
         }
 
         this['renderTemplateSource'] = function(templateSource, bindingContext, options) {
-            options = options || {};
+            options = false;
             ensureHasReferencedJQueryTemplates();
 

[Survived] BlockStatement
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:36:31
 
             // Ensure we have stored a precompiled version of this template (don't want to reparse on every render)
             var precompiled = templateSource['data']('precompiled');
-            if (!precompiled) {
-                var templateText = templateSource['text']() || "";
-                // Wrap in "with($whatever.koBindingContext) { ... }"
-                templateText = "{{ko_with $item.koBindingContext}}" + templateText + "{{/ko_with}}";
-
-                precompiled = jQuery['template'](null, templateText);
-                templateSource['data']('precompiled', precompiled);
-            }
+            if (!precompiled) {}
 
             var data = [bindingContext['$data']]; // Prewrap the data in an array to stop jquery.tmpl from trying to unwrap any arrays

[Survived] StringLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:39:32
             if (!precompiled) {
                 var templateText = templateSource['text']() || "";
                 // Wrap in "with($whatever.koBindingContext) { ... }"
-                templateText = "{{ko_with $item.koBindingContext}}" + templateText + "{{/ko_with}}";
+                templateText = "" + templateText + "{{/ko_with}}";
 
                 precompiled = jQuery['template'](null, templateText);

[Survived] ObjectLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:46:58
             }
 
             var data = [bindingContext['$data']]; // Prewrap the data in an array to stop jquery.tmpl from trying to unwrap any arrays
-            var jQueryTemplateOptions = jQuery['extend']({ 'koBindingContext': bindingContext }, options['templateOptions']);
+            var jQueryTemplateOptions = jQuery['extend']({}, options['templateOptions']);
 
             var resultNodes = executeTemplate(precompiled, data, jQueryTemplateOptions);

[Survived] StringLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:51:20
             var resultNodes = executeTemplate(precompiled, data, jQueryTemplateOptions);
             resultNodes['appendTo'](document.createElement("div")); // Using "appendTo" forces jQuery/jQuery.tmpl to perform necessary cleanup work
 
-            jQuery['fragments'] = {}; // Clear jQuery's fragment cache to avoid a memory leak after a large number of template renders
+            jQuery[""] = {}; // Clear jQuery's fragment cache to avoid a memory leak after a large number of template renders
             return resultNodes;
         };

[Survived] StringLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:59:14
             return "{{ko_code ((function() { return " + script + " })()) }}";
         };
 
-        this['addTemplate'] = function(templateName, templateMarkup) {
+        this[""] = function(templateName, templateMarkup) {
             document.write("<script type='text/html' id='" + templateName + "'>" + templateMarkup + "<" + "/script>");
         };

[Survived] StringLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:60:77
         };
 
         this['addTemplate'] = function(templateName, templateMarkup) {
-            document.write("<script type='text/html' id='" + templateName + "'>" + templateMarkup + "<" + "/script>");
+            document.write("<script type='text/html' id='" + templateName + "" + templateMarkup + "<" + "/script>");
         };
 

[Survived] ConditionalExpression
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:63:13
             document.write("<script type='text/html' id='" + templateName + "'>" + templateMarkup + "<" + "/script>");
         };
 
-        if (jQueryTmplVersion > 0) {
+        if (true) {
             jQuery['tmpl']['tag']['ko_code'] = {
                 open: "__.push($1 || '');"

[Survived] EqualityOperator
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:63:13
             document.write("<script type='text/html' id='" + templateName + "'>" + templateMarkup + "<" + "/script>");
         };
 
-        if (jQueryTmplVersion > 0) {
+        if (jQueryTmplVersion >= 0) {
             jQuery['tmpl']['tag']['ko_code'] = {
                 open: "__.push($1 || '');"

[Survived] StringLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:64:28
         };
 
         if (jQueryTmplVersion > 0) {
-            jQuery['tmpl']['tag']['ko_code'] = {
+            jQuery['tmpl'][""]['ko_code'] = {
                 open: "__.push($1 || '');"
             };

[Survived] ObjectLiteral
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:67:48
             jQuery['tmpl']['tag']['ko_code'] = {
                 open: "__.push($1 || '');"
             };
-            jQuery['tmpl']['tag']['ko_with'] = {
-                open: "with($1) {",
-                close: "} "
-            };
+            jQuery['tmpl']['tag']['ko_with'] = {};
         }
     };

[Survived] ConditionalExpression
src/templating/jquery.tmpl/jqueryTmplTemplateEngine.js:79:9
 
     // Use this one by default *only if jquery.tmpl is referenced*
     var jqueryTmplTemplateEngineInstance = new ko.jqueryTmplTemplateEngine();
-    if (jqueryTmplTemplateEngineInstance.jQueryTmplVersion > 0)
+    if (true)
         ko.setTemplateEngine(jqueryTmplTemplateEngineInstance);
 
