[Survived] BlockStatement
src/templating/templateEngine.js:29:106
 
 ko.templateEngine = function () { };
 
-ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options) {
-    throw new Error("Override renderTemplateSource");
-};
+ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options) {};
 
 ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {

[Survived] StringLiteral
src/templating/templateEngine.js:30:21
 ko.templateEngine = function () { };
 
 ko.templateEngine.prototype['renderTemplateSource'] = function (templateSource, bindingContext, options) {
-    throw new Error("Override renderTemplateSource");
+    throw new Error("");
 };
 

[Survived] StringLiteral
src/templating/templateEngine.js:34:21
 };
 
 ko.templateEngine.prototype['createJavaScriptEvaluatorBlock'] = function (script) {
-    throw new Error("Override createJavaScriptEvaluatorBlock");
+    throw new Error("");
 };
 

[Survived] EqualityOperator
src/templating/templateEngine.js:39:9
 
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
-    if (typeof template == "string") {
+    if (typeof template != "string") {
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);

[Survived] ConditionalExpression
src/templating/templateEngine.js:40:28
 ko.templateEngine.prototype['makeTemplateSource'] = function(template, templateDocument) {
     // Named template
     if (typeof template == "string") {
-        templateDocument = templateDocument || document;
+        templateDocument = false;
         var elem = templateDocument.getElementById(template);
         if (!elem)

[Survived] ConditionalExpression
src/templating/templateEngine.js:42:13
     if (typeof template == "string") {
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);
-        if (!elem)
+        if (true)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);

[Survived] StringLiteral
src/templating/templateEngine.js:43:29
         templateDocument = templateDocument || document;
         var elem = templateDocument.getElementById(template);
         if (!elem)
-            throw new Error("Cannot find template with ID " + template);
+            throw new Error("" + template);
         return new ko.templateSources.domElement(elem);
     } else if ((template.nodeType == 1) || (template.nodeType == 8)) {

[Survived] ConditionalExpression
src/templating/templateEngine.js:45:16
         if (!elem)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
+    } else if (false) {
         // Anonymous template
         return new ko.templateSources.anonymousTemplate(template);

[Survived] BlockStatement
src/templating/templateEngine.js:45:70
         if (!elem)
             throw new Error("Cannot find template with ID " + template);
         return new ko.templateSources.domElement(elem);
-    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {
-        // Anonymous template
-        return new ko.templateSources.anonymousTemplate(template);
-    } else
+    } else if ((template.nodeType == 1) || (template.nodeType == 8)) {} else
         throw new Error("Unknown template type: " + template);
 };

[Survived] BlockStatement
src/templating/templateEngine.js:52:112
         throw new Error("Unknown template type: " + template);
 };
 
-ko.templateEngine.prototype['renderTemplate'] = function (template, bindingContext, options, templateDocument) {
-    var templateSource = this['makeTemplateSource'](template, templateDocument);
-    return this['renderTemplateSource'](templateSource, bindingContext, options);
-};
+ko.templateEngine.prototype['renderTemplate'] = function (template, bindingContext, options, templateDocument) {};
 
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {

[Survived] StringLiteral
src/templating/templateEngine.js:57:29
     return this['renderTemplateSource'](templateSource, bindingContext, options);
 };
 
-ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
+ko.templateEngine.prototype[""] = function (template, templateDocument) {
     // Skip rewriting if requested
     if (this['allowTemplateRewriting'] === false)

[Survived] ConditionalExpression
src/templating/templateEngine.js:59:9
 
 ko.templateEngine.prototype['isTemplateRewritten'] = function (template, templateDocument) {
     // Skip rewriting if requested
-    if (this['allowTemplateRewriting'] === false)
+    if (false)
         return true;
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");

[Survived] StringLiteral
src/templating/templateEngine.js:64:29
     return this['makeTemplateSource'](template, templateDocument)['data']("isRewritten");
 };
 
-ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {
+ko.templateEngine.prototype[""] = function (template, rewriterCallback, templateDocument) {
     var templateSource = this['makeTemplateSource'](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());

[Survived] StringLiteral
src/templating/templateEngine.js:65:31
 };
 
 ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {
-    var templateSource = this['makeTemplateSource'](template, templateDocument);
+    var templateSource = this[""](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());
     templateSource['text'](rewritten);

[Survived] StringLiteral
src/templating/templateEngine.js:66:53
 
 ko.templateEngine.prototype['rewriteTemplate'] = function (template, rewriterCallback, templateDocument) {
     var templateSource = this['makeTemplateSource'](template, templateDocument);
-    var rewritten = rewriterCallback(templateSource['text']());
+    var rewritten = rewriterCallback(templateSource[""]());
     templateSource['text'](rewritten);
     templateSource['data']("isRewritten", true);

[Survived] StringLiteral
src/templating/templateEngine.js:68:20
     var templateSource = this['makeTemplateSource'](template, templateDocument);
     var rewritten = rewriterCallback(templateSource['text']());
     templateSource['text'](rewritten);
-    templateSource['data']("isRewritten", true);
+    templateSource[""]("isRewritten", true);
 };
 
