[Survived] BlockStatement
src/templating/templateSources.js:30:55
 
     // ---- ko.templateSources.domElement -----
 
-    ko.templateSources.domElement = function(element) {
-        this.domElement = element;
-    }
+    ko.templateSources.domElement = function(element) {}
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {

[Survived] BlockStatement
src/templating/templateSources.js:34:84
         this.domElement = element;
     }
 
-    ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
-        var tagNameLower = ko.utils.tagNameLower(this.domElement),
-            elemContentsProperty = tagNameLower === "script" ? "text"
-                                 : tagNameLower === "textarea" ? "value"
-                                 : "innerHTML";
-
-        if (arguments.length == 0) {
-            return this.domElement[elemContentsProperty];
-        } else {
-            var valueToWrite = arguments[0];
-            if (elemContentsProperty === "innerHTML")
-                ko.utils.setHtml(this.domElement, valueToWrite);
-            else
-                this.domElement[elemContentsProperty] = valueToWrite;
-        }
-    };
+    ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {};
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";

[Survived] StringLiteral
src/templating/templateSources.js:34:45
         this.domElement = element;
     }
 
-    ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
+    ko.templateSources.domElement.prototype[""] = function(/* valueToWrite */) {
         var tagNameLower = ko.utils.tagNameLower(this.domElement),
             elemContentsProperty = tagNameLower === "script" ? "text"

[Survived] EqualityOperator
src/templating/templateSources.js:36:36
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var tagNameLower = ko.utils.tagNameLower(this.domElement),
-            elemContentsProperty = tagNameLower === "script" ? "text"
+            elemContentsProperty = tagNameLower !== "script" ? "text"
                                  : tagNameLower === "textarea" ? "value"
                                  : "innerHTML";

[Survived] ConditionalExpression
src/templating/templateSources.js:36:36
 
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var tagNameLower = ko.utils.tagNameLower(this.domElement),
-            elemContentsProperty = tagNameLower === "script" ? "text"
+            elemContentsProperty = true ? "text"
                                  : tagNameLower === "textarea" ? "value"
                                  : "innerHTML";

[Survived] ConditionalExpression
src/templating/templateSources.js:37:36
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var tagNameLower = ko.utils.tagNameLower(this.domElement),
             elemContentsProperty = tagNameLower === "script" ? "text"
-                                 : tagNameLower === "textarea" ? "value"
+                                 : true ? "value"
                                  : "innerHTML";
 

[Survived] EqualityOperator
src/templating/templateSources.js:37:36
     ko.templateSources.domElement.prototype['text'] = function(/* valueToWrite */) {
         var tagNameLower = ko.utils.tagNameLower(this.domElement),
             elemContentsProperty = tagNameLower === "script" ? "text"
-                                 : tagNameLower === "textarea" ? "value"
+                                 : tagNameLower !== "textarea" ? "value"
                                  : "innerHTML";
 

[Survived] ConditionalExpression
src/templating/templateSources.js:40:13
                                  : tagNameLower === "textarea" ? "value"
                                  : "innerHTML";
 
-        if (arguments.length == 0) {
+        if (false) {
             return this.domElement[elemContentsProperty];
         } else {

[Survived] ConditionalExpression
src/templating/templateSources.js:53:13
 
     var dataDomDataPrefix = ko.utils.domData.nextKey() + "_";
     ko.templateSources.domElement.prototype['data'] = function(key /*, valueToWrite */) {
-        if (arguments.length === 1) {
+        if (true) {
             return ko.utils.domData.get(this.domElement, dataDomDataPrefix + key);
         } else {

[Survived] BlockStatement
src/templating/templateSources.js:66:62
     // Writing to "text" is still supported, but then the template data will not be available as DOM nodes.
 
     var anonymousTemplatesDomDataKey = ko.utils.domData.nextKey();
-    ko.templateSources.anonymousTemplate = function(element) {
-        this.domElement = element;
-    }
+    ko.templateSources.anonymousTemplate = function(element) {}
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;

[Survived] BlockStatement
src/templating/templateSources.js:71:91
     }
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
-    ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
-            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
-            if (templateData.textData === undefined && templateData.containerData)
-                templateData.textData = templateData.containerData.innerHTML;
-            return templateData.textData;
-        } else {
-            var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {textData: valueToWrite});
-        }
-    };
+    ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {};
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {

[Survived] StringLiteral
src/templating/templateSources.js:71:52
     }
     ko.templateSources.anonymousTemplate.prototype = new ko.templateSources.domElement();
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
-    ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
+    ko.templateSources.anonymousTemplate.prototype[""] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};

[Survived] LogicalOperator
src/templating/templateSources.js:73:32
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
-            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
+            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) && {};
             if (templateData.textData === undefined && templateData.containerData)
                 templateData.textData = templateData.containerData.innerHTML;

[Survived] ConditionalExpression
src/templating/templateSources.js:73:32
     ko.templateSources.anonymousTemplate.prototype.constructor = ko.templateSources.anonymousTemplate;
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
-            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
+            var templateData = true;
             if (templateData.textData === undefined && templateData.containerData)
                 templateData.textData = templateData.containerData.innerHTML;

[Survived] ConditionalExpression
src/templating/templateSources.js:74:17
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
-            if (templateData.textData === undefined && templateData.containerData)
+            if (false)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;

[Survived] ConditionalExpression
src/templating/templateSources.js:74:17
     ko.templateSources.anonymousTemplate.prototype['text'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
-            if (templateData.textData === undefined && templateData.containerData)
+            if (true)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;

[Survived] BlockStatement
src/templating/templateSources.js:77:16
             if (templateData.textData === undefined && templateData.containerData)
                 templateData.textData = templateData.containerData.innerHTML;
             return templateData.textData;
-        } else {
-            var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {textData: valueToWrite});
-        }
+        } else {}
     };
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {

[Survived] ObjectLiteral
src/templating/templateSources.js:79:81
             return templateData.textData;
         } else {
             var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {textData: valueToWrite});
+            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {});
         }
     };

[Survived] BlockStatement
src/templating/templateSources.js:82:85
             ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {textData: valueToWrite});
         }
     };
-    ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
-            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
-            return templateData.containerData;
-        } else {
-            var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {containerData: valueToWrite});
-        }
-    };
+    ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {};
 
     ko.exportSymbol('templateSources', ko.templateSources);

[Survived] EqualityOperator
src/templating/templateSources.js:83:13
         }
     };
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
+        if (arguments.length != 0) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
             return templateData.containerData;

[Survived] ConditionalExpression
src/templating/templateSources.js:83:13
         }
     };
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
-        if (arguments.length == 0) {
+        if (true) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
             return templateData.containerData;

[Survived] ConditionalExpression
src/templating/templateSources.js:84:32
     };
     ko.templateSources.domElement.prototype['nodes'] = function(/* valueToWrite */) {
         if (arguments.length == 0) {
-            var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
+            var templateData = false;
             return templateData.containerData;
         } else {

[Survived] BlockStatement
src/templating/templateSources.js:86:16
         if (arguments.length == 0) {
             var templateData = ko.utils.domData.get(this.domElement, anonymousTemplatesDomDataKey) || {};
             return templateData.containerData;
-        } else {
-            var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {containerData: valueToWrite});
-        }
+        } else {}
     };
 

[Survived] ObjectLiteral
src/templating/templateSources.js:88:81
             return templateData.containerData;
         } else {
             var valueToWrite = arguments[0];
-            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {containerData: valueToWrite});
+            ko.utils.domData.set(this.domElement, anonymousTemplatesDomDataKey, {});
         }
     };

[Survived] StringLiteral
src/templating/templateSources.js:94:21
 
     ko.exportSymbol('templateSources', ko.templateSources);
     ko.exportSymbol('templateSources.domElement', ko.templateSources.domElement);
-    ko.exportSymbol('templateSources.anonymousTemplate', ko.templateSources.anonymousTemplate);
+    ko.exportSymbol("", ko.templateSources.anonymousTemplate);
 })();
 
