[Survived] ConditionalExpression
src/utils.js:336:17
             if (!(element && element.nodeType))
                 throw new Error("element must be a DOM node when calling triggerEvent");
 
-            if (typeof jQuery != "undefined") {
+            if (true) {
                 var eventData = [];
                 if (isClickOnCheckableElement(element, eventType)) {

[Survived] ConditionalExpression
src/utils.js:336:17
             if (!(element && element.nodeType))
                 throw new Error("element must be a DOM node when calling triggerEvent");
 
-            if (typeof jQuery != "undefined") {
+            if (false) {
                 var eventData = [];
                 if (isClickOnCheckableElement(element, eventType)) {

[Survived] ArrayDeclaration
src/utils.js:337:33
                 throw new Error("element must be a DOM node when calling triggerEvent");
 
             if (typeof jQuery != "undefined") {
-                var eventData = [];
+                var eventData = ["Stryker was here"];
                 if (isClickOnCheckableElement(element, eventType)) {
                     // Work around the jQuery "click events on checkboxes" issue described above by storing the original checked state before triggering the handler

[Survived] ConditionalExpression
src/utils.js:338:21
 
             if (typeof jQuery != "undefined") {
                 var eventData = [];
-                if (isClickOnCheckableElement(element, eventType)) {
+                if (true) {
                     // Work around the jQuery "click events on checkboxes" issue described above by storing the original checked state before triggering the handler
                     eventData.push({ checkedStateBeforeEvent: element.checked });

[Survived] BlockStatement
src/utils.js:338:68
 
             if (typeof jQuery != "undefined") {
                 var eventData = [];
-                if (isClickOnCheckableElement(element, eventType)) {
-                    // Work around the jQuery "click events on checkboxes" issue described above by storing the original checked state before triggering the handler
-                    eventData.push({ checkedStateBeforeEvent: element.checked });
-                }
+                if (isClickOnCheckableElement(element, eventType)) {}
                 jQuery(element)['trigger'](eventType, eventData);
             } else if (typeof document.createEvent == "function") {

[Survived] ConditionalExpression
src/utils.js:343:24
                     eventData.push({ checkedStateBeforeEvent: element.checked });
                 }
                 jQuery(element)['trigger'](eventType, eventData);
-            } else if (typeof document.createEvent == "function") {
+            } else if (false) {
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";

[Survived] EqualityOperator
src/utils.js:343:24
                     eventData.push({ checkedStateBeforeEvent: element.checked });
                 }
                 jQuery(element)['trigger'](eventType, eventData);
-            } else if (typeof document.createEvent == "function") {
+            } else if (typeof document.createEvent != "function") {
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";

[Survived] BooleanLiteral
src/utils.js:347:104
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);
-                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);
+                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, true, 0, element);
                     element.dispatchEvent(event);
                 }

[Survived] BooleanLiteral
src/utils.js:347:83
                 if (typeof element.dispatchEvent == "function") {
                     var eventCategory = knownEventTypesByEventName[eventType] || "HTMLEvents";
                     var event = document.createEvent(eventCategory);
-                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, false, false, false, false, 0, element);
+                    event.initEvent(eventType, true, true, window, 0, 0, 0, 0, 0, true, false, false, false, 0, element);
                     element.dispatchEvent(event);
                 }

[Survived] ConditionalExpression
src/utils.js:352:24
                 }
                 else
                     throw new Error("The supplied element doesn't support dispatchEvent");
-            } else if (typeof element.fireEvent != "undefined") {
+            } else if (true) {
                 // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
                 // so to make it consistent, we'll do it manually here

[Survived] BlockStatement
src/utils.js:352:65
                 }
                 else
                     throw new Error("The supplied element doesn't support dispatchEvent");
-            } else if (typeof element.fireEvent != "undefined") {
-                // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
-                // so to make it consistent, we'll do it manually here
-                if (isClickOnCheckableElement(element, eventType))
-                    element.checked = element.checked !== true;
-                element.fireEvent("on" + eventType);
-            }
+            } else if (typeof element.fireEvent != "undefined") {}
             else
                 throw new Error("Browser doesn't support triggering events");

[Survived] ConditionalExpression
src/utils.js:355:21
             } else if (typeof element.fireEvent != "undefined") {
                 // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
                 // so to make it consistent, we'll do it manually here
-                if (isClickOnCheckableElement(element, eventType))
+                if (false)
                     element.checked = element.checked !== true;
                 element.fireEvent("on" + eventType);

[Survived] ConditionalExpression
src/utils.js:355:21
             } else if (typeof element.fireEvent != "undefined") {
                 // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
                 // so to make it consistent, we'll do it manually here
-                if (isClickOnCheckableElement(element, eventType))
+                if (true)
                     element.checked = element.checked !== true;
                 element.fireEvent("on" + eventType);

[Survived] ConditionalExpression
src/utils.js:356:39
                 // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
                 // so to make it consistent, we'll do it manually here
                 if (isClickOnCheckableElement(element, eventType))
-                    element.checked = element.checked !== true;
+                    element.checked = true;
                 element.fireEvent("on" + eventType);
             }

[Survived] BooleanLiteral
src/utils.js:356:59
                 // Unlike other browsers, IE doesn't change the checked state of checkboxes/radiobuttons when you trigger their "click" event
                 // so to make it consistent, we'll do it manually here
                 if (isClickOnCheckableElement(element, eventType))
-                    element.checked = element.checked !== true;
+                    element.checked = element.checked !== false;
                 element.fireEvent("on" + eventType);
             }

[Survived] BlockStatement
src/utils.js:371:77
             return ko.isObservable(value) ? value.peek() : value;
         },
 
-        toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
-            if (classNames) {
-                var cssClassNameRegex = /\S+/g,
-                    currentClassNames = node.className.match(cssClassNameRegex) || [];
-                ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {
-                    ko.utils.addOrRemoveItem(currentClassNames, className, shouldHaveClass);
-                });
-                node.className = currentClassNames.join(" ");
-            }
-        },
+        toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {},
 
         setTextContent: function(element, textContent) {

[Survived] ConditionalExpression
src/utils.js:372:17
         },
 
         toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
-            if (classNames) {
+            if (false) {
                 var cssClassNameRegex = /\S+/g,
                     currentClassNames = node.className.match(cssClassNameRegex) || [];

[Survived] BlockStatement
src/utils.js:372:29
         },
 
         toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
-            if (classNames) {
-                var cssClassNameRegex = /\S+/g,
-                    currentClassNames = node.className.match(cssClassNameRegex) || [];
-                ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {
-                    ko.utils.addOrRemoveItem(currentClassNames, className, shouldHaveClass);
-                });
-                node.className = currentClassNames.join(" ");
-            }
+            if (classNames) {}
         },
 

[Survived] Regex
src/utils.js:373:41
 
         toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
             if (classNames) {
-                var cssClassNameRegex = /\S+/g,
+                var cssClassNameRegex = /\s+/g,
                     currentClassNames = node.className.match(cssClassNameRegex) || [];
                 ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {

[Survived] ConditionalExpression
src/utils.js:374:41
         toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
             if (classNames) {
                 var cssClassNameRegex = /\S+/g,
-                    currentClassNames = node.className.match(cssClassNameRegex) || [];
+                    currentClassNames = true;
                 ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {
                     ko.utils.addOrRemoveItem(currentClassNames, className, shouldHaveClass);

[Survived] ConditionalExpression
src/utils.js:374:41
         toggleDomNodeCssClass: function (node, classNames, shouldHaveClass) {
             if (classNames) {
                 var cssClassNameRegex = /\S+/g,
-                    currentClassNames = node.className.match(cssClassNameRegex) || [];
+                    currentClassNames = false;
                 ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {
                     ko.utils.addOrRemoveItem(currentClassNames, className, shouldHaveClass);

[Survived] BlockStatement
src/utils.js:375:96
             if (classNames) {
                 var cssClassNameRegex = /\S+/g,
                     currentClassNames = node.className.match(cssClassNameRegex) || [];
-                ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {
-                    ko.utils.addOrRemoveItem(currentClassNames, className, shouldHaveClass);
-                });
+                ko.utils.arrayForEach(classNames.match(cssClassNameRegex), function(className) {});
                 node.className = currentClassNames.join(" ");
             }

[Survived] BlockStatement
src/utils.js:382:56
             }
         },
 
-        setTextContent: function(element, textContent) {
-            var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
-                value = "";
-
-            // We need there to be exactly one child: a text node.
-            // If there are no children, more than one, or if it's not a text node,
-            // we'll clear everything and create a single text node.
-            var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
-                ko.virtualElements.setDomNodeChildren(element, [document.createTextNode(value)]);
-            } else {
-                innerTextNode.data = value;
-            }
-
-            ko.utils.forceRefresh(element);
-        },
+        setTextContent: function(element, textContent) {},
 
         setElementName: function(element, name) {

[Survived] ConditionalExpression
src/utils.js:384:18
 
         setTextContent: function(element, textContent) {
             var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
+            if ((false) || (value === undefined))
                 value = "";
 

[Survived] ConditionalExpression
src/utils.js:384:17
 
         setTextContent: function(element, textContent) {
             var value = ko.utils.unwrapObservable(textContent);
-            if ((value === null) || (value === undefined))
+            if (false)
                 value = "";
 

[Survived] LogicalOperator
src/utils.js:391:17
             // If there are no children, more than one, or if it's not a text node,
             // we'll clear everything and create a single text node.
             var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
+            if (!innerTextNode && innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
                 ko.virtualElements.setDomNodeChildren(element, [document.createTextNode(value)]);
             } else {

[Survived] ConditionalExpression
src/utils.js:391:17
             // If there are no children, more than one, or if it's not a text node,
             // we'll clear everything and create a single text node.
             var innerTextNode = ko.virtualElements.firstChild(element);
-            if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
+            if (true) {
                 ko.virtualElements.setDomNodeChildren(element, [document.createTextNode(value)]);
             } else {

[Survived] BlockStatement
src/utils.js:393:20
             var innerTextNode = ko.virtualElements.firstChild(element);
             if (!innerTextNode || innerTextNode.nodeType != 3 || ko.virtualElements.nextSibling(innerTextNode)) {
                 ko.virtualElements.setDomNodeChildren(element, [document.createTextNode(value)]);
-            } else {
-                innerTextNode.data = value;
-            }
+            } else {}
 
             ko.utils.forceRefresh(element);

[Survived] BlockStatement
src/utils.js:400:49
             ko.utils.forceRefresh(element);
         },
 
-        setElementName: function(element, name) {
-            element.name = name;
-
-            // Workaround IE 6/7 issue
-            // - https://github.com/SteveSanderson/knockout/issues/197
-            // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
-                try {
-                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);
-                }
-                catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"
-            }
-        },
+        setElementName: function(element, name) {},
 
         forceRefresh: function(node) {

[Survived] EqualityOperator
src/utils.js:406:17
             // Workaround IE 6/7 issue
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
+            if (ieVersion < 7) {
                 try {
                     element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);

[Survived] BlockStatement
src/utils.js:406:33
             // Workaround IE 6/7 issue
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
-            if (ieVersion <= 7) {
-                try {
-                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);
-                }
-                catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"
-            }
+            if (ieVersion <= 7) {}
         },
 

[Survived] BlockStatement
src/utils.js:407:21
             // - https://github.com/SteveSanderson/knockout/issues/197
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
             if (ieVersion <= 7) {
-                try {
-                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);
-                }
+                try {}
                 catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"
             }

[Survived] BooleanLiteral
src/utils.js:408:109
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
             if (ieVersion <= 7) {
                 try {
-                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);
+                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), true);
                 }
                 catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"

[Survived] StringLiteral
src/utils.js:408:68
             // - http://www.matts411.com/post/setting_the_name_attribute_in_ie_dom/
             if (ieVersion <= 7) {
                 try {
-                    element.mergeAttributes(document.createElement("<input name='" + element.name + "'/>"), false);
+                    element.mergeAttributes(document.createElement("" + element.name + "'/>"), false);
                 }
                 catch(e) {} // For IE9 with doc mode "IE9 Standards" and browser mode "IE9 Compatibility View"

[Survived] UpdateOperator
src/utils.js:446:64
 
         makeArray: function(arrayLikeObject) {
             var result = [];
-            for (var i = 0, j = arrayLikeObject.length; i < j; i++) {
+            for (var i = 0, j = arrayLikeObject.length; i < j; i--) {
                 result.push(arrayLikeObject[i]);
             };

[Survived] StringLiteral
src/utils.js:457:71
         ieVersion : ieVersion,
 
         getFormFields: function(form, fieldName) {
-            var fields = ko.utils.makeArray(form.getElementsByTagName("input")).concat(ko.utils.makeArray(form.getElementsByTagName("textarea")));
+            var fields = ko.utils.makeArray(form.getElementsByTagName("")).concat(ko.utils.makeArray(form.getElementsByTagName("textarea")));
             var isMatchingField = (typeof fieldName == 'string')
                 ? function(field) { return field.name === fieldName }

[Survived] EqualityOperator
src/utils.js:462:45
                 ? function(field) { return field.name === fieldName }
                 : function(field) { return fieldName.test(field.name) }; // Treat fieldName as regex or object containing predicate
             var matches = [];
-            for (var i = fields.length - 1; i >= 0; i--) {
+            for (var i = fields.length - 1; i > 0; i--) {
                 if (isMatchingField(fields[i]))
                     matches.push(fields[i]);

[Survived] BooleanLiteral
src/utils.js:482:26
         },
 
         stringifyJson: function (data, replacer, space) {   // replacer and space are optional
-            if (!JSON || !JSON.stringify)
+            if (!JSON || JSON.stringify)
             return JSON.stringify(ko.utils.unwrapObservable(data), replacer, space);

[Survived] LogicalOperator
src/utils.js:488:23
         },
 
         postJson: function (urlOrForm, data, options) {
-            options = options || {};
+            options = options && {};
             var params = options['params'] || {};
             var includeFields = options['includeFields'] || this.fieldsIncludedWithJsonPost;

[Survived] BlockStatement
src/utils.js:494:97
             var url = urlOrForm;
 
             // If we were given a form, use its 'action' URL and pick out any requested field values
-            if((typeof urlOrForm == 'object') && (ko.utils.tagNameLower(urlOrForm) === "form")) {
-                var originalForm = urlOrForm;
-                url = originalForm.action;
-                for (var i = includeFields.length - 1; i >= 0; i--) {
-                    var fields = ko.utils.getFormFields(originalForm, includeFields[i]);
-                    for (var j = fields.length - 1; j >= 0; j--)
-                        params[fields[j].name] = fields[j].value;
-                }
-            }
+            if((typeof urlOrForm == 'object') && (ko.utils.tagNameLower(urlOrForm) === "form")) {}
 
             data = ko.utils.unwrapObservable(data);

[Survived] ConditionalExpression
src/utils.js:497:56
             if((typeof urlOrForm == 'object') && (ko.utils.tagNameLower(urlOrForm) === "form")) {
                 var originalForm = urlOrForm;
                 url = originalForm.action;
-                for (var i = includeFields.length - 1; i >= 0; i--) {
+                for (var i = includeFields.length - 1; false; i--) {
                     var fields = ko.utils.getFormFields(originalForm, includeFields[i]);
                     for (var j = fields.length - 1; j >= 0; j--)

[Survived] ArithmeticOperator
src/utils.js:499:34
                 url = originalForm.action;
                 for (var i = includeFields.length - 1; i >= 0; i--) {
                     var fields = ko.utils.getFormFields(originalForm, includeFields[i]);
-                    for (var j = fields.length - 1; j >= 0; j--)
+                    for (var j = fields.length + 1; j >= 0; j--)
                         params[fields[j].name] = fields[j].value;
                 }

[Survived] BlockStatement
src/utils.js:509:35
             form.style.display = "none";
             form.action = url;
             form.method = "post";
-            for (var key in data) {
-                // Since 'data' this is a model object, we include all properties including those inherited from its prototype
-                var input = document.createElement("input");
-                input.name = key;
-                input.value = ko.utils.stringifyJson(ko.utils.unwrapObservable(data[key]));
-                form.appendChild(input);
-            }
+            for (var key in data) {}
             objectForEach(params, function(key, value) {
                 var input = document.createElement("input");

[Survived] BlockStatement
src/utils.js:516:56
                 input.value = ko.utils.stringifyJson(ko.utils.unwrapObservable(data[key]));
                 form.appendChild(input);
             }
-            objectForEach(params, function(key, value) {
-                var input = document.createElement("input");
-                input.name = key;
-                input.value = value;
-                form.appendChild(input);
-            });
+            objectForEach(params, function(key, value) {});
             document.body.appendChild(form);
             options['submitter'] ? options['submitter'](form) : form.submit();

[Survived] StringLiteral
src/utils.js:537:17
 ko.exportSymbol('utils.arrayIndexOf', ko.utils.arrayIndexOf);
 ko.exportSymbol('utils.arrayMap', ko.utils.arrayMap);
 ko.exportSymbol('utils.arrayPushAll', ko.utils.arrayPushAll);
-ko.exportSymbol('utils.arrayRemoveItem', ko.utils.arrayRemoveItem);
+ko.exportSymbol("", ko.utils.arrayRemoveItem);
 ko.exportSymbol('utils.extend', ko.utils.extend);
 ko.exportSymbol('utils.fieldsIncludedWithJsonPost', ko.utils.fieldsIncludedWithJsonPost);

[Survived] StringLiteral
src/utils.js:540:17
 ko.exportSymbol('utils.arrayRemoveItem', ko.utils.arrayRemoveItem);
 ko.exportSymbol('utils.extend', ko.utils.extend);
 ko.exportSymbol('utils.fieldsIncludedWithJsonPost', ko.utils.fieldsIncludedWithJsonPost);
-ko.exportSymbol('utils.getFormFields', ko.utils.getFormFields);
+ko.exportSymbol("", ko.utils.getFormFields);
 ko.exportSymbol('utils.peekObservable', ko.utils.peekObservable);
 ko.exportSymbol('utils.postJson', ko.utils.postJson);

[Survived] StringLiteral
src/utils.js:551:17
 ko.exportSymbol('utils.triggerEvent', ko.utils.triggerEvent);
 ko.exportSymbol('utils.unwrapObservable', ko.utils.unwrapObservable);
 ko.exportSymbol('utils.objectForEach', ko.utils.objectForEach);
-ko.exportSymbol('utils.addOrRemoveItem', ko.utils.addOrRemoveItem);
+ko.exportSymbol("", ko.utils.addOrRemoveItem);
 ko.exportSymbol('unwrap', ko.utils.unwrapObservable); // Convenient shorthand, because this is used so commonly
 

[Survived] BooleanLiteral
src/utils.js:554:5
 ko.exportSymbol('utils.addOrRemoveItem', ko.utils.addOrRemoveItem);
 ko.exportSymbol('unwrap', ko.utils.unwrapObservable); // Convenient shorthand, because this is used so commonly
 
-if (!Function.prototype['bind']) {
+if (Function.prototype['bind']) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js

[Survived] BlockStatement
src/utils.js:557:52
 if (!Function.prototype['bind']) {
     // Function.prototype.bind is a standard part of ECMAScript 5th Edition (December 2009, http://www.ecma-international.org/publications/files/ECMA-ST/ECMA-262.pdf)
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
-    Function.prototype['bind'] = function (object) {
-        var originalFunction = this, args = Array.prototype.slice.call(arguments), object = args.shift();
-        return function () {
-            return originalFunction.apply(object, args.concat(Array.prototype.slice.call(arguments)));
-        };
-    };
+    Function.prototype['bind'] = function (object) {};
 }
 

[Survived] BlockStatement
src/utils.js:559:28
     // In case the browser doesn't implement it natively, provide a JavaScript implementation. This implementation is based on the one in prototype.js
     Function.prototype['bind'] = function (object) {
         var originalFunction = this, args = Array.prototype.slice.call(arguments), object = args.shift();
-        return function () {
-            return originalFunction.apply(object, args.concat(Array.prototype.slice.call(arguments)));
-        };
+        return function () {};
     };
 }
