[Survived] BlockStatement
src/virtualElements.js:27:64
         return (node.nodeType == 8) && endCommentRegex.test(commentNodesHaveTextProperty ? node.text : node.nodeValue);
     }
 
-    function getVirtualChildren(startComment, allowUnbalanced) {
-        var currentNode = startComment;
-        var depth = 1;
-        var children = [];
-        while (currentNode = currentNode.nextSibling) {
-            if (isEndComment(currentNode)) {
-                depth--;
-                if (depth === 0)
-                    return children;
-            }
-
-            children.push(currentNode);
-
-            if (isStartComment(currentNode))
-                depth++;
-        }
-        if (!allowUnbalanced)
-            throw new Error("Cannot find closing comment tag to match: " + startComment.nodeValue);
-        return null;
-    }
+    function getVirtualChildren(startComment, allowUnbalanced) {}
 
     function getMatchingEndComment(startComment, allowUnbalanced) {

[Survived] BlockStatement
src/virtualElements.js:31:55
         var currentNode = startComment;
         var depth = 1;
         var children = [];
-        while (currentNode = currentNode.nextSibling) {
-            if (isEndComment(currentNode)) {
-                depth--;
-                if (depth === 0)
-                    return children;
-            }
-
-            children.push(currentNode);
-
-            if (isStartComment(currentNode))
-                depth++;
-        }
+        while (currentNode = currentNode.nextSibling) {}
         if (!allowUnbalanced)
             throw new Error("Cannot find closing comment tag to match: " + startComment.nodeValue);

[Survived] ConditionalExpression
src/virtualElements.js:32:17
         var depth = 1;
         var children = [];
         while (currentNode = currentNode.nextSibling) {
-            if (isEndComment(currentNode)) {
+            if (false) {
                 depth--;
                 if (depth === 0)

[Survived] BlockStatement
src/virtualElements.js:32:44
         var depth = 1;
         var children = [];
         while (currentNode = currentNode.nextSibling) {
-            if (isEndComment(currentNode)) {
-                depth--;
-                if (depth === 0)
-                    return children;
-            }
+            if (isEndComment(currentNode)) {}
 
             children.push(currentNode);

[Survived] UpdateOperator
src/virtualElements.js:33:17
         var children = [];
         while (currentNode = currentNode.nextSibling) {
             if (isEndComment(currentNode)) {
-                depth--;
+                depth++;
                 if (depth === 0)
                     return children;

[Survived] ConditionalExpression
src/virtualElements.js:34:21
         while (currentNode = currentNode.nextSibling) {
             if (isEndComment(currentNode)) {
                 depth--;
-                if (depth === 0)
+                if (false)
                     return children;
             }

[Survived] ConditionalExpression
src/virtualElements.js:43:13
             if (isStartComment(currentNode))
                 depth++;
         }
-        if (!allowUnbalanced)
+        if (false)
             throw new Error("Cannot find closing comment tag to match: " + startComment.nodeValue);
         return null;

[Survived] StringLiteral
src/virtualElements.js:44:29
                 depth++;
         }
         if (!allowUnbalanced)
-            throw new Error("Cannot find closing comment tag to match: " + startComment.nodeValue);
+            throw new Error("" + startComment.nodeValue);
         return null;
     }

[Survived] ConditionalExpression
src/virtualElements.js:50:13
 
     function getMatchingEndComment(startComment, allowUnbalanced) {
         var allVirtualChildren = getVirtualChildren(startComment, allowUnbalanced);
-        if (allVirtualChildren) {
+        if (true) {
             if (allVirtualChildren.length > 0)
                 return allVirtualChildren[allVirtualChildren.length - 1].nextSibling;

[Survived] BlockStatement
src/virtualElements.js:66:53
             do {
                 if (captureRemaining)                   // We already hit an unbalanced node and are now just scooping up all subsequent nodes
                     captureRemaining.push(childNode);
-                else if (isStartComment(childNode)) {
-                    var matchingEndComment = getMatchingEndComment(childNode, /* allowUnbalanced: */ true);
-                    if (matchingEndComment)             // It's a balanced tag, so skip immediately to the end of this virtual set
-                        childNode = matchingEndComment;
-                    else
-                        captureRemaining = [childNode]; // It's unbalanced, so start capturing from this point
-                } else if (isEndComment(childNode)) {
+                else if (isStartComment(childNode)) {} else if (isEndComment(childNode)) {
                     captureRemaining = [childNode];     // It's unbalanced (if it wasn't, we'd have skipped over it already), so start capturing
                 }

[Survived] ArrayDeclaration
src/virtualElements.js:71:44
                     if (matchingEndComment)             // It's a balanced tag, so skip immediately to the end of this virtual set
                         childNode = matchingEndComment;
                     else
-                        captureRemaining = [childNode]; // It's unbalanced, so start capturing from this point
+                        captureRemaining = []; // It's unbalanced, so start capturing from this point
                 } else if (isEndComment(childNode)) {
                     captureRemaining = [childNode];     // It's unbalanced (if it wasn't, we'd have skipped over it already), so start capturing

[Survived] ConditionalExpression
src/virtualElements.js:72:28
                         childNode = matchingEndComment;
                     else
                         captureRemaining = [childNode]; // It's unbalanced, so start capturing from this point
-                } else if (isEndComment(childNode)) {
+                } else if (false) {
                     captureRemaining = [childNode];     // It's unbalanced (if it wasn't, we'd have skipped over it already), so start capturing
                 }

[Survived] ArrayDeclaration
src/virtualElements.js:73:40
                     else
                         captureRemaining = [childNode]; // It's unbalanced, so start capturing from this point
                 } else if (isEndComment(childNode)) {
-                    captureRemaining = [childNode];     // It's unbalanced (if it wasn't, we'd have skipped over it already), so start capturing
+                    captureRemaining = [];     // It's unbalanced (if it wasn't, we'd have skipped over it already), so start capturing
                 }
             } while (childNode = childNode.nextSibling);

[Survived] ConditionalExpression
src/virtualElements.js:88:17
         },
 
         emptyNode: function(node) {
-            if (!isStartComment(node))
+            if (true)
                 ko.utils.emptyDomNode(node);
             else {

[Survived] EqualityOperator
src/virtualElements.js:92:61
                 ko.utils.emptyDomNode(node);
             else {
                 var virtualChildren = ko.virtualElements.childNodes(node);
-                for (var i = 0, j = virtualChildren.length; i < j; i++)
+                for (var i = 0, j = virtualChildren.length; i <= j; i++)
                     ko.removeNode(virtualChildren[i]);
             }

[Survived] BooleanLiteral
src/virtualElements.js:98:17
         },
 
         setDomNodeChildren: function(node, childNodes) {
-            if (!isStartComment(node))
+            if (isStartComment(node))
                 ko.utils.setDomNodeChildren(node, childNodes);
             else {

[Survived] UpdateOperator
src/virtualElements.js:103:63
             else {
                 ko.virtualElements.emptyNode(node);
                 var endCommentNode = node.nextSibling; // Must be the next sibling, as we just emptied the children
-                for (var i = 0, j = childNodes.length; i < j; i++)
+                for (var i = 0, j = childNodes.length; i < j; i--)
                     endCommentNode.parentNode.insertBefore(childNodes[i], endCommentNode);
             }

[Survived] BooleanLiteral
src/virtualElements.js:123:24
         insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {
             if (!insertAfterNode) {
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
-            } else if (!isStartComment(containerNode)) {
+            } else if (isStartComment(containerNode)) {
                 // Insert after insertion point
                 if (insertAfterNode.nextSibling)

[Survived] BlockStatement
src/virtualElements.js:135:36
             }
         },
 
-        firstChild: function(node) {
-            if (!isStartComment(node))
-                return node.firstChild;
-            if (!node.nextSibling || isEndComment(node.nextSibling))
-                return null;
-            return node.nextSibling;
-        },
+        firstChild: function(node) {},
 
         nextSibling: function(node) {

[Survived] BooleanLiteral
src/virtualElements.js:136:17
         },
 
         firstChild: function(node) {
-            if (!isStartComment(node))
+            if (isStartComment(node))
                 return node.firstChild;
             if (!node.nextSibling || isEndComment(node.nextSibling))

[Survived] ConditionalExpression
src/virtualElements.js:136:17
         },
 
         firstChild: function(node) {
-            if (!isStartComment(node))
+            if (true)
                 return node.firstChild;
             if (!node.nextSibling || isEndComment(node.nextSibling))

[Survived] LogicalOperator
src/virtualElements.js:138:17
         firstChild: function(node) {
             if (!isStartComment(node))
                 return node.firstChild;
-            if (!node.nextSibling || isEndComment(node.nextSibling))
+            if (!node.nextSibling && isEndComment(node.nextSibling))
                 return null;
             return node.nextSibling;

[Survived] ConditionalExpression
src/virtualElements.js:138:17
         firstChild: function(node) {
             if (!isStartComment(node))
                 return node.firstChild;
-            if (!node.nextSibling || isEndComment(node.nextSibling))
+            if (false)
                 return null;
             return node.nextSibling;

[Survived] BlockStatement
src/virtualElements.js:143:37
             return node.nextSibling;
         },
 
-        nextSibling: function(node) {
-            if (isStartComment(node))
-                node = getMatchingEndComment(node);
-            if (node.nextSibling && isEndComment(node.nextSibling))
-                return null;
-            return node.nextSibling;
-        },
+        nextSibling: function(node) {},
 
         hasBindingValue: isStartComment,

[Survived] ConditionalExpression
src/virtualElements.js:144:17
         },
 
         nextSibling: function(node) {
-            if (isStartComment(node))
+            if (false)
                 node = getMatchingEndComment(node);
             if (node.nextSibling && isEndComment(node.nextSibling))

[Survived] ConditionalExpression
src/virtualElements.js:144:17
         },
 
         nextSibling: function(node) {
-            if (isStartComment(node))
+            if (true)
                 node = getMatchingEndComment(node);
             if (node.nextSibling && isEndComment(node.nextSibling))

[Survived] LogicalOperator
src/virtualElements.js:146:17
         nextSibling: function(node) {
             if (isStartComment(node))
                 node = getMatchingEndComment(node);
-            if (node.nextSibling && isEndComment(node.nextSibling))
+            if (node.nextSibling || isEndComment(node.nextSibling))
                 return null;
             return node.nextSibling;

[Survived] ConditionalExpression
src/virtualElements.js:146:17
         nextSibling: function(node) {
             if (isStartComment(node))
                 node = getMatchingEndComment(node);
-            if (node.nextSibling && isEndComment(node.nextSibling))
+            if (false)
                 return null;
             return node.nextSibling;

[Survived] BlockStatement
src/virtualElements.js:168:28
             // Scan immediate children to see if they contain unbalanced comment tags. If they do, those comment tags
             // must be intended to appear *after* that child, so move them there.
             var childNode = elementVerified.firstChild;
-            if (childNode) {
-                do {
-                    if (childNode.nodeType === 1) {
-                        var unbalancedTags = getUnbalancedChildTags(childNode);
-                        if (unbalancedTags) {
-                            // Fix up the DOM by moving the unbalanced tags to where they most likely were intended to be placed - *after* the child
-                            var nodeToInsertBefore = childNode.nextSibling;
-                            for (var i = 0; i < unbalancedTags.length; i++) {
-                                if (nodeToInsertBefore)
-                                    elementVerified.insertBefore(unbalancedTags[i], nodeToInsertBefore);
-                                else
-                                    elementVerified.appendChild(unbalancedTags[i]);
-                            }
-                        }
-                    }
-                } while (childNode = childNode.nextSibling);
-            }
+            if (childNode) {}
         }
     };

[Survived] EqualityOperator
src/virtualElements.js:175:45
                         if (unbalancedTags) {
                             // Fix up the DOM by moving the unbalanced tags to where they most likely were intended to be placed - *after* the child
                             var nodeToInsertBefore = childNode.nextSibling;
-                            for (var i = 0; i < unbalancedTags.length; i++) {
+                            for (var i = 0; i >= unbalancedTags.length; i++) {
                                 if (nodeToInsertBefore)
                                     elementVerified.insertBefore(unbalancedTags[i], nodeToInsertBefore);

[Survived] StringLiteral
src/virtualElements.js:190:17
 })();
 ko.exportSymbol('virtualElements', ko.virtualElements);
 ko.exportSymbol('virtualElements.allowedBindings', ko.virtualElements.allowedBindings);
-ko.exportSymbol('virtualElements.emptyNode', ko.virtualElements.emptyNode);
+ko.exportSymbol("", ko.virtualElements.emptyNode);
 //ko.exportSymbol('virtualElements.firstChild', ko.virtualElements.firstChild);     // firstChild is not minified
 ko.exportSymbol('virtualElements.insertAfter', ko.virtualElements.insertAfter);

[Survived] StringLiteral
src/virtualElements.js:192:17
 ko.exportSymbol('virtualElements.allowedBindings', ko.virtualElements.allowedBindings);
 ko.exportSymbol('virtualElements.emptyNode', ko.virtualElements.emptyNode);
 //ko.exportSymbol('virtualElements.firstChild', ko.virtualElements.firstChild);     // firstChild is not minified
-ko.exportSymbol('virtualElements.insertAfter', ko.virtualElements.insertAfter);
+ko.exportSymbol("", ko.virtualElements.insertAfter);
 //ko.exportSymbol('virtualElements.nextSibling', ko.virtualElements.nextSibling);   // nextSibling is not minified
 ko.exportSymbol('virtualElements.prepend', ko.virtualElements.prepend);
