[Survived] BlockStatement
src/binding/defaultBindings/ifIfnotWith.js:7:36
         'init': function(element, valueAccessor, allBindings, viewModel, bindingContext) {
             var didDisplayOnLastUpdate,
                 savedNodes;
-            ko.computed(function() {
-                var dataValue = ko.utils.unwrapObservable(valueAccessor()),
-                    shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
-                    isFirstRender = !savedNodes,
-                    needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);
-
-                if (needsRefresh) {
-                    // Save a copy of the inner nodes on the initial update, but only if we have dependencies.
-                    if (isFirstRender && ko.computedContext.getDependenciesCount()) {
-                        savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), true /* shouldCleanNodes */);
-                    }
-
-                    if (shouldDisplay) {
-                        if (!isFirstRender) {
-                            ko.virtualElements.setDomNodeChildren(element, ko.utils.cloneNodes(savedNodes));
-                        }
-                        ko.applyBindingsToDescendants(makeContextCallback ? makeContextCallback(bindingContext, dataValue) : bindingContext, element);
-                    } else {
-                        ko.virtualElements.emptyNode(element);
-                    }
-
-                    didDisplayOnLastUpdate = shouldDisplay;
-                }
-            }, null, { disposeWhenNodeIsRemoved: element });
+            ko.computed(function() {}, null, { disposeWhenNodeIsRemoved: element });
             return { 'controlsDescendantBindings': true };
         }

[Survived] BooleanLiteral
src/binding/defaultBindings/ifIfnotWith.js:9:48
                 savedNodes;
             ko.computed(function() {
                 var dataValue = ko.utils.unwrapObservable(valueAccessor()),
-                    shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
+                    shouldDisplay = !isNot !== dataValue, // equivalent to isNot ? !dataValue : !!dataValue
                     isFirstRender = !savedNodes,
                     needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);

[Survived] EqualityOperator
src/binding/defaultBindings/ifIfnotWith.js:9:37
                 savedNodes;
             ko.computed(function() {
                 var dataValue = ko.utils.unwrapObservable(valueAccessor()),
-                    shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
+                    shouldDisplay = !isNot === !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
                     isFirstRender = !savedNodes,
                     needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);

[Survived] BooleanLiteral
src/binding/defaultBindings/ifIfnotWith.js:10:37
             ko.computed(function() {
                 var dataValue = ko.utils.unwrapObservable(valueAccessor()),
                     shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
-                    isFirstRender = !savedNodes,
+                    isFirstRender = savedNodes,
                     needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);
 

[Survived] ConditionalExpression
src/binding/defaultBindings/ifIfnotWith.js:11:36
                 var dataValue = ko.utils.unwrapObservable(valueAccessor()),
                     shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
                     isFirstRender = !savedNodes,
-                    needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);
+                    needsRefresh = false;
 
                 if (needsRefresh) {

[Survived] ConditionalExpression
src/binding/defaultBindings/ifIfnotWith.js:11:36
                 var dataValue = ko.utils.unwrapObservable(valueAccessor()),
                     shouldDisplay = !isNot !== !dataValue, // equivalent to isNot ? !dataValue : !!dataValue
                     isFirstRender = !savedNodes,
-                    needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);
+                    needsRefresh = false || (shouldDisplay !== didDisplayOnLastUpdate);
 
                 if (needsRefresh) {

[Survived] BlockStatement
src/binding/defaultBindings/ifIfnotWith.js:13:35
                     isFirstRender = !savedNodes,
                     needsRefresh = isFirstRender || isWith || (shouldDisplay !== didDisplayOnLastUpdate);
 
-                if (needsRefresh) {
-                    // Save a copy of the inner nodes on the initial update, but only if we have dependencies.
-                    if (isFirstRender && ko.computedContext.getDependenciesCount()) {
-                        savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), true /* shouldCleanNodes */);
-                    }
-
-                    if (shouldDisplay) {
-                        if (!isFirstRender) {
-                            ko.virtualElements.setDomNodeChildren(element, ko.utils.cloneNodes(savedNodes));
-                        }
-                        ko.applyBindingsToDescendants(makeContextCallback ? makeContextCallback(bindingContext, dataValue) : bindingContext, element);
-                    } else {
-                        ko.virtualElements.emptyNode(element);
-                    }
-
-                    didDisplayOnLastUpdate = shouldDisplay;
-                }
+                if (needsRefresh) {}
             }, null, { disposeWhenNodeIsRemoved: element });
             return { 'controlsDescendantBindings': true };

[Survived] BlockStatement
src/binding/defaultBindings/ifIfnotWith.js:15:85
 
                 if (needsRefresh) {
                     // Save a copy of the inner nodes on the initial update, but only if we have dependencies.
-                    if (isFirstRender && ko.computedContext.getDependenciesCount()) {
-                        savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), true /* shouldCleanNodes */);
-                    }
+                    if (isFirstRender && ko.computedContext.getDependenciesCount()) {}
 
                     if (shouldDisplay) {

[Survived] ConditionalExpression
src/binding/defaultBindings/ifIfnotWith.js:15:25
 
                 if (needsRefresh) {
                     // Save a copy of the inner nodes on the initial update, but only if we have dependencies.
-                    if (isFirstRender && ko.computedContext.getDependenciesCount()) {
+                    if (true) {
                         savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), true /* shouldCleanNodes */);
                     }

[Survived] BooleanLiteral
src/binding/defaultBindings/ifIfnotWith.js:16:98
                 if (needsRefresh) {
                     // Save a copy of the inner nodes on the initial update, but only if we have dependencies.
                     if (isFirstRender && ko.computedContext.getDependenciesCount()) {
-                        savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), true /* shouldCleanNodes */);
+                        savedNodes = ko.utils.cloneNodes(ko.virtualElements.childNodes(element), false /* shouldCleanNodes */);
                     }
 

[Survived] BlockStatement
src/binding/defaultBindings/ifIfnotWith.js:20:45
                     }
 
                     if (shouldDisplay) {
-                        if (!isFirstRender) {
-                            ko.virtualElements.setDomNodeChildren(element, ko.utils.cloneNodes(savedNodes));
-                        }
+                        if (!isFirstRender) {}
                         ko.applyBindingsToDescendants(makeContextCallback ? makeContextCallback(bindingContext, dataValue) : bindingContext, element);
                     } else {

[Survived] BooleanLiteral
src/binding/defaultBindings/ifIfnotWith.js:31:52
                     didDisplayOnLastUpdate = shouldDisplay;
                 }
             }, null, { disposeWhenNodeIsRemoved: element });
-            return { 'controlsDescendantBindings': true };
+            return { 'controlsDescendantBindings': false };
         }
     };

[Survived] ObjectLiteral
src/binding/defaultBindings/ifIfnotWith.js:31:20
                     didDisplayOnLastUpdate = shouldDisplay;
                 }
             }, null, { disposeWhenNodeIsRemoved: element });
-            return { 'controlsDescendantBindings': true };
+            return {};
         }
     };
