[Survived] EqualityOperator
src/binding/defaultBindings/options.js:20:40
             return ko.utils.arrayFilter(element.options, function (node) { return node.selected; });
         }
 
-        var selectWasPreviouslyEmpty = element.length == 0;
+        var selectWasPreviouslyEmpty = element.length != 0;
         var previousScrollTop = (!selectWasPreviouslyEmpty && element.multiple) ? element.scrollTop : null;
         var unwrappedArray = ko.utils.unwrapObservable(valueAccessor());

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:21:34
         }
 
         var selectWasPreviouslyEmpty = element.length == 0;
-        var previousScrollTop = (!selectWasPreviouslyEmpty && element.multiple) ? element.scrollTop : null;
+        var previousScrollTop = (false) ? element.scrollTop : null;
         var unwrappedArray = ko.utils.unwrapObservable(valueAccessor());
         var includeDestroyed = allBindings.get('optionsIncludeDestroyed');

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:29:13
         var filteredArray;
         var previousSelectedValues;
 
-        if (element.multiple) {
+        if (false) {
             previousSelectedValues = ko.utils.arrayMap(selectedOptions(), ko.selectExtensions.readValue);
         } else {

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:29:13
         var filteredArray;
         var previousSelectedValues;
 
-        if (element.multiple) {
+        if (true) {
             previousSelectedValues = ko.utils.arrayMap(selectedOptions(), ko.selectExtensions.readValue);
         } else {

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:32:38
         if (element.multiple) {
             previousSelectedValues = ko.utils.arrayMap(selectedOptions(), ko.selectExtensions.readValue);
         } else {
-            previousSelectedValues = element.selectedIndex >= 0 ? [ ko.selectExtensions.readValue(element.options[element.selectedIndex]) ] : [];
+            previousSelectedValues = false ? [ ko.selectExtensions.readValue(element.options[element.selectedIndex]) ] : [];
         }
 

[Survived] LogicalOperator
src/binding/defaultBindings/options.js:41:24
 
             // Filter out any entries marked as destroyed
             filteredArray = ko.utils.arrayFilter(unwrappedArray, function(item) {
-                return includeDestroyed || item === undefined || item === null || !ko.utils.unwrapObservable(item['_destroy']);
+                return (includeDestroyed || item === undefined) && item === null || !ko.utils.unwrapObservable(item['_destroy']);
             });
 

[Survived] LogicalOperator
src/binding/defaultBindings/options.js:48:21
             if (allBindings['has']('optionsCaption')) {
                 captionValue = ko.utils.unwrapObservable(allBindings.get('optionsCaption'));
                 // If caption value is null or undefined, don't show a caption
-                if (captionValue !== null && captionValue !== undefined) {
+                if (captionValue !== null || captionValue !== undefined) {
                     filteredArray.unshift(captionPlaceholder);
                 }

[Survived] BlockStatement
src/binding/defaultBindings/options.js:71:68
         // The second is when an observable value for a specific array entry is updated.
         // oldOptions will be empty in the first case, but will be filled with the previously generated option in the second.
         var itemUpdate = false;
-        function optionForArrayItem(arrayEntry, index, oldOptions) {
-            if (oldOptions.length) {
-                previousSelectedValues = oldOptions[0].selected ? [ ko.selectExtensions.readValue(oldOptions[0]) ] : [];
-                itemUpdate = true;
-            }
-            var option = element.ownerDocument.createElement("option");
-            if (arrayEntry === captionPlaceholder) {
-                ko.utils.setTextContent(option, allBindings.get('optionsCaption'));
-                ko.selectExtensions.writeValue(option, undefined);
-            } else {
-                // Apply a value to the option element
-                var optionValue = applyToObject(arrayEntry, allBindings.get('optionsValue'), arrayEntry);
-                ko.selectExtensions.writeValue(option, ko.utils.unwrapObservable(optionValue));
-
-                // Apply some text to the option element
-                var optionText = applyToObject(arrayEntry, allBindings.get('optionsText'), optionValue);
-                ko.utils.setTextContent(option, optionText);
-            }
-            return [option];
-        }
+        function optionForArrayItem(arrayEntry, index, oldOptions) {}
 
         // By using a beforeRemove callback, we delay the removal until after new items are added. This fixes a selection

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:77:17
                 itemUpdate = true;
             }
             var option = element.ownerDocument.createElement("option");
-            if (arrayEntry === captionPlaceholder) {
+            if (arrayEntry !== captionPlaceholder) {
                 ko.utils.setTextContent(option, allBindings.get('optionsCaption'));
                 ko.selectExtensions.writeValue(option, undefined);

[Survived] ArrayDeclaration
src/binding/defaultBindings/options.js:89:20
                 var optionText = applyToObject(arrayEntry, allBindings.get('optionsText'), optionValue);
                 ko.utils.setTextContent(option, optionText);
             }
-            return [option];
+            return [];
         }
 

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:103:34
             // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
             // That's why we first added them without selection. Now it's time to set the selection.
             if (previousSelectedValues.length) {
-                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) >= 0;
+                var isSelected = true;
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 

[Survived] BooleanLiteral
src/binding/defaultBindings/options.js:107:35
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 
                 // If this option was changed from being selected during a single-item update, notify the change
-                if (itemUpdate && !isSelected)
+                if (itemUpdate && isSelected)
                     ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
             }

[Survived] BlockStatement
src/binding/defaultBindings/options.js:113:55
         }
 
         var callback = setSelectionCallback;
-        if (allBindings['has']('optionsAfterRender')) {
-            callback = function(arrayEntry, newOptions) {
-                setSelectionCallback(arrayEntry, newOptions);
-                ko.dependencyDetection.ignore(allBindings.get('optionsAfterRender'), null, [newOptions[0], arrayEntry !== captionPlaceholder ? arrayEntry : undefined]);
-            }
-        }
+        if (allBindings['has']('optionsAfterRender')) {}
 
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:123:17
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);
 
         ko.dependencyDetection.ignore(function () {
-            if (allBindings.get('valueAllowUnset') && allBindings['has']('value')) {
+            if (true) {
                 // The model value is authoritative, so make sure its value is the one selected
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:123:17
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);
 
         ko.dependencyDetection.ignore(function () {
-            if (allBindings.get('valueAllowUnset') && allBindings['has']('value')) {
+            if (false) {
                 // The model value is authoritative, so make sure its value is the one selected
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);

[Survived] BlockStatement
src/binding/defaultBindings/options.js:126:20
             if (allBindings.get('valueAllowUnset') && allBindings['has']('value')) {
                 // The model value is authoritative, so make sure its value is the one selected
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else {
-                // Determine if the selection has changed as a result of updating the options list
-                var selectionChanged;
-                if (element.multiple) {
-                    // For a multiple-select box, compare the new selection count to the previous one
-                    // But if nothing was selected before, the selection can't have changed
-                    selectionChanged = previousSelectedValues.length && selectedOptions().length < previousSelectedValues.length;
-                } else {
-                    // For a single-select box, compare the current value to the previous value
-                    // But if nothing was selected before or nothing is selected now, just look for a change in selection
-                    selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
-                        ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
-                        : (previousSelectedValues.length || element.selectedIndex >= 0);
-                }
-
-                // Ensure consistency between model value and selected option.
-                // If the dropdown was changed so that selection is no longer the same,
-                // notify the value or selectedOptions binding.
-                if (selectionChanged) {
-                    ko.utils.triggerEvent(element, "change");
-                }
-            }
+            } else {}
         });
 

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:129:21
             } else {
                 // Determine if the selection has changed as a result of updating the options list
                 var selectionChanged;
-                if (element.multiple) {
+                if (false) {
                     // For a multiple-select box, compare the new selection count to the previous one
                     // But if nothing was selected before, the selection can't have changed

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:136:41
                 } else {
                     // For a single-select box, compare the current value to the previous value
                     // But if nothing was selected before or nothing is selected now, just look for a change in selection
-                    selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
+                    selectionChanged = (false)
                         ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
                         : (previousSelectedValues.length || element.selectedIndex >= 0);

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:138:61
                     // But if nothing was selected before or nothing is selected now, just look for a change in selection
                     selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
                         ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
-                        : (previousSelectedValues.length || element.selectedIndex >= 0);
+                        : (previousSelectedValues.length || element.selectedIndex < 0);
                 }
 

[Survived] LogicalOperator
src/binding/defaultBindings/options.js:153:13
         // Workaround for IE bug
         ko.utils.ensureSelectElementIsRenderedCorrectly(element);
 
-        if (previousScrollTop && Math.abs(previousScrollTop - element.scrollTop) > 20)
+        if (previousScrollTop || Math.abs(previousScrollTop - element.scrollTop) > 20)
             element.scrollTop = previousScrollTop;
     }
