[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:5:88
     'after': ['options', 'foreach'],
     'init': function (element, valueAccessor, allBindings) {
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (element.tagName.toLowerCase() == "input" && (element.type == "checkbox" || element.type == "radio")) {
+        if (element.tagName.toLowerCase() == "input" && (element.type == "checkbox" || false)) {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:5:58
     'after': ['options', 'foreach'],
     'init': function (element, valueAccessor, allBindings) {
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (element.tagName.toLowerCase() == "input" && (element.type == "checkbox" || element.type == "radio")) {
+        if (element.tagName.toLowerCase() == "input" && (element.type != "checkbox" || element.type == "radio")) {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] ObjectLiteral
src/binding/defaultBindings/value.js:6:53
     'init': function (element, valueAccessor, allBindings) {
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
         if (element.tagName.toLowerCase() == "input" && (element.type == "checkbox" || element.type == "radio")) {
-            ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
+            ko.applyBindingAccessorsToNode(element, {});
             return;
         }

[Survived] ArrayDeclaration
src/binding/defaultBindings/value.js:11:29
         }
 
         // Always catch "change" event; possibly other events too if asked
-        var eventsToCatch = ["change"];
+        var eventsToCatch = [];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;

[Survived] BlockStatement
src/binding/defaultBindings/value.js:16:37
         var propertyChangedFired = false;
         var elementValueBeforeEvent = null;
 
-        if (requestedEventsToCatch) {
-            if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
-                requestedEventsToCatch = [requestedEventsToCatch];
-            ko.utils.arrayPushAll(eventsToCatch, requestedEventsToCatch);
-            eventsToCatch = ko.utils.arrayGetDistinctValues(eventsToCatch);
-        }
+        if (requestedEventsToCatch) {}
 
         var valueUpdateHandler = function() {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:33:40
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+        var ieAutoCompleteHackNeeded = true;
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:34:77
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete != "off" && (!element.form && element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:35:41
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && element.tagName.toLowerCase() == "input" && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
+        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") != -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });

[Survived] BlockStatement
src/binding/defaultBindings/value.js:45:66
             });
         }
 
-        ko.utils.arrayForEach(eventsToCatch, function(eventName) {
-            // The syntax "after<eventname>" means "run the handler asynchronously after the event"
-            // This is useful, for example, to catch "keydown" events after the browser has updated the control
-            // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
-            var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    setTimeout(valueUpdateHandler, 0);
-                };
-                eventName = eventName.substring("after".length);
-            }
-            ko.utils.registerEventHandler(element, eventName, handler);
-        });
+        ko.utils.arrayForEach(eventsToCatch, function(eventName) {});
 
         var updateFromModel = function () {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:50:64
             // This is useful, for example, to catch "keydown" events after the browser has updated the control
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    setTimeout(valueUpdateHandler, 0);
-                };
-                eventName = eventName.substring("after".length);
-            }
+            if (ko.utils.stringStartsWith(eventName, "after")) {}
             ko.utils.registerEventHandler(element, eventName, handler);
         });

[Survived] BlockStatement
src/binding/defaultBindings/value.js:51:38
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
             if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    setTimeout(valueUpdateHandler, 0);
-                };
+                handler = function() {};
                 eventName = eventName.substring("after".length);
             }

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:71:17
             var newValue = ko.utils.unwrapObservable(valueAccessor());
             var elementValue = ko.selectExtensions.readValue(element);
 
-            if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
+            if (true) {
                 setTimeout(updateFromModel, 0);
                 return;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:71:17
             var newValue = ko.utils.unwrapObservable(valueAccessor());
             var elementValue = ko.selectExtensions.readValue(element);
 
-            if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
+            if (true && newValue === elementValueBeforeEvent) {
                 setTimeout(updateFromModel, 0);
                 return;

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:76:36
                 return;
             }
 
-            var valueHasChanged = (newValue !== elementValue);
+            var valueHasChanged = (newValue === elementValue);
 
             if (valueHasChanged) {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:76:36
                 return;
             }
 
-            var valueHasChanged = (newValue !== elementValue);
+            var valueHasChanged = (false);
 
             if (valueHasChanged) {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:78:34
 
             var valueHasChanged = (newValue !== elementValue);
 
-            if (valueHasChanged) {
-                if (ko.utils.tagNameLower(element) === "select") {
-                    var allowUnset = allBindings.get('valueAllowUnset');
-                    var applyValueAction = function () {
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                    };
-                    applyValueAction();
-
-                    if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                        // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                        // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                        ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                    } else {
-                        // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                        // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                        // to apply the value as well.
-                        setTimeout(applyValueAction, 0);
-                    }
-                } else {
-                    ko.selectExtensions.writeValue(element, newValue);
-                }
-            }
+            if (valueHasChanged) {}
         };
 

[Survived] BlockStatement
src/binding/defaultBindings/value.js:79:66
             var valueHasChanged = (newValue !== elementValue);
 
             if (valueHasChanged) {
-                if (ko.utils.tagNameLower(element) === "select") {
-                    var allowUnset = allBindings.get('valueAllowUnset');
-                    var applyValueAction = function () {
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                    };
-                    applyValueAction();
-
-                    if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                        // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                        // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                        ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                    } else {
-                        // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
-                        // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread
-                        // to apply the value as well.
-                        setTimeout(applyValueAction, 0);
-                    }
-                } else {
+                if (ko.utils.tagNameLower(element) === "select") {} else {
                     ko.selectExtensions.writeValue(element, newValue);
                 }

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:79:21
             var valueHasChanged = (newValue !== elementValue);
 
             if (valueHasChanged) {
-                if (ko.utils.tagNameLower(element) === "select") {
+                if (true) {
                     var allowUnset = allBindings.get('valueAllowUnset');
                     var applyValueAction = function () {

[Survived] BlockStatement
src/binding/defaultBindings/value.js:81:56
             if (valueHasChanged) {
                 if (ko.utils.tagNameLower(element) === "select") {
                     var allowUnset = allBindings.get('valueAllowUnset');
-                    var applyValueAction = function () {
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                    };
+                    var applyValueAction = function () {};
                     applyValueAction();
 

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:86:25
                     };
                     applyValueAction();
 
-                    if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
+                    if (allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
                         // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                         // because you're not allowed to have a model value that disagrees with a visible UI selection.

[Survived] BlockStatement
src/binding/defaultBindings/value.js:86:93
                     };
                     applyValueAction();
 
-                    if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                        // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                        // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                        ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                    } else {
+                    if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {} else {
                         // Workaround for IE6 bug: It won't reliably apply values to SELECT nodes during the same execution thread
                         // right after you've changed the set of OPTION nodes on it. So for that node type, we'll schedule a second thread

[Survived] ObjectLiteral
src/binding/defaultBindings/value.js:102:44
             }
         };
 
-        ko.computed(updateFromModel, null, { disposeWhenNodeIsRemoved: element });
+        ko.computed(updateFromModel, null, {});
     },
     'update': function() {} // Keep for backwards compatibility with code that may have wrapped value binding
