[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:37:17
 
     ko.utils.setDomNodeChildrenFromArrayMapping = function (domNode, array, mapping, options, callbackAfterAddingNodes) {
         // Compare the provided array against the previous one
-        array = array || [];
+        array = false;
         options = options || {};
         var isFirstExecution = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) === undefined;

[Survived] LogicalOperator
src/binding/editDetection/arrayToDomNodeChildren.js:38:19
     ko.utils.setDomNodeChildrenFromArrayMapping = function (domNode, array, mapping, options, callbackAfterAddingNodes) {
         // Compare the provided array against the previous one
         array = array || [];
-        options = options || {};
+        options = options && {};
         var isFirstExecution = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) === undefined;
         var lastMappingResult = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) || [];

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:39:32
         // Compare the provided array against the previous one
         array = array || [];
         options = options || {};
-        var isFirstExecution = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) === undefined;
+        var isFirstExecution = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) !== undefined;
         var lastMappingResult = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) || [];
         var lastArray = ko.utils.arrayMap(lastMappingResult, function (x) { return x.arrayEntry; });

[Survived] LogicalOperator
src/binding/editDetection/arrayToDomNodeChildren.js:40:33
         array = array || [];
         options = options || {};
         var isFirstExecution = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) === undefined;
-        var lastMappingResult = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) || [];
+        var lastMappingResult = ko.utils.domData.get(domNode, lastMappingResultDomDataKey) && [];
         var lastArray = ko.utils.arrayMap(lastMappingResult, function (x) { return x.arrayEntry; });
         var editScript = ko.utils.compareArrays(lastArray, array, options['dontLimitMoves']);

[Survived] ArrayDeclaration
src/binding/editDetection/arrayToDomNodeChildren.js:45:32
         var editScript = ko.utils.compareArrays(lastArray, array, options['dontLimitMoves']);
 
         // Build the new mapping result
-        var newMappingResult = [];
+        var newMappingResult = ["Stryker was here"];
         var lastMappingResultIndex = 0;
         var newMappingResultIndex = 0;

[Survived] ArrayDeclaration
src/binding/editDetection/arrayToDomNodeChildren.js:49:29
         var lastMappingResultIndex = 0;
         var newMappingResultIndex = 0;
 
-        var nodesToDelete = [];
+        var nodesToDelete = ["Stryker was here"];
         var itemsToProcess = [];
         var itemsForBeforeRemoveCallbacks = [];

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:69:58
 
         function callCallback(callback, items) {
             if (callback) {
-                for (var i = 0, n = items.length; i < n; i++) {
+                for (var i = 0, n = items.length; i < n; i--) {
                     if (items[i]) {
                         ko.utils.arrayForEach(items[i].mappedNodes, function(node) {

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:83:25
             movedIndex = editScriptItem['moved'];
             switch (editScriptItem['status']) {
                 case "deleted":
-                    if (movedIndex === undefined) {
+                    if (false) {
                         mapData = lastMappingResult[lastMappingResultIndex];
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:92:29
 
                         // Queue these nodes for later removal
                         nodesToDelete.push.apply(nodesToDelete, ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode));
-                        if (options['beforeRemove']) {
+                        if (true) {
                             itemsForBeforeRemoveCallbacks[i] = mapData;
                             itemsToProcess.push(mapData);

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:100:22
                     lastMappingResultIndex++;
                     break;
 
-                case "retained":
+                case "":
                     itemMovedOrRetained(i, lastMappingResultIndex++);
                     break;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:105:25
                     break;
 
                 case "added":
-                    if (movedIndex !== undefined) {
+                    if (true) {
                         itemMovedOrRetained(i, movedIndex);
                     } else {

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:105:25
                     break;
 
                 case "added":
-                    if (movedIndex !== undefined) {
+                    if (movedIndex === undefined) {
                         itemMovedOrRetained(i, movedIndex);
                     } else {

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:125:121
         ko.utils.arrayForEach(nodesToDelete, options['beforeRemove'] ? ko.cleanNode : ko.removeNode);
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
-        for (var i = 0, nextNode = ko.virtualElements.firstChild(domNode), lastNode, node; mapData = itemsToProcess[i]; i++) {
+        for (var i = 0, nextNode = ko.virtualElements.firstChild(domNode), lastNode, node; mapData = itemsToProcess[i]; i--) {
             // Get nodes for newly added items
             if (!mapData.mappedNodes)

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:131:106
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 
             // Put nodes in the right place if they aren't there already
-            for (var j = 0; node = mapData.mappedNodes[j]; nextNode = node.nextSibling, lastNode = node, j++) {
+            for (var j = 0; node = mapData.mappedNodes[j]; nextNode = node.nextSibling, lastNode = node, j--) {
                 if (node !== nextNode)
                     ko.virtualElements.insertAfter(domNode, node, lastNode);

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:148:30
         // some sort of animation, which is why we first reorder the nodes that will be removed. If the
         // callback instead removes the nodes right away, it would be more efficient to skip reordering them.
         // Perhaps we'll make that change in the future if this scenario becomes more common.
-        callCallback(options['beforeRemove'], itemsForBeforeRemoveCallbacks);
+        callCallback(options[""], itemsForBeforeRemoveCallbacks);
 
         // Finally call afterMove and afterAdd callbacks

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:159:17
     }
 })();
 
-ko.exportSymbol('utils.setDomNodeChildrenFromArrayMapping', ko.utils.setDomNodeChildrenFromArrayMapping);
+ko.exportSymbol("", ko.utils.setDomNodeChildrenFromArrayMapping);
 
