[Survived] ConditionalExpression
src/binding/editDetection/compareArrays.js:31:13
         oldArray = oldArray || [];
         newArray = newArray || [];
 
-        if (oldArray.length <= newArray.length)
+        if (true)
             return compareSmallArrayToBigArray(oldArray, newArray, statusNotInOld, statusNotInNew, options);
         else

[Survived] ArithmeticOperator
src/binding/editDetection/compareArrays.js:94:65
 
         // Set a limit on the number of consecutive non-matching comparisons; having it a multiple of
         // smlIndexMax keeps the time complexity of this algorithm linear.
-        ko.utils.findMovesInArrayComparison(notInSml, notInBig, smlIndexMax * 10);
+        ko.utils.findMovesInArrayComparison(notInSml, notInBig, smlIndexMax / 10);
 
         return editScript.reverse();
