[Survived] BlockStatement
src/binding/expressionRewriting.js:109:44
     function preProcessBindings(bindingsStringOrKeyValueArray, bindingOptions) {
         bindingOptions = bindingOptions || {};
 
-        function processKeyValue(key, val) {
-            var writableVal;
-            function callPreprocessHook(obj) {
-                return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
-            }
-            if (!bindingParams) {
-                if (!callPreprocessHook(ko['getBindingHandler'](key)))
-                    return;
-
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
-                    // For two-way bindings, provide a write method in case the value
-                    // isn't a writable observable.
-                    propertyAccessorResultStrings.push("'" + key + "':function(_z){" + writableVal + "=_z}");
-                }
-            }
-            // Values are wrapped in a function so that each value can be accessed independently
-            if (makeValueAccessors) {
-                val = 'function(){return ' + val + ' }';
-            }
-            resultStrings.push("'" + key + "':" + val);
-        }
+        function processKeyValue(key, val) {}
 
         var resultStrings = [],

[Survived] BooleanLiteral
src/binding/expressionRewriting.js:114:17
             function callPreprocessHook(obj) {
                 return (obj && obj['preprocess']) ? (val = obj['preprocess'](val, key, processKeyValue)) : true;
             }
-            if (!bindingParams) {
+            if (bindingParams) {
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:118:21
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;
 
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
+                if (true) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:118:21
                 if (!callPreprocessHook(ko['getBindingHandler'](key)))
                     return;
 
-                if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
+                if (false) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.

[Survived] StringLiteral
src/binding/expressionRewriting.js:121:102
                 if (twoWayBindings[key] && (writableVal = getWriteableValue(val))) {
                     // For two-way bindings, provide a write method in case the value
                     // isn't a writable observable.
-                    propertyAccessorResultStrings.push("'" + key + "':function(_z){" + writableVal + "=_z}");
+                    propertyAccessorResultStrings.push("'" + key + "':function(_z){" + writableVal + "");
                 }
             }

[Survived] BlockStatement
src/binding/expressionRewriting.js:125:37
                 }
             }
             // Values are wrapped in a function so that each value can be accessed independently
-            if (makeValueAccessors) {
-                val = 'function(){return ' + val + ' }';
-            }
+            if (makeValueAccessors) {}
             resultStrings.push("'" + key + "':" + val);
         }

[Survived] EqualityOperator
src/binding/expressionRewriting.js:135:29
             propertyAccessorResultStrings = [],
             makeValueAccessors = bindingOptions['valueAccessors'],
             bindingParams = bindingOptions['bindingParams'],
-            keyValueArray = typeof bindingsStringOrKeyValueArray === "string" ?
+            keyValueArray = typeof bindingsStringOrKeyValueArray !== "string" ?
                 parseObjectLiteral(bindingsStringOrKeyValueArray) : bindingsStringOrKeyValueArray;
 

[Survived] StringLiteral
src/binding/expressionRewriting.js:143:94
         });
 
         if (propertyAccessorResultStrings.length)
-            processKeyValue('_ko_property_writers', "{" + propertyAccessorResultStrings.join(",") + " }");
+            processKeyValue('_ko_property_writers', "{" + propertyAccessorResultStrings.join("") + " }");
 
         return resultStrings.join(",");

[Survived] BooleanLiteral
src/binding/expressionRewriting.js:174:17
         // checkIfDifferent:    If true, and if the property being written is a writable observable, the value will only be written if
         //                      it is !== existing value on that writable observable
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
-            if (!property || !ko.isObservable(property)) {
+            if (property || !ko.isObservable(property)) {
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])

[Survived] ConditionalExpression
src/binding/expressionRewriting.js:174:17
         // checkIfDifferent:    If true, and if the property being written is a writable observable, the value will only be written if
         //                      it is !== existing value on that writable observable
         writeValueToProperty: function(property, allBindings, key, value, checkIfDifferent) {
-            if (!property || !ko.isObservable(property)) {
+            if (true) {
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])

[Survived] EqualityOperator
src/binding/expressionRewriting.js:178:84
                 var propWriters = allBindings.get('_ko_property_writers');
                 if (propWriters && propWriters[key])
                     propWriters[key](value);
-            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() !== value)) {
+            } else if (ko.isWriteableObservable(property) && (!checkIfDifferent || property.peek() === value)) {
                 property(value);
             }

[Survived] StringLiteral
src/binding/expressionRewriting.js:185:17
     };
 })();
 
-ko.exportSymbol('expressionRewriting', ko.expressionRewriting);
+ko.exportSymbol("", ko.expressionRewriting);
 ko.exportSymbol('expressionRewriting.bindingRewriteValidators', ko.expressionRewriting.bindingRewriteValidators);
 ko.exportSymbol('expressionRewriting.parseObjectLiteral', ko.expressionRewriting.parseObjectLiteral);
