[Survived] ConditionalExpression
src/binding/selectExtensions.js:44:17
                             break;
                     }
                     break;
-                case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
-                        value = undefined;
-                    var selection = -1;
-                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
-                        optionValue = ko.selectExtensions.readValue(element.options[i]);
-                        // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue == "" && value === undefined)) {
-                            selection = i;
-                            break;
-                        }
-                    }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
-                        element.selectedIndex = selection;
-                    }
-                    break;
+                case 'select':
                 default:
                     if ((value === null) || (value === undefined))

[Survived] ConditionalExpression
src/binding/selectExtensions.js:45:41
                     }
                     break;
                 case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
+                    if (value === "" || false)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;

[Survived] LogicalOperator
src/binding/selectExtensions.js:45:25
                     }
                     break;
                 case 'select':
-                    if (value === "" || value === null)       // A blank string or null value will select the caption
+                    if (value === "" && value === null)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;

[Survived] BlockStatement
src/binding/selectExtensions.js:48:90
                     if (value === "" || value === null)       // A blank string or null value will select the caption
                         value = undefined;
                     var selection = -1;
-                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
-                        optionValue = ko.selectExtensions.readValue(element.options[i]);
-                        // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue == "" && value === undefined)) {
-                            selection = i;
-                            break;
-                        }
-                    }
+                    for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {}
                     if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
                         element.selectedIndex = selection;

[Survived] LogicalOperator
src/binding/selectExtensions.js:51:29
                     for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue == "" && value === undefined)) {
+                        if (optionValue == value && optionValue == "" && value === undefined) {
                             selection = i;
                             break;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:51:54
                     for (var i = 0, n = element.options.length, optionValue; i < n; ++i) {
                         optionValue = ko.selectExtensions.readValue(element.options[i]);
                         // Include special check to handle selecting a caption with a blank string value
-                        if (optionValue == value || (optionValue == "" && value === undefined)) {
+                        if (optionValue == value || (true && value === undefined)) {
                             selection = i;
                             break;

[Survived] ConditionalExpression
src/binding/selectExtensions.js:56:81
                             break;
                         }
                     }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
+                    if (allowUnset || selection >= 0 || (value === undefined && true)) {
                         element.selectedIndex = selection;
                     }

[Survived] ConditionalExpression
src/binding/selectExtensions.js:56:58
                             break;
                         }
                     }
-                    if (allowUnset || selection >= 0 || (value === undefined && element.size > 1)) {
+                    if (allowUnset || selection >= 0 || (false)) {
                         element.selectedIndex = selection;
                     }
