[Survived] BlockStatement
src/components/componentBinding.js:9:67
         'init': function(element, valueAccessor, ignored1, ignored2, bindingContext) {
             var currentViewModel,
                 currentLoadingOperationId,
-                disposeAssociatedComponentViewModel = function () {
-                    var currentViewModelDispose = currentViewModel && currentViewModel['dispose'];
-                    if (typeof currentViewModelDispose === 'function') {
-                        currentViewModelDispose.call(currentViewModel);
-                    }
-
-                    // Any in-flight loading operation is no longer relevant, so make sure we ignore its completion
-                    currentLoadingOperationId = null;
-                };
+                disposeAssociatedComponentViewModel = function () {};
 
             ko.utils.domNodeDisposal.addDisposeCallback(element, disposeAssociatedComponentViewModel);

[Survived] ConditionalExpression
src/components/componentBinding.js:25:21
                 var value = ko.utils.unwrapObservable(valueAccessor()),
                     componentName, componentParams;
 
-                if (typeof value === 'string') {
+                if (true) {
                     componentName = value;
                 } else {

[Survived] ConditionalExpression
src/components/componentBinding.js:32:21
                     componentParams = ko.utils.unwrapObservable(value['params']);
                 }
 
-                if (!componentName) {
+                if (false) {
                     throw new Error('No component name specified');
                 }

[Survived] BlockStatement
src/components/componentBinding.js:37:80
                 }
 
                 var loadingOperationId = currentLoadingOperationId = ++componentLoadingOperationUniqueId;
-                ko.components.get(componentName, function(componentDefinition) {
-                    // If this is not the current load operation for this element, ignore it.
-                    if (currentLoadingOperationId !== loadingOperationId) {
-                        return;
-                    }
-
-                    // Clean up previous state
-                    disposeAssociatedComponentViewModel();
-
-                    // Instantiate and bind new component. Implicitly this cleans any old DOM nodes.
-                    if (!componentDefinition) {
-                        throw new Error('Unknown component \'' + componentName + '\'');
-                    }
-                    cloneTemplateIntoElement(componentName, componentDefinition, element);
-                    var componentViewModel = createViewModel(componentDefinition, element, componentParams),
-                        childBindingContext = bindingContext['createChildContext'](componentViewModel);
-                    currentViewModel = componentViewModel;
-                    ko.applyBindingsToDescendants(childBindingContext, element);
-                });
+                ko.components.get(componentName, function(componentDefinition) {});
             }, null, { disposeWhenNodeIsRemoved: element });
 

[Survived] EqualityOperator
src/components/componentBinding.js:39:25
                 var loadingOperationId = currentLoadingOperationId = ++componentLoadingOperationUniqueId;
                 ko.components.get(componentName, function(componentDefinition) {
                     // If this is not the current load operation for this element, ignore it.
-                    if (currentLoadingOperationId !== loadingOperationId) {
+                    if (currentLoadingOperationId === loadingOperationId) {
                         return;
                     }

[Survived] StringLiteral
src/components/componentBinding.js:52:62
                     }
                     cloneTemplateIntoElement(componentName, componentDefinition, element);
                     var componentViewModel = createViewModel(componentDefinition, element, componentParams),
-                        childBindingContext = bindingContext['createChildContext'](componentViewModel);
+                        childBindingContext = bindingContext[""](componentViewModel);
                     currentViewModel = componentViewModel;
                     ko.applyBindingsToDescendants(childBindingContext, element);

[Survived] ConditionalExpression
src/components/componentBinding.js:66:13
 
     function cloneTemplateIntoElement(componentName, componentDefinition, element) {
         var template = componentDefinition['template'];
-        if (!template) {
+        if (true) {
             throw new Error('Component \'' + componentName + '\' has no template');
         }

[Survived] StringLiteral
src/components/componentBinding.js:67:29
     function cloneTemplateIntoElement(componentName, componentDefinition, element) {
         var template = componentDefinition['template'];
         if (!template) {
-            throw new Error('Component \'' + componentName + '\' has no template');
+            throw new Error("" + componentName + '\' has no template');
         }
 

[Survived] BlockStatement
src/components/componentBinding.js:74:77
         ko.virtualElements.setDomNodeChildren(element, clonedNodesArray);
     }
 
-    function createViewModel(componentDefinition, element, componentParams) {
-        var componentViewModelFactory = componentDefinition['createViewModel'];
-        return componentViewModelFactory
-            ? componentViewModelFactory.call(componentDefinition, componentParams, { element: element })
-            : componentParams; // Template-only component
-    }
+    function createViewModel(componentDefinition, element, componentParams) {}
 
 })();
