[Survived] BlockStatement
src/subscribables/dependencyDetection.js:31:53
 
         end: end,
 
-        registerDependency: function (subscribable) {
-            if (currentFrame) {
-                if (!ko.isSubscribable(subscribable))
-                    throw new Error("Only subscribable things can act as dependencies");
-                currentFrame.callback(subscribable, subscribable._id || (subscribable._id = getId()));
-            }
-        },
+        registerDependency: function (subscribable) {},
 
         ignore: function (callback, callbackTarget, callbackArgs) {

[Survived] ConditionalExpression
src/subscribables/dependencyDetection.js:35:53
             if (currentFrame) {
                 if (!ko.isSubscribable(subscribable))
                     throw new Error("Only subscribable things can act as dependencies");
-                currentFrame.callback(subscribable, subscribable._id || (subscribable._id = getId()));
+                currentFrame.callback(subscribable, false);
             }
         },

[Survived] LogicalOperator
src/subscribables/dependencyDetection.js:35:53
             if (currentFrame) {
                 if (!ko.isSubscribable(subscribable))
                     throw new Error("Only subscribable things can act as dependencies");
-                currentFrame.callback(subscribable, subscribable._id || (subscribable._id = getId()));
+                currentFrame.callback(subscribable, subscribable._id && (subscribable._id = getId()));
             }
         },

[Survived] BlockStatement
src/subscribables/dependencyDetection.js:53:31
                 return currentFrame.computed.getDependenciesCount();
         },
 
-        isInitial: function() {
-            if (currentFrame)
-                return currentFrame.isInitial;
-        }
+        isInitial: function() {}
     };
 })();
