[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:3:28
 ko.computed = ko.dependentObservable = function (evaluatorFunctionOrOptions, evaluatorFunctionTarget, options) {
     var _latestValue,
-        _needsEvaluation = true,
+        _needsEvaluation = false,
         _isBeingEvaluated = false,
         _suppressDisposalUntilDisposeWhenReturnsFalse = false,

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:4:29
 ko.computed = ko.dependentObservable = function (evaluatorFunctionOrOptions, evaluatorFunctionTarget, options) {
     var _latestValue,
         _needsEvaluation = true,
-        _isBeingEvaluated = false,
+        _isBeingEvaluated = true,
         _suppressDisposalUntilDisposeWhenReturnsFalse = false,
         _isDisposed = false,

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:6:23
         _needsEvaluation = true,
         _isBeingEvaluated = false,
         _suppressDisposalUntilDisposeWhenReturnsFalse = false,
-        _isDisposed = false,
+        _isDisposed = true,
         readFunction = evaluatorFunctionOrOptions,
         pure = false,

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:8:16
         _suppressDisposalUntilDisposeWhenReturnsFalse = false,
         _isDisposed = false,
         readFunction = evaluatorFunctionOrOptions,
-        pure = false,
+        pure = true,
         isSleeping = false;
 

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:9:22
         _isDisposed = false,
         readFunction = evaluatorFunctionOrOptions,
         pure = false,
-        isSleeping = false;
+        isSleeping = true;
 
     if (readFunction && typeof readFunction == "object") {

[Survived] EqualityOperator
src/subscribables/dependentObservable.js:11:25
         pure = false,
         isSleeping = false;
 
-    if (readFunction && typeof readFunction == "object") {
+    if (readFunction && typeof readFunction != "object") {
         // Single-parameter syntax - everything is on this "options" param
         options = readFunction;

[Survived] LogicalOperator
src/subscribables/dependentObservable.js:17:19
         readFunction = options["read"];
     } else {
         // Multi-parameter syntax - construct the options according to the params passed
-        options = options || {};
+        options = options && {};
         if (!readFunction)
             readFunction = options["read"];

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:18:13
     } else {
         // Multi-parameter syntax - construct the options according to the params passed
         options = options || {};
-        if (!readFunction)
+        if (true)
             readFunction = options["read"];
     }

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:21:9
         if (!readFunction)
             readFunction = options["read"];
     }
-    if (typeof readFunction != "function")
+    if (false)
         throw new Error("Pass a function that returns the value of the ko.computed");
 

[Survived] BlockStatement
src/subscribables/dependentObservable.js:24:60
     if (typeof readFunction != "function")
         throw new Error("Pass a function that returns the value of the ko.computed");
 
-    function addSubscriptionToDependency(subscribable, id) {
-        if (!_subscriptionsToDependencies[id]) {
-            _subscriptionsToDependencies[id] = subscribable.subscribe(evaluatePossiblyAsync);
-            ++_dependenciesCount;
-        }
-    }
+    function addSubscriptionToDependency(subscribable, id) {}
 
     function disposeAllSubscriptionsToDependencies() {

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:25:13
         throw new Error("Pass a function that returns the value of the ko.computed");
 
     function addSubscriptionToDependency(subscribable, id) {
-        if (!_subscriptionsToDependencies[id]) {
+        if (true) {
             _subscriptionsToDependencies[id] = subscribable.subscribe(evaluatePossiblyAsync);
             ++_dependenciesCount;

[Survived] BlockStatement
src/subscribables/dependentObservable.js:25:48
         throw new Error("Pass a function that returns the value of the ko.computed");
 
     function addSubscriptionToDependency(subscribable, id) {
-        if (!_subscriptionsToDependencies[id]) {
-            _subscriptionsToDependencies[id] = subscribable.subscribe(evaluatePossiblyAsync);
-            ++_dependenciesCount;
-        }
+        if (!_subscriptionsToDependencies[id]) {}
     }
 

[Survived] UpdateOperator
src/subscribables/dependentObservable.js:27:13
     function addSubscriptionToDependency(subscribable, id) {
         if (!_subscriptionsToDependencies[id]) {
             _subscriptionsToDependencies[id] = subscribable.subscribe(evaluatePossiblyAsync);
-            ++_dependenciesCount;
+            --_dependenciesCount;
         }
     }

[Survived] BlockStatement
src/subscribables/dependentObservable.js:31:54
         }
     }
 
-    function disposeAllSubscriptionsToDependencies() {
-        ko.utils.objectForEach(_subscriptionsToDependencies, function (id, subscription) {
-            subscription.dispose();
-        });
-        _subscriptionsToDependencies = {};
-    }
+    function disposeAllSubscriptionsToDependencies() {}
 
     function disposeComputed() {

[Survived] BlockStatement
src/subscribables/dependentObservable.js:32:90
     }
 
     function disposeAllSubscriptionsToDependencies() {
-        ko.utils.objectForEach(_subscriptionsToDependencies, function (id, subscription) {
-            subscription.dispose();
-        });
+        ko.utils.objectForEach(_subscriptionsToDependencies, function (id, subscription) {});
         _subscriptionsToDependencies = {};
     }

[Survived] BlockStatement
src/subscribables/dependentObservable.js:38:32
         _subscriptionsToDependencies = {};
     }
 
-    function disposeComputed() {
-        disposeAllSubscriptionsToDependencies();
-        _dependenciesCount = 0;
-        _isDisposed = true;
-        _needsEvaluation = false;
-    }
+    function disposeComputed() {}
 
     function evaluatePossiblyAsync() {

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:41:23
     function disposeComputed() {
         disposeAllSubscriptionsToDependencies();
         _dependenciesCount = 0;
-        _isDisposed = true;
+        _isDisposed = false;
         _needsEvaluation = false;
     }

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:42:28
         disposeAllSubscriptionsToDependencies();
         _dependenciesCount = 0;
         _isDisposed = true;
-        _needsEvaluation = false;
+        _needsEvaluation = true;
     }
 

[Survived] BlockStatement
src/subscribables/dependentObservable.js:45:38
         _needsEvaluation = false;
     }
 
-    function evaluatePossiblyAsync() {
-        var throttleEvaluationTimeout = dependentObservable['throttleEvaluation'];
-        if (throttleEvaluationTimeout && throttleEvaluationTimeout >= 0) {
-            clearTimeout(evaluationTimeoutInstance);
-            evaluationTimeoutInstance = setTimeout(evaluateImmediate, throttleEvaluationTimeout);
-        } else if (dependentObservable._evalRateLimited) {
-            dependentObservable._evalRateLimited();
-        } else {
-            evaluateImmediate();
-        }
-    }
+    function evaluatePossiblyAsync() {}
 
     function evaluateImmediate(suppressChangeNotification) {

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:47:42
 
     function evaluatePossiblyAsync() {
         var throttleEvaluationTimeout = dependentObservable['throttleEvaluation'];
-        if (throttleEvaluationTimeout && throttleEvaluationTimeout >= 0) {
+        if (throttleEvaluationTimeout && true) {
             clearTimeout(evaluationTimeoutInstance);
             evaluationTimeoutInstance = setTimeout(evaluateImmediate, throttleEvaluationTimeout);

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:50:20
         if (throttleEvaluationTimeout && throttleEvaluationTimeout >= 0) {
             clearTimeout(evaluationTimeoutInstance);
             evaluationTimeoutInstance = setTimeout(evaluateImmediate, throttleEvaluationTimeout);
-        } else if (dependentObservable._evalRateLimited) {
+        } else if (false) {
             dependentObservable._evalRateLimited();
         } else {

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:50:20
         if (throttleEvaluationTimeout && throttleEvaluationTimeout >= 0) {
             clearTimeout(evaluationTimeoutInstance);
             evaluationTimeoutInstance = setTimeout(evaluateImmediate, throttleEvaluationTimeout);
-        } else if (dependentObservable._evalRateLimited) {
+        } else if (true) {
             dependentObservable._evalRateLimited();
         } else {

[Survived] BlockStatement
src/subscribables/dependentObservable.js:52:16
             evaluationTimeoutInstance = setTimeout(evaluateImmediate, throttleEvaluationTimeout);
         } else if (dependentObservable._evalRateLimited) {
             dependentObservable._evalRateLimited();
-        } else {
-            evaluateImmediate();
-        }
+        } else {}
     }
 

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:58:13
     }
 
     function evaluateImmediate(suppressChangeNotification) {
-        if (_isBeingEvaluated) {
+        if (false) {
             if (pure) {
                 throw Error("A 'pure' computed must not be called recursively");

[Survived] BlockStatement
src/subscribables/dependentObservable.js:58:32
     }
 
     function evaluateImmediate(suppressChangeNotification) {
-        if (_isBeingEvaluated) {
-            if (pure) {
-                throw Error("A 'pure' computed must not be called recursively");
-            }
-            // If the evaluation of a ko.computed causes side effects, it's possible that it will trigger its own re-evaluation.
-            // This is not desirable (it's hard for a developer to realise a chain of dependencies might cause this, and they almost
-            // certainly didn't intend infinite re-evaluations). So, for predictability, we simply prevent ko.computeds from causing
-            // their own re-evaluation. Further discussion at https://github.com/SteveSanderson/knockout/pull/387
-            return;
-        }
+        if (_isBeingEvaluated) {}
 
         // Do not evaluate (and possibly capture new dependencies) if disposed

[Survived] BlockStatement
src/subscribables/dependentObservable.js:59:23
 
     function evaluateImmediate(suppressChangeNotification) {
         if (_isBeingEvaluated) {
-            if (pure) {
-                throw Error("A 'pure' computed must not be called recursively");
-            }
+            if (pure) {}
             // If the evaluation of a ko.computed causes side effects, it's possible that it will trigger its own re-evaluation.
             // This is not desirable (it's hard for a developer to realise a chain of dependencies might cause this, and they almost

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:59:17
 
     function evaluateImmediate(suppressChangeNotification) {
         if (_isBeingEvaluated) {
-            if (pure) {
+            if (false) {
                 throw Error("A 'pure' computed must not be called recursively");
             }

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:70:13
         }
 
         // Do not evaluate (and possibly capture new dependencies) if disposed
-        if (_isDisposed) {
+        if (false) {
             return;
         }

[Survived] BlockStatement
src/subscribables/dependentObservable.js:70:26
         }
 
         // Do not evaluate (and possibly capture new dependencies) if disposed
-        if (_isDisposed) {
-            return;
-        }
+        if (_isDisposed) {}
 
         if (disposeWhen && disposeWhen()) {

[Survived] BlockStatement
src/subscribables/dependentObservable.js:74:43
             return;
         }
 
-        if (disposeWhen && disposeWhen()) {
-            // See comment below about _suppressDisposalUntilDisposeWhenReturnsFalse
-            if (!_suppressDisposalUntilDisposeWhenReturnsFalse) {
-                dispose();
-                return;
-            }
-        } else {
+        if (disposeWhen && disposeWhen()) {} else {
             // It just did return false, so we can stop suppressing now
             _suppressDisposalUntilDisposeWhenReturnsFalse = false;

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:76:17
 
         if (disposeWhen && disposeWhen()) {
             // See comment below about _suppressDisposalUntilDisposeWhenReturnsFalse
-            if (!_suppressDisposalUntilDisposeWhenReturnsFalse) {
+            if (_suppressDisposalUntilDisposeWhenReturnsFalse) {
                 dispose();
                 return;

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:76:17
 
         if (disposeWhen && disposeWhen()) {
             // See comment below about _suppressDisposalUntilDisposeWhenReturnsFalse
-            if (!_suppressDisposalUntilDisposeWhenReturnsFalse) {
+            if (true) {
                 dispose();
                 return;

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:88:13
         _isBeingEvaluated = true;
 
         // When sleeping, recalculate the value and return.
-        if (isSleeping) {
+        if (false) {
             try {
                 var dependencyTracking = {};

[Survived] BlockStatement
src/subscribables/dependentObservable.js:88:25
         _isBeingEvaluated = true;
 
         // When sleeping, recalculate the value and return.
-        if (isSleeping) {
-            try {
-                var dependencyTracking = {};
-                ko.dependencyDetection.begin({
-                    callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
-                            dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
-                        }
-                    },
-                    computed: dependentObservable,
-                    isInitial: undefined
-                });
-                _dependenciesCount = 0;
-                _latestValue = readFunction.call(evaluatorFunctionTarget);
-            } finally {
-                ko.dependencyDetection.end();
-                _isBeingEvaluated = false;
-            }
-        } else {
+        if (isSleeping) {} else {
             try {
                 // Initially, we assume that none of the subscriptions are still being used (i.e., all are candidates for disposal).

[Survived] BlockStatement
src/subscribables/dependentObservable.js:89:17
 
         // When sleeping, recalculate the value and return.
         if (isSleeping) {
-            try {
-                var dependencyTracking = {};
-                ko.dependencyDetection.begin({
-                    callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
-                            dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
-                        }
-                    },
-                    computed: dependentObservable,
-                    isInitial: undefined
-                });
-                _dependenciesCount = 0;
-                _latestValue = readFunction.call(evaluatorFunctionTarget);
-            } finally {
+            try {} finally {
                 ko.dependencyDetection.end();
                 _isBeingEvaluated = false;

[Survived] ObjectLiteral
src/subscribables/dependentObservable.js:91:46
         if (isSleeping) {
             try {
                 var dependencyTracking = {};
-                ko.dependencyDetection.begin({
-                    callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
-                            dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
-                        }
-                    },
-                    computed: dependentObservable,
-                    isInitial: undefined
-                });
+                ko.dependencyDetection.begin({});
                 _dependenciesCount = 0;
                 _latestValue = readFunction.call(evaluatorFunctionTarget);

[Survived] BlockStatement
src/subscribables/dependentObservable.js:92:59
             try {
                 var dependencyTracking = {};
                 ko.dependencyDetection.begin({
-                    callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
-                            dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
-                        }
-                    },
+                    callback: function (subscribable, id) {},
                     computed: dependentObservable,
                     isInitial: undefined

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:93:29
                 var dependencyTracking = {};
                 ko.dependencyDetection.begin({
                     callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
+                        if (true) {
                             dependencyTracking[id] = 1;
                             ++_dependenciesCount;

[Survived] BlockStatement
src/subscribables/dependentObservable.js:93:54
                 var dependencyTracking = {};
                 ko.dependencyDetection.begin({
                     callback: function (subscribable, id) {
-                        if (!dependencyTracking[id]) {
-                            dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
-                        }
+                        if (!dependencyTracking[id]) {}
                     },
                     computed: dependentObservable,

[Survived] UpdateOperator
src/subscribables/dependentObservable.js:95:29
                     callback: function (subscribable, id) {
                         if (!dependencyTracking[id]) {
                             dependencyTracking[id] = 1;
-                            ++_dependenciesCount;
+                            --_dependenciesCount;
                         }
                     },

[Survived] BlockStatement
src/subscribables/dependentObservable.js:103:23
                 });
                 _dependenciesCount = 0;
                 _latestValue = readFunction.call(evaluatorFunctionTarget);
-            } finally {
-                ko.dependencyDetection.end();
-                _isBeingEvaluated = false;
-            }
+            } finally {}
         } else {
             try {

[Survived] ObjectLiteral
src/subscribables/dependentObservable.js:112:46
                 // Initially, we assume that none of the subscriptions are still being used (i.e., all are candidates for disposal).
                 // Then, during evaluation, we cross off any that are in fact still being used.
                 var disposalCandidates = _subscriptionsToDependencies, disposalCount = _dependenciesCount;
-                ko.dependencyDetection.begin({
-                    callback: function(subscribable, id) {
-                        if (!_isDisposed) {
-                            if (disposalCount && disposalCandidates[id]) {
-                                // Don't want to dispose this subscription, as it's still being used
-                                _subscriptionsToDependencies[id] = disposalCandidates[id];
-                                ++_dependenciesCount;
-                                delete disposalCandidates[id];
-                                --disposalCount;
-                            } else {
-                                // Brand new subscription - add it
-                                addSubscriptionToDependency(subscribable, id);
-                            }
-                        }
-                    },
-                    computed: dependentObservable,
-                    isInitial: pure ? undefined : !_dependenciesCount        // If we're evaluating when there are no previous dependencies, it must be the first time
-                });
+                ko.dependencyDetection.begin({});
 
                 _subscriptionsToDependencies = {};

[Survived] BlockStatement
src/subscribables/dependentObservable.js:113:58
                 // Then, during evaluation, we cross off any that are in fact still being used.
                 var disposalCandidates = _subscriptionsToDependencies, disposalCount = _dependenciesCount;
                 ko.dependencyDetection.begin({
-                    callback: function(subscribable, id) {
-                        if (!_isDisposed) {
-                            if (disposalCount && disposalCandidates[id]) {
-                                // Don't want to dispose this subscription, as it's still being used
-                                _subscriptionsToDependencies[id] = disposalCandidates[id];
-                                ++_dependenciesCount;
-                                delete disposalCandidates[id];
-                                --disposalCount;
-                            } else {
-                                // Brand new subscription - add it
-                                addSubscriptionToDependency(subscribable, id);
-                            }
-                        }
-                    },
+                    callback: function(subscribable, id) {},
                     computed: dependentObservable,
                     isInitial: pure ? undefined : !_dependenciesCount        // If we're evaluating when there are no previous dependencies, it must be the first time

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:114:29
                 var disposalCandidates = _subscriptionsToDependencies, disposalCount = _dependenciesCount;
                 ko.dependencyDetection.begin({
                     callback: function(subscribable, id) {
-                        if (!_isDisposed) {
+                        if (false) {
                             if (disposalCount && disposalCandidates[id]) {
                                 // Don't want to dispose this subscription, as it's still being used

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:114:29
                 var disposalCandidates = _subscriptionsToDependencies, disposalCount = _dependenciesCount;
                 ko.dependencyDetection.begin({
                     callback: function(subscribable, id) {
-                        if (!_isDisposed) {
+                        if (true) {
                             if (disposalCount && disposalCandidates[id]) {
                                 // Don't want to dispose this subscription, as it's still being used

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:115:33
                 ko.dependencyDetection.begin({
                     callback: function(subscribable, id) {
                         if (!_isDisposed) {
-                            if (disposalCount && disposalCandidates[id]) {
+                            if (false) {
                                 // Don't want to dispose this subscription, as it's still being used
                                 _subscriptionsToDependencies[id] = disposalCandidates[id];

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:115:33
                 ko.dependencyDetection.begin({
                     callback: function(subscribable, id) {
                         if (!_isDisposed) {
-                            if (disposalCount && disposalCandidates[id]) {
+                            if (true) {
                                 // Don't want to dispose this subscription, as it's still being used
                                 _subscriptionsToDependencies[id] = disposalCandidates[id];

[Survived] UpdateOperator
src/subscribables/dependentObservable.js:118:33
                             if (disposalCount && disposalCandidates[id]) {
                                 // Don't want to dispose this subscription, as it's still being used
                                 _subscriptionsToDependencies[id] = disposalCandidates[id];
-                                ++_dependenciesCount;
+                                --_dependenciesCount;
                                 delete disposalCandidates[id];
                                 --disposalCount;

[Survived] UpdateOperator
src/subscribables/dependentObservable.js:120:33
                                 _subscriptionsToDependencies[id] = disposalCandidates[id];
                                 ++_dependenciesCount;
                                 delete disposalCandidates[id];
-                                --disposalCount;
+                                ++disposalCount;
                             } else {
                                 // Brand new subscription - add it

[Survived] BlockStatement
src/subscribables/dependentObservable.js:121:36
                                 ++_dependenciesCount;
                                 delete disposalCandidates[id];
                                 --disposalCount;
-                            } else {
-                                // Brand new subscription - add it
-                                addSubscriptionToDependency(subscribable, id);
-                            }
+                            } else {}
                         }
                     },

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:128:51
                         }
                     },
                     computed: dependentObservable,
-                    isInitial: pure ? undefined : !_dependenciesCount        // If we're evaluating when there are no previous dependencies, it must be the first time
+                    isInitial: pure ? undefined : _dependenciesCount        // If we're evaluating when there are no previous dependencies, it must be the first time
                 });
 

[Survived] BlockStatement
src/subscribables/dependentObservable.js:134:21
                 _subscriptionsToDependencies = {};
                 _dependenciesCount = 0;
 
-                try {
-                    var newValue = evaluatorFunctionTarget ? readFunction.call(evaluatorFunctionTarget) : readFunction();
-
-                } finally {
+                try {} finally {
                     ko.dependencyDetection.end();
 

[Survived] BlockStatement
src/subscribables/dependentObservable.js:137:27
                 try {
                     var newValue = evaluatorFunctionTarget ? readFunction.call(evaluatorFunctionTarget) : readFunction();
 
-                } finally {
-                    ko.dependencyDetection.end();
-
-                    // For each subscription no longer being used, remove it from the active subscriptions list and dispose it
-                    if (disposalCount) {
-                        ko.utils.objectForEach(disposalCandidates, function(id, toDispose) {
-                            toDispose.dispose();
-                        });
-                    }
-
-                    _needsEvaluation = false;
-                }
+                } finally {}
 
                 if (dependentObservable.isDifferent(_latestValue, newValue)) {

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:141:25
                     ko.dependencyDetection.end();
 
                     // For each subscription no longer being used, remove it from the active subscriptions list and dispose it
-                    if (disposalCount) {
+                    if (true) {
                         ko.utils.objectForEach(disposalCandidates, function(id, toDispose) {
                             toDispose.dispose();

[Survived] BlockStatement
src/subscribables/dependentObservable.js:141:40
                     ko.dependencyDetection.end();
 
                     // For each subscription no longer being used, remove it from the active subscriptions list and dispose it
-                    if (disposalCount) {
-                        ko.utils.objectForEach(disposalCandidates, function(id, toDispose) {
-                            toDispose.dispose();
-                        });
-                    }
+                    if (disposalCount) {}
 
                     _needsEvaluation = false;

[Survived] BlockStatement
src/subscribables/dependentObservable.js:142:92
 
                     // For each subscription no longer being used, remove it from the active subscriptions list and dispose it
                     if (disposalCount) {
-                        ko.utils.objectForEach(disposalCandidates, function(id, toDispose) {
-                            toDispose.dispose();
-                        });
+                        ko.utils.objectForEach(disposalCandidates, function(id, toDispose) {});
                     }
 

[Survived] BooleanLiteral
src/subscribables/dependentObservable.js:147:40
                         });
                     }
 
-                    _needsEvaluation = false;
+                    _needsEvaluation = true;
                 }
 

[Survived] ConditionalExpression
src/subscribables/dependentObservable.js:150:21
                     _needsEvaluation = false;
                 }
 
-                if (dependentObservable.isDifferent(_latestValue, newValue)) {
+                if (true) {
                     dependentObservable["notifySubscribers"](_latestValue, "beforeChange");
 
