[Survived] BlockStatement
src/subscribables/extenders.js:23:44
         });
     },
 
-    'rateLimit': function(target, options) {
-        var timeout, method, limitFunction;
-
-        if (typeof options == 'number') {
-            timeout = options;
-        } else {
-            timeout = options['timeout'];
-            method = options['method'];
-        }
-
-        limitFunction = method == 'notifyWhenChangesStop' ?  debounce : throttle;
-        target.limit(function(callback) {
-            return limitFunction(callback, timeout);
-        });
-    },
+    'rateLimit': function(target, options) {},
 
     'notify': function(target, notifyWhen) {

[Survived] EqualityOperator
src/subscribables/extenders.js:33:25
             method = options['method'];
         }
 
-        limitFunction = method == 'notifyWhenChangesStop' ?  debounce : throttle;
+        limitFunction = method != 'notifyWhenChangesStop' ?  debounce : throttle;
         target.limit(function(callback) {
             return limitFunction(callback, timeout);

[Survived] ConditionalExpression
src/subscribables/extenders.js:33:25
             method = options['method'];
         }
 
-        limitFunction = method == 'notifyWhenChangesStop' ?  debounce : throttle;
+        limitFunction = false ?  debounce : throttle;
         target.limit(function(callback) {
             return limitFunction(callback, timeout);

[Survived] BlockStatement
src/subscribables/extenders.js:34:41
         }
 
         limitFunction = method == 'notifyWhenChangesStop' ?  debounce : throttle;
-        target.limit(function(callback) {
-            return limitFunction(callback, timeout);
-        });
+        target.limit(function(callback) {});
     },
 

[Survived] ConditionalExpression
src/subscribables/extenders.js:48:32
 
 var primitiveTypes = { 'undefined':1, 'boolean':1, 'number':1, 'string':1 };
 function valuesArePrimitiveAndEqual(a, b) {
-    var oldValueIsPrimitive = (a === null) || (typeof(a) in primitiveTypes);
+    var oldValueIsPrimitive = (false) || (typeof(a) in primitiveTypes);
     return oldValueIsPrimitive ? (a === b) : false;
 }

[Survived] BlockStatement
src/subscribables/extenders.js:52:38
     return oldValueIsPrimitive ? (a === b) : false;
 }
 
-function throttle(callback, timeout) {
-    var timeoutInstance;
-    return function () {
-        if (!timeoutInstance) {
-            timeoutInstance = setTimeout(function() {
-                timeoutInstance = undefined;
-                callback();
-            }, timeout);
-        }
-    };
-}
+function throttle(callback, timeout) {}
 
 function debounce(callback, timeout) {

[Survived] BlockStatement
src/subscribables/extenders.js:54:24
 
 function throttle(callback, timeout) {
     var timeoutInstance;
-    return function () {
-        if (!timeoutInstance) {
-            timeoutInstance = setTimeout(function() {
-                timeoutInstance = undefined;
-                callback();
-            }, timeout);
-        }
-    };
+    return function () {};
 }
 

[Survived] BlockStatement
src/subscribables/extenders.js:55:31
 function throttle(callback, timeout) {
     var timeoutInstance;
     return function () {
-        if (!timeoutInstance) {
-            timeoutInstance = setTimeout(function() {
-                timeoutInstance = undefined;
-                callback();
-            }, timeout);
-        }
+        if (!timeoutInstance) {}
     };
 }

[Survived] BlockStatement
src/subscribables/extenders.js:56:53
     var timeoutInstance;
     return function () {
         if (!timeoutInstance) {
-            timeoutInstance = setTimeout(function() {
-                timeoutInstance = undefined;
-                callback();
-            }, timeout);
+            timeoutInstance = setTimeout(function() {}, timeout);
         }
     };

[Survived] BlockStatement
src/subscribables/extenders.js:64:38
     };
 }
 
-function debounce(callback, timeout) {
-    var timeoutInstance;
-    return function () {
-        clearTimeout(timeoutInstance);
-        timeoutInstance = setTimeout(callback, timeout);
-    };
-}
+function debounce(callback, timeout) {}
 
 function applyExtenders(requestedExtenders) {

[Survived] BlockStatement
src/subscribables/extenders.js:66:24
 
 function debounce(callback, timeout) {
     var timeoutInstance;
-    return function () {
-        clearTimeout(timeoutInstance);
-        timeoutInstance = setTimeout(callback, timeout);
-    };
+    return function () {};
 }
 

[Survived] ConditionalExpression
src/subscribables/extenders.js:77:17
     if (requestedExtenders) {
         ko.utils.objectForEach(requestedExtenders, function(key, value) {
             var extenderHandler = ko.extenders[key];
-            if (typeof extenderHandler == 'function') {
+            if (true) {
                 target = extenderHandler(target, value) || target;
             }
