[Survived] ConditionalExpression
src/subscribables/observableArray.js:118:5
 
 // Note that for browsers that don't support proto assignment, the
 // inheritance chain is created manually in the ko.observableArray constructor
-if (ko.utils.canSetPrototype) {
+if (true) {
     ko.utils.setPrototypeOf(ko.observableArray['fn'], ko.observable['fn']);
 }
