[Survived] ConditionalExpression
src/templating/templating.js:118:13
 
     function resolveTemplateName(template, data, context) {
         // The template can be specified as:
-        if (ko.isObservable(template)) {
+        if (false) {
             // 1. An observable, with string value
             return template();

[Survived] EqualityOperator
src/templating/templating.js:121:20
         if (ko.isObservable(template)) {
             // 1. An observable, with string value
             return template();
-        } else if (typeof template === 'function') {
+        } else if (typeof template !== 'function') {
             // 2. A function of (data, context) returning a string
             return template(data, context);

[Survived] BlockStatement
src/templating/templating.js:121:52
         if (ko.isObservable(template)) {
             // 1. An observable, with string value
             return template();
-        } else if (typeof template === 'function') {
-            // 2. A function of (data, context) returning a string
-            return template(data, context);
-        } else {
+        } else if (typeof template === 'function') {} else {
             // 3. A string
             return template;

[Survived] ConditionalExpression
src/templating/templating.js:132:14
 
     ko.renderTemplate = function (template, dataOrBindingContext, options, targetNodeOrNodeArray, renderMode) {
         options = options || {};
-        if ((options['templateEngine'] || _templateEngine) == undefined)
+        if ((true) == undefined)
             throw new Error("Set a template engine before calling renderTemplate");
         renderMode = renderMode || "replaceChildren";

[Survived] ConditionalExpression
src/templating/templating.js:132:14
 
     ko.renderTemplate = function (template, dataOrBindingContext, options, targetNodeOrNodeArray, renderMode) {
         options = options || {};
-        if ((options['templateEngine'] || _templateEngine) == undefined)
+        if ((false) == undefined)
             throw new Error("Set a template engine before calling renderTemplate");
         renderMode = renderMode || "replaceChildren";

[Survived] BlockStatement
src/templating/templating.js:136:36
             throw new Error("Set a template engine before calling renderTemplate");
         renderMode = renderMode || "replaceChildren";
 
-        if (targetNodeOrNodeArray) {
-            var firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
-
-            var whenToDispose = function () { return (!firstTargetNode) || !ko.utils.domNodeIsAttachedToDocument(firstTargetNode); }; // Passive disposal (on next evaluation)
-            var activelyDisposeWhenNodeIsRemoved = (firstTargetNode && renderMode == "replaceNode") ? firstTargetNode.parentNode : firstTargetNode;
-
-            return ko.dependentObservable( // So the DOM is automatically updated when any dependency changes
-                function () {
-                    // Ensure we've got a proper binding context to work with
-                    var bindingContext = (dataOrBindingContext && (dataOrBindingContext instanceof ko.bindingContext))
-                        ? dataOrBindingContext
-                        : new ko.bindingContext(ko.utils.unwrapObservable(dataOrBindingContext));
-
-                    var templateName = resolveTemplateName(template, bindingContext['$data'], bindingContext),
-                        renderedNodesArray = executeTemplate(targetNodeOrNodeArray, renderMode, templateName, bindingContext, options);
-
-                    if (renderMode == "replaceNode") {
-                        targetNodeOrNodeArray = renderedNodesArray;
-                        firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
-                    }
-                },
-                null,
-                { disposeWhen: whenToDispose, disposeWhenNodeIsRemoved: activelyDisposeWhenNodeIsRemoved }
-            );
-        } else {
+        if (targetNodeOrNodeArray) {} else {
             // We don't yet have a DOM node to evaluate, so use a memo and render the template later when there is a DOM node
             return ko.memoization.memoize(function (domNode) {

[Survived] ConditionalExpression
src/templating/templating.js:140:72
             var firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
 
             var whenToDispose = function () { return (!firstTargetNode) || !ko.utils.domNodeIsAttachedToDocument(firstTargetNode); }; // Passive disposal (on next evaluation)
-            var activelyDisposeWhenNodeIsRemoved = (firstTargetNode && renderMode == "replaceNode") ? firstTargetNode.parentNode : firstTargetNode;
+            var activelyDisposeWhenNodeIsRemoved = (firstTargetNode && true) ? firstTargetNode.parentNode : firstTargetNode;
 
             return ko.dependentObservable( // So the DOM is automatically updated when any dependency changes

[Survived] ConditionalExpression
src/templating/templating.js:140:53
             var firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
 
             var whenToDispose = function () { return (!firstTargetNode) || !ko.utils.domNodeIsAttachedToDocument(firstTargetNode); }; // Passive disposal (on next evaluation)
-            var activelyDisposeWhenNodeIsRemoved = (firstTargetNode && renderMode == "replaceNode") ? firstTargetNode.parentNode : firstTargetNode;
+            var activelyDisposeWhenNodeIsRemoved = (true) ? firstTargetNode.parentNode : firstTargetNode;
 
             return ko.dependentObservable( // So the DOM is automatically updated when any dependency changes

[Survived] BlockStatement
src/templating/templating.js:143:29
             var activelyDisposeWhenNodeIsRemoved = (firstTargetNode && renderMode == "replaceNode") ? firstTargetNode.parentNode : firstTargetNode;
 
             return ko.dependentObservable( // So the DOM is automatically updated when any dependency changes
-                function () {
-                    // Ensure we've got a proper binding context to work with
-                    var bindingContext = (dataOrBindingContext && (dataOrBindingContext instanceof ko.bindingContext))
-                        ? dataOrBindingContext
-                        : new ko.bindingContext(ko.utils.unwrapObservable(dataOrBindingContext));
-
-                    var templateName = resolveTemplateName(template, bindingContext['$data'], bindingContext),
-                        renderedNodesArray = executeTemplate(targetNodeOrNodeArray, renderMode, templateName, bindingContext, options);
-
-                    if (renderMode == "replaceNode") {
-                        targetNodeOrNodeArray = renderedNodesArray;
-                        firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
-                    }
-                },
+                function () {},
                 null,
                 { disposeWhen: whenToDispose, disposeWhenNodeIsRemoved: activelyDisposeWhenNodeIsRemoved }

[Survived] BlockStatement
src/templating/templating.js:152:54
                     var templateName = resolveTemplateName(template, bindingContext['$data'], bindingContext),
                         renderedNodesArray = executeTemplate(targetNodeOrNodeArray, renderMode, templateName, bindingContext, options);
 
-                    if (renderMode == "replaceNode") {
-                        targetNodeOrNodeArray = renderedNodesArray;
-                        firstTargetNode = getFirstNodeFromPossibleArray(targetNodeOrNodeArray);
-                    }
+                    if (renderMode == "replaceNode") {}
                 },
                 null,

[Survived] BlockStatement
src/templating/templating.js:174:72
         var arrayItemContext;
 
         // This will be called by setDomNodeChildrenFromArrayMapping to get the nodes to add to targetNode
-        var executeTemplateForArrayItem = function (arrayValue, index) {
-            // Support selecting template as a function of the data being rendered
-            arrayItemContext = parentBindingContext['createChildContext'](arrayValue, options['as'], function(context) {
-                context['$index'] = index;
-            });
-
-            var templateName = resolveTemplateName(template, arrayValue, arrayItemContext);
-            return executeTemplate(null, "ignoreTargetNode", templateName, arrayItemContext, options);
-        }
+        var executeTemplateForArrayItem = function (arrayValue, index) {}
 
         // This will be called whenever setDomNodeChildrenFromArrayMapping has added nodes to targetNode

[Survived] StringLiteral
src/templating/templating.js:176:95
         // This will be called by setDomNodeChildrenFromArrayMapping to get the nodes to add to targetNode
         var executeTemplateForArrayItem = function (arrayValue, index) {
             // Support selecting template as a function of the data being rendered
-            arrayItemContext = parentBindingContext['createChildContext'](arrayValue, options['as'], function(context) {
+            arrayItemContext = parentBindingContext['createChildContext'](arrayValue, options[""], function(context) {
                 context['$index'] = index;
             });

[Survived] EqualityOperator
src/templating/templating.js:198:77
 
             // Filter out any entries marked as destroyed
             var filteredArray = ko.utils.arrayFilter(unwrappedArray, function(item) {
-                return options['includeDestroyed'] || item === undefined || item === null || !ko.utils.unwrapObservable(item['_destroy']);
+                return options['includeDestroyed'] || item === undefined || item !== null || !ko.utils.unwrapObservable(item['_destroy']);
             });
 

[Survived] ConditionalExpression
src/templating/templating.js:198:24
 
             // Filter out any entries marked as destroyed
             var filteredArray = ko.utils.arrayFilter(unwrappedArray, function(item) {
-                return options['includeDestroyed'] || item === undefined || item === null || !ko.utils.unwrapObservable(item['_destroy']);
+                return false;
             });
 

[Survived] ConditionalExpression
src/templating/templating.js:213:68
         var oldComputed = ko.utils.domData.get(element, templateComputedDomDataKey);
         if (oldComputed && (typeof(oldComputed.dispose) == 'function'))
             oldComputed.dispose();
-        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && newComputed.isActive()) ? newComputed : undefined);
+        ko.utils.domData.set(element, templateComputedDomDataKey, (false) ? newComputed : undefined);
     }
 

[Survived] StringLiteral
src/templating/templating.js:216:24
         ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && newComputed.isActive()) ? newComputed : undefined);
     }
 
-    ko.bindingHandlers['template'] = {
+    ko.bindingHandlers[""] = {
         'init': function(element, valueAccessor) {
             // Support anonymous templates

[Survived] LogicalOperator
src/templating/templating.js:220:17
         'init': function(element, valueAccessor) {
             // Support anonymous templates
             var bindingValue = ko.utils.unwrapObservable(valueAccessor());
-            if (typeof bindingValue == "string" || bindingValue['name']) {
+            if (typeof bindingValue == "string" && bindingValue['name']) {
                 // It's a named template - clear the element
                 ko.virtualElements.emptyNode(element);

[Survived] EqualityOperator
src/templating/templating.js:239:17
                 templateComputed = null,
                 templateName;
 
-            if (typeof options == "string") {
+            if (typeof options != "string") {
                 templateName = value;
                 options = {};

[Survived] BlockStatement
src/templating/templating.js:242:20
             if (typeof options == "string") {
                 templateName = value;
                 options = {};
-            } else {
-                templateName = options['name'];
-
-                // Support "if"/"ifnot" conditions
-                if ('if' in options)
-                    shouldDisplay = ko.utils.unwrapObservable(options['if']);
-                if (shouldDisplay && 'ifnot' in options)
-                    shouldDisplay = !ko.utils.unwrapObservable(options['ifnot']);
-
-                dataValue = ko.utils.unwrapObservable(options['data']);
-            }
+            } else {}
 
             if ('foreach' in options) {

[Survived] BooleanLiteral
src/templating/templating.js:258:24
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
                 var dataArray = (shouldDisplay && options['foreach']) || [];
                 templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
-            } else if (!shouldDisplay) {
+            } else if (shouldDisplay) {
                 ko.virtualElements.emptyNode(element);
             } else {

[Survived] ConditionalExpression
src/templating/templating.js:265:54
                 var innerBindingContext = ('data' in options) ?
                     bindingContext['createChildContext'](dataValue, options['as']) :  // Given an explitit 'data' value, we create a child binding context for it
                     bindingContext;                                                        // Given no explicit 'data' value, we retain the same binding context
-                templateComputed = ko.renderTemplate(templateName || element, innerBindingContext, options, element);
+                templateComputed = ko.renderTemplate(true, innerBindingContext, options, element);
             }
 
