[Survived] BlockStatement
src/utils.domManipulation.js:38:36
         return ko.utils.makeArray(div.lastChild.childNodes);
     }
 
-    function jQueryHtmlParse(html) {
-        // jQuery's "parseHTML" function was introduced in jQuery 1.8.0 and is a documented public API.
-        if (jQueryInstance['parseHTML']) {
-            return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
-        } else {
-            // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.
-            var elems = jQueryInstance['clean']([html]);
-
-            // As of jQuery 1.7.1, jQuery parses the HTML by appending it to some dummy parent nodes held in an in-memory document fragment.
-            // Unfortunately, it never clears the dummy parent nodes from the document fragment, so it leaks memory over time.
-            // Fix this by finding the top-most dummy parent element, and detaching it from its owner fragment.
-            if (elems && elems[0]) {
-                // Find the top-most parent element that's a direct child of a document fragment
-                var elem = elems[0];
-                while (elem.parentNode && elem.parentNode.nodeType !== 11 /* i.e., DocumentFragment */)
-                    elem = elem.parentNode;
-                // ... then detach it
-                if (elem.parentNode)
-                    elem.parentNode.removeChild(elem);
-            }
-
-            return elems;
-        }
-    }
+    function jQueryHtmlParse(html) {}
 
     ko.utils.parseHtmlFragment = function(html) {

[Survived] BlockStatement
src/utils.domManipulation.js:40:42
 
     function jQueryHtmlParse(html) {
         // jQuery's "parseHTML" function was introduced in jQuery 1.8.0 and is a documented public API.
-        if (jQueryInstance['parseHTML']) {
-            return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
-        } else {
+        if (jQueryInstance['parseHTML']) {} else {
             // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.
             var elems = jQueryInstance['clean']([html]);

[Survived] ConditionalExpression
src/utils.domManipulation.js:41:20
     function jQueryHtmlParse(html) {
         // jQuery's "parseHTML" function was introduced in jQuery 1.8.0 and is a documented public API.
         if (jQueryInstance['parseHTML']) {
-            return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
+            return true; // Ensure we always return an array and never null
         } else {
             // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.

[Survived] ConditionalExpression
src/utils.domManipulation.js:41:20
     function jQueryHtmlParse(html) {
         // jQuery's "parseHTML" function was introduced in jQuery 1.8.0 and is a documented public API.
         if (jQueryInstance['parseHTML']) {
-            return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
+            return false; // Ensure we always return an array and never null
         } else {
             // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.

[Survived] BlockStatement
src/utils.domManipulation.js:42:16
         // jQuery's "parseHTML" function was introduced in jQuery 1.8.0 and is a documented public API.
         if (jQueryInstance['parseHTML']) {
             return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
-        } else {
-            // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.
-            var elems = jQueryInstance['clean']([html]);
-
-            // As of jQuery 1.7.1, jQuery parses the HTML by appending it to some dummy parent nodes held in an in-memory document fragment.
-            // Unfortunately, it never clears the dummy parent nodes from the document fragment, so it leaks memory over time.
-            // Fix this by finding the top-most dummy parent element, and detaching it from its owner fragment.
-            if (elems && elems[0]) {
-                // Find the top-most parent element that's a direct child of a document fragment
-                var elem = elems[0];
-                while (elem.parentNode && elem.parentNode.nodeType !== 11 /* i.e., DocumentFragment */)
-                    elem = elem.parentNode;
-                // ... then detach it
-                if (elem.parentNode)
-                    elem.parentNode.removeChild(elem);
-            }
-
-            return elems;
-        }
+        } else {}
     }
 

[Survived] ArrayDeclaration
src/utils.domManipulation.js:44:49
             return jQueryInstance['parseHTML'](html) || []; // Ensure we always return an array and never null
         } else {
             // For jQuery < 1.8.0, we fall back on the undocumented internal "clean" function.
-            var elems = jQueryInstance['clean']([html]);
+            var elems = jQueryInstance['clean']([]);
 
             // As of jQuery 1.7.1, jQuery parses the HTML by appending it to some dummy parent nodes held in an in-memory document fragment.

[Survived] BlockStatement
src/utils.domManipulation.js:63:49
         }
     }
 
-    ko.utils.parseHtmlFragment = function(html) {
-        return jQueryInstance ? jQueryHtmlParse(html)   // As below, benefit from jQuery's optimisations where possible
-                              : simpleHtmlParse(html);  // ... otherwise, this simple logic will do in most common cases.
-    };
+    ko.utils.parseHtmlFragment = function(html) {};
 
     ko.utils.setHtml = function(node, html) {

[Survived] BlockStatement
src/utils.domManipulation.js:68:45
                               : simpleHtmlParse(html);  // ... otherwise, this simple logic will do in most common cases.
     };
 
-    ko.utils.setHtml = function(node, html) {
-        ko.utils.emptyDomNode(node);
-
-        // There's no legitimate reason to display a stringified observable without unwrapping it, so we'll unwrap it
-        html = ko.utils.unwrapObservable(html);
-
-        if ((html !== null) && (html !== undefined)) {
-            if (typeof html != 'string')
-                html = html.toString();
-
-            // jQuery contains a lot of sophisticated code to parse arbitrary HTML fragments,
-            // for example <tr> elements which are not normally allowed to exist on their own.
-            // If you've referenced jQuery we'll use that rather than duplicating its code.
-            if (jQueryInstance) {
-                jQueryInstance(node)['html'](html);
-            } else {
-                // ... otherwise, use KO's own parsing logic.
-                var parsedNodes = ko.utils.parseHtmlFragment(html);
-                for (var i = 0; i < parsedNodes.length; i++)
-                    node.appendChild(parsedNodes[i]);
-            }
-        }
-    };
+    ko.utils.setHtml = function(node, html) {};
 })();
 

[Survived] BlockStatement
src/utils.domManipulation.js:74:54
         // There's no legitimate reason to display a stringified observable without unwrapping it, so we'll unwrap it
         html = ko.utils.unwrapObservable(html);
 
-        if ((html !== null) && (html !== undefined)) {
-            if (typeof html != 'string')
-                html = html.toString();
-
-            // jQuery contains a lot of sophisticated code to parse arbitrary HTML fragments,
-            // for example <tr> elements which are not normally allowed to exist on their own.
-            // If you've referenced jQuery we'll use that rather than duplicating its code.
-            if (jQueryInstance) {
-                jQueryInstance(node)['html'](html);
-            } else {
-                // ... otherwise, use KO's own parsing logic.
-                var parsedNodes = ko.utils.parseHtmlFragment(html);
-                for (var i = 0; i < parsedNodes.length; i++)
-                    node.appendChild(parsedNodes[i]);
-            }
-        }
+        if ((html !== null) && (html !== undefined)) {}
     };
 })();

[Survived] ConditionalExpression
src/utils.domManipulation.js:81:17
             // jQuery contains a lot of sophisticated code to parse arbitrary HTML fragments,
             // for example <tr> elements which are not normally allowed to exist on their own.
             // If you've referenced jQuery we'll use that rather than duplicating its code.
-            if (jQueryInstance) {
+            if (true) {
                 jQueryInstance(node)['html'](html);
             } else {

[Survived] BlockStatement
src/utils.domManipulation.js:83:20
             // If you've referenced jQuery we'll use that rather than duplicating its code.
             if (jQueryInstance) {
                 jQueryInstance(node)['html'](html);
-            } else {
-                // ... otherwise, use KO's own parsing logic.
-                var parsedNodes = ko.utils.parseHtmlFragment(html);
-                for (var i = 0; i < parsedNodes.length; i++)
-                    node.appendChild(parsedNodes[i]);
-            }
+            } else {}
         }
     };
