[Survived] BlockStatement
src/binding/defaultBindings/options.js:103:63
                 element.removeChild(option);
             };
 
-        function setSelectionCallback(arrayEntry, newOptions) {
-            if (itemUpdate && valueAllowUnset) {
-                // The model value is authoritative, so make sure its value is the one selected
-                // There is no need to use dependencyDetection.ignore since setDomNodeChildrenFromArrayMapping does so already.
-                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else if (previousSelectedValues.length) {
-                // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
-                // That's why we first added them without selection. Now it's time to set the selection.
-                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) >= 0;
-                ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
-
-                // If this option was changed from being selected during a single-item update, notify the change
-                if (itemUpdate && !isSelected) {
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                }
-            }
-        }
+        function setSelectionCallback(arrayEntry, newOptions) {}
 
         var callback = setSelectionCallback;

[Survived] BlockStatement
src/binding/defaultBindings/options.js:104:48
             };
 
         function setSelectionCallback(arrayEntry, newOptions) {
-            if (itemUpdate && valueAllowUnset) {
-                // The model value is authoritative, so make sure its value is the one selected
-                // There is no need to use dependencyDetection.ignore since setDomNodeChildrenFromArrayMapping does so already.
-                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else if (previousSelectedValues.length) {
+            if (itemUpdate && valueAllowUnset) {} else if (previousSelectedValues.length) {
                 // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
                 // That's why we first added them without selection. Now it's time to set the selection.

[Survived] BooleanLiteral
src/binding/defaultBindings/options.js:107:110
             if (itemUpdate && valueAllowUnset) {
                 // The model value is authoritative, so make sure its value is the one selected
                 // There is no need to use dependencyDetection.ignore since setDomNodeChildrenFromArrayMapping does so already.
-                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
+                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), false /* allowUnset */);
             } else if (previousSelectedValues.length) {
                 // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.

[Survived] BlockStatement
src/binding/defaultBindings/options.js:108:55
                 // The model value is authoritative, so make sure its value is the one selected
                 // There is no need to use dependencyDetection.ignore since setDomNodeChildrenFromArrayMapping does so already.
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else if (previousSelectedValues.length) {
-                // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
-                // That's why we first added them without selection. Now it's time to set the selection.
-                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) >= 0;
-                ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
-
-                // If this option was changed from being selected during a single-item update, notify the change
-                if (itemUpdate && !isSelected) {
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                }
-            }
+            } else if (previousSelectedValues.length) {}
         }
 

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:108:24
                 // The model value is authoritative, so make sure its value is the one selected
                 // There is no need to use dependencyDetection.ignore since setDomNodeChildrenFromArrayMapping does so already.
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else if (previousSelectedValues.length) {
+            } else if (false) {
                 // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
                 // That's why we first added them without selection. Now it's time to set the selection.

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:111:34
             } else if (previousSelectedValues.length) {
                 // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
                 // That's why we first added them without selection. Now it's time to set the selection.
-                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) >= 0;
+                var isSelected = true;
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:111:34
             } else if (previousSelectedValues.length) {
                 // IE6 doesn't like us to assign selection to OPTION nodes before they're added to the document.
                 // That's why we first added them without selection. Now it's time to set the selection.
-                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) >= 0;
+                var isSelected = ko.utils.arrayIndexOf(previousSelectedValues, ko.selectExtensions.readValue(newOptions[0])) < 0;
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 

[Survived] BlockStatement
src/binding/defaultBindings/options.js:115:48
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 
                 // If this option was changed from being selected during a single-item update, notify the change
-                if (itemUpdate && !isSelected) {
-                    ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
-                }
+                if (itemUpdate && !isSelected) {}
             }
         }

[Survived] LogicalOperator
src/binding/defaultBindings/options.js:115:21
                 ko.utils.setOptionNodeSelectionState(newOptions[0], isSelected);
 
                 // If this option was changed from being selected during a single-item update, notify the change
-                if (itemUpdate && !isSelected) {
+                if (itemUpdate || !isSelected) {
                     ko.dependencyDetection.ignore(ko.utils.triggerEvent, null, [element, "change"]);
                 }

[Survived] BlockStatement
src/binding/defaultBindings/options.js:122:117
         }
 
         var callback = setSelectionCallback;
-        if (allBindings['has']('optionsAfterRender') && typeof allBindings.get('optionsAfterRender') == "function") {
-            callback = function(arrayEntry, newOptions) {
-                setSelectionCallback(arrayEntry, newOptions);
-                ko.dependencyDetection.ignore(allBindings.get('optionsAfterRender'), null, [newOptions[0], arrayEntry !== captionPlaceholder ? arrayEntry : undefined]);
-            }
-        }
+        if (allBindings['has']('optionsAfterRender') && typeof allBindings.get('optionsAfterRender') == "function") {}
 
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:125:108
         if (allBindings['has']('optionsAfterRender') && typeof allBindings.get('optionsAfterRender') == "function") {
             callback = function(arrayEntry, newOptions) {
                 setSelectionCallback(arrayEntry, newOptions);
-                ko.dependencyDetection.ignore(allBindings.get('optionsAfterRender'), null, [newOptions[0], arrayEntry !== captionPlaceholder ? arrayEntry : undefined]);
+                ko.dependencyDetection.ignore(allBindings.get('optionsAfterRender'), null, [newOptions[0], arrayEntry === captionPlaceholder ? arrayEntry : undefined]);
             }
         }

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:132:17
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);
 
         ko.dependencyDetection.ignore(function () {
-            if (valueAllowUnset) {
+            if (true) {
                 // The model value is authoritative, so make sure its value is the one selected
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);

[Survived] BlockStatement
src/binding/defaultBindings/options.js:132:34
         ko.utils.setDomNodeChildrenFromArrayMapping(element, filteredArray, optionForArrayItem, arrayToDomNodeChildrenOptions, callback);
 
         ko.dependencyDetection.ignore(function () {
-            if (valueAllowUnset) {
-                // The model value is authoritative, so make sure its value is the one selected
-                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else {
+            if (valueAllowUnset) {} else {
                 // Determine if the selection has changed as a result of updating the options list
                 var selectionChanged;

[Survived] BooleanLiteral
src/binding/defaultBindings/options.js:134:110
         ko.dependencyDetection.ignore(function () {
             if (valueAllowUnset) {
                 // The model value is authoritative, so make sure its value is the one selected
-                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
+                ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), false /* allowUnset */);
             } else {
                 // Determine if the selection has changed as a result of updating the options list

[Survived] BlockStatement
src/binding/defaultBindings/options.js:135:20
             if (valueAllowUnset) {
                 // The model value is authoritative, so make sure its value is the one selected
                 ko.selectExtensions.writeValue(element, ko.utils.unwrapObservable(allBindings.get('value')), true /* allowUnset */);
-            } else {
-                // Determine if the selection has changed as a result of updating the options list
-                var selectionChanged;
-                if (multiple) {
-                    // For a multiple-select box, compare the new selection count to the previous one
-                    // But if nothing was selected before, the selection can't have changed
-                    selectionChanged = previousSelectedValues.length && selectedOptions().length < previousSelectedValues.length;
-                } else {
-                    // For a single-select box, compare the current value to the previous value
-                    // But if nothing was selected before or nothing is selected now, just look for a change in selection
-                    selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
-                        ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
-                        : (previousSelectedValues.length || element.selectedIndex >= 0);
-                }
-
-                // Ensure consistency between model value and selected option.
-                // If the dropdown was changed so that selection is no longer the same,
-                // notify the value or selectedOptions binding.
-                if (selectionChanged) {
-                    ko.utils.triggerEvent(element, "change");
-                }
-            }
+            } else {}
         });
 

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:141:73
                 if (multiple) {
                     // For a multiple-select box, compare the new selection count to the previous one
                     // But if nothing was selected before, the selection can't have changed
-                    selectionChanged = previousSelectedValues.length && selectedOptions().length < previousSelectedValues.length;
+                    selectionChanged = previousSelectedValues.length && selectedOptions().length >= previousSelectedValues.length;
                 } else {
                     // For a single-select box, compare the current value to the previous value

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:146:28
                     // For a single-select box, compare the current value to the previous value
                     // But if nothing was selected before or nothing is selected now, just look for a change in selection
                     selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
-                        ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
+                        ? (false)
                         : (previousSelectedValues.length || element.selectedIndex >= 0);
                 }

[Survived] EqualityOperator
src/binding/defaultBindings/options.js:147:61
                     // But if nothing was selected before or nothing is selected now, just look for a change in selection
                     selectionChanged = (previousSelectedValues.length && element.selectedIndex >= 0)
                         ? (ko.selectExtensions.readValue(element.options[element.selectedIndex]) !== previousSelectedValues[0])
-                        : (previousSelectedValues.length || element.selectedIndex >= 0);
+                        : (previousSelectedValues.length || element.selectedIndex > 0);
                 }
 

[Survived] BlockStatement
src/binding/defaultBindings/options.js:153:39
                 // Ensure consistency between model value and selected option.
                 // If the dropdown was changed so that selection is no longer the same,
                 // notify the value or selectedOptions binding.
-                if (selectionChanged) {
-                    ko.utils.triggerEvent(element, "change");
-                }
+                if (selectionChanged) {}
             }
         });

[Survived] ConditionalExpression
src/binding/defaultBindings/options.js:162:13
         // Workaround for IE bug
         ko.utils.ensureSelectElementIsRenderedCorrectly(element);
 
-        if (previousScrollTop && Math.abs(previousScrollTop - element.scrollTop) > 20)
+        if (true)
             element.scrollTop = previousScrollTop;
     }

[Survived] ArithmeticOperator
src/binding/defaultBindings/options.js:162:43
         // Workaround for IE bug
         ko.utils.ensureSelectElementIsRenderedCorrectly(element);
 
-        if (previousScrollTop && Math.abs(previousScrollTop - element.scrollTop) > 20)
+        if (previousScrollTop && Math.abs(previousScrollTop + element.scrollTop) > 20)
             element.scrollTop = previousScrollTop;
     }
