[Survived] StringLiteral
src/binding/defaultBindings/value.js:2:15
 ko.bindingHandlers['value'] = {
-    'after': ['options', 'foreach'],
+    'after': ["", 'foreach'],
     'init': function (element, valueAccessor, allBindings) {
         var tagName = ko.utils.tagNameLower(element),

[Survived] StringLiteral
src/binding/defaultBindings/value.js:2:26
 ko.bindingHandlers['value'] = {
-    'after': ['options', 'foreach'],
+    'after': ['options', ""],
     'init': function (element, valueAccessor, allBindings) {
         var tagName = ko.utils.tagNameLower(element),

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:5:30
     'after': ['options', 'foreach'],
     'init': function (element, valueAccessor, allBindings) {
         var tagName = ko.utils.tagNameLower(element),
-            isInputElement = tagName == "input";
+            isInputElement = false;
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:8:13
             isInputElement = tagName == "input";
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (isInputElement && (element.type == "checkbox" || element.type == "radio")) {
+        if (true) {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:8:62
             isInputElement = tagName == "input";
 
         // If the value binding is placed on a radio/checkbox, then just pass through to checkedValue and quit
-        if (isInputElement && (element.type == "checkbox" || element.type == "radio")) {
+        if (isInputElement && (element.type == "checkbox" || false)) {
             ko.applyBindingAccessorsToNode(element, { 'checkedValue': valueAccessor });
             return;

[Survived] StringLiteral
src/binding/defaultBindings/value.js:14:30
         }
 
         // Always catch "change" event; possibly other events too if asked
-        var eventsToCatch = ["change"];
+        var eventsToCatch = [""];
         var requestedEventsToCatch = allBindings.get("valueUpdate");
         var propertyChangedFired = false;

[Survived] StringLiteral
src/binding/defaultBindings/value.js:15:54
 
         // Always catch "change" event; possibly other events too if asked
         var eventsToCatch = ["change"];
-        var requestedEventsToCatch = allBindings.get("valueUpdate");
+        var requestedEventsToCatch = allBindings.get("");
         var propertyChangedFired = false;
         var elementValueBeforeEvent = null;

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:20:17
         var elementValueBeforeEvent = null;
 
         if (requestedEventsToCatch) {
-            if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
+            if (false) // Allow both individual event names, and arrays of event names
                 requestedEventsToCatch = [requestedEventsToCatch];
             ko.utils.arrayPushAll(eventsToCatch, requestedEventsToCatch);

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:20:17
         var elementValueBeforeEvent = null;
 
         if (requestedEventsToCatch) {
-            if (typeof requestedEventsToCatch == "string") // Allow both individual event names, and arrays of event names
+            if (typeof requestedEventsToCatch != "string") // Allow both individual event names, and arrays of event names
                 requestedEventsToCatch = [requestedEventsToCatch];
             ko.utils.arrayPushAll(eventsToCatch, requestedEventsToCatch);

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:36:80
 
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
-        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
+        var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type != "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:37:43
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete == "off" && (!element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] BooleanLiteral
src/binding/defaultBindings/value.js:37:77
         // Workaround for https://github.com/SteveSanderson/knockout/issues/122
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
-                                       && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
+                                       && element.autocomplete != "off" && (element.form || element.form.autocomplete != "off");
         if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:38:13
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
+        if (ieAutoCompleteHackNeeded || ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });

[Survived] BlockStatement
src/binding/defaultBindings/value.js:38:103
         // IE doesn't fire "change" events on textboxes if the user selects a value from its autocomplete list
         var ieAutoCompleteHackNeeded = ko.utils.ieVersion && isInputElement && element.type == "text"
                                        && element.autocomplete != "off" && (!element.form || element.form.autocomplete != "off");
-        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {
-            ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
-            ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
-            ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
-                    valueUpdateHandler();
-                }
-            });
-        }
+        if (ieAutoCompleteHackNeeded && ko.utils.arrayIndexOf(eventsToCatch, "propertychange") == -1) {}
 
         ko.utils.arrayForEach(eventsToCatch, function(eventName) {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:42:21
             ko.utils.registerEventHandler(element, "propertychange", function () { propertyChangedFired = true });
             ko.utils.registerEventHandler(element, "focus", function () { propertyChangedFired = false });
             ko.utils.registerEventHandler(element, "blur", function() {
-                if (propertyChangedFired) {
+                if (true) {
                     valueUpdateHandler();
                 }

[Survived] BlockStatement
src/binding/defaultBindings/value.js:53:64
             // This is useful, for example, to catch "keydown" events after the browser has updated the control
             // (otherwise, ko.selectExtensions.readValue(this) will receive the control's value *before* the key event)
             var handler = valueUpdateHandler;
-            if (ko.utils.stringStartsWith(eventName, "after")) {
-                handler = function() {
-                    // The elementValueBeforeEvent variable is non-null *only* during the brief gap between
-                    // a keyX event firing and the valueUpdateHandler running, which is scheduled to happen
-                    // at the earliest asynchronous opportunity. We store this temporary information so that
-                    // if, between keyX and valueUpdateHandler, the underlying model value changes separately,
-                    // we can overwrite that model value change with the value the user just typed. Otherwise,
-                    // techniques like rateLimit can trigger model changes at critical moments that will
-                    // override the user's inputs, causing keystrokes to be lost.
-                    elementValueBeforeEvent = ko.selectExtensions.readValue(element);
-                    ko.utils.setTimeout(valueUpdateHandler, 0);
-                };
-                eventName = eventName.substring("after".length);
-            }
+            if (ko.utils.stringStartsWith(eventName, "after")) {}
             ko.utils.registerEventHandler(element, eventName, handler);
         });

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:72:31
 
         var updateFromModel;
 
-        if (isInputElement && element.type == "file") {
+        if (isInputElement && true) {
             // For file input elements, can only write the empty string
             updateFromModel = function () {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:76:21
             // For file input elements, can only write the empty string
             updateFromModel = function () {
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
-                if (newValue === null || newValue === undefined || newValue === "") {
+                if (newValue !== null || newValue === undefined || newValue === "") {
                     element.value = "";
                 } else {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:76:21
             // For file input elements, can only write the empty string
             updateFromModel = function () {
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
-                if (newValue === null || newValue === undefined || newValue === "") {
+                if (false) {
                     element.value = "";
                 } else {

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:87:57
                 var newValue = ko.utils.unwrapObservable(valueAccessor());
                 var elementValue = ko.selectExtensions.readValue(element);
 
-                if (elementValueBeforeEvent !== null && newValue === elementValueBeforeEvent) {
+                if (elementValueBeforeEvent !== null && newValue !== elementValueBeforeEvent) {
                     ko.utils.setTimeout(updateFromModel, 0);
                     return;

[Survived] EqualityOperator
src/binding/defaultBindings/value.js:92:39
                     return;
                 }
 
-                var valueHasChanged = newValue !== elementValue;
+                var valueHasChanged = newValue === elementValue;
 
                 if (valueHasChanged || elementValue === undefined) {

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:94:21
 
                 var valueHasChanged = newValue !== elementValue;
 
-                if (valueHasChanged || elementValue === undefined) {
+                if (true) {
                     if (tagName === "select") {
                         var allowUnset = allBindings.get('valueAllowUnset');

[Survived] BlockStatement
src/binding/defaultBindings/value.js:95:47
                 var valueHasChanged = newValue !== elementValue;
 
                 if (valueHasChanged || elementValue === undefined) {
-                    if (tagName === "select") {
-                        var allowUnset = allBindings.get('valueAllowUnset');
-                        ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                        if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
-                            // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
-                            // because you're not allowed to have a model value that disagrees with a visible UI selection.
-                            ko.dependencyDetection.ignore(valueUpdateHandler);
-                        }
-                    } else {
+                    if (tagName === "select") {} else {
                         ko.selectExtensions.writeValue(element, newValue);
                     }

[Survived] ConditionalExpression
src/binding/defaultBindings/value.js:98:29
                     if (tagName === "select") {
                         var allowUnset = allBindings.get('valueAllowUnset');
                         ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                        if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
+                        if (true) {
                             // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                             // because you're not allowed to have a model value that disagrees with a visible UI selection.

[Survived] LogicalOperator
src/binding/defaultBindings/value.js:98:29
                     if (tagName === "select") {
                         var allowUnset = allBindings.get('valueAllowUnset');
                         ko.selectExtensions.writeValue(element, newValue, allowUnset);
-                        if (!allowUnset && newValue !== ko.selectExtensions.readValue(element)) {
+                        if (!allowUnset || newValue !== ko.selectExtensions.readValue(element)) {
                             // If you try to set a model value that can't be represented in an already-populated dropdown, reject that change,
                             // because you're not allowed to have a model value that disagrees with a visible UI selection.
