[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:58:35
         var mapData;
         var countWaitingForRemove = 0;
 
-        function itemAdded(value) {
-            mapData = { arrayEntry: value, indexObservable: ko.observable(currentArrayIndex++) };
-            newMappingResult.push(mapData);
-            if (!isFirstExecution) {
-                itemsForAfterAddCallbacks.push(mapData);
-            }
-        }
+        function itemAdded(value) {}
 
         function itemMovedOrRetained(oldPosition) {

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:61:36
         function itemAdded(value) {
             mapData = { arrayEntry: value, indexObservable: ko.observable(currentArrayIndex++) };
             newMappingResult.push(mapData);
-            if (!isFirstExecution) {
-                itemsForAfterAddCallbacks.push(mapData);
-            }
+            if (!isFirstExecution) {}
         }
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:61:17
         function itemAdded(value) {
             mapData = { arrayEntry: value, indexObservable: ko.observable(currentArrayIndex++) };
             newMappingResult.push(mapData);
-            if (!isFirstExecution) {
+            if (false) {
                 itemsForAfterAddCallbacks.push(mapData);
             }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:66:51
             }
         }
 
-        function itemMovedOrRetained(oldPosition) {
-            mapData = lastMappingResult[oldPosition];
-            if (currentArrayIndex !== mapData.indexObservable.peek())
-                itemsForMoveCallbacks.push(mapData);
-            // Since updating the index might change the nodes, do so before calling fixUpContinuousNodeArray
-            mapData.indexObservable(currentArrayIndex++);
-            ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode);
-            newMappingResult.push(mapData);
-        }
+        function itemMovedOrRetained(oldPosition) {}
 
         function callCallback(callback, items) {

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:68:17
 
         function itemMovedOrRetained(oldPosition) {
             mapData = lastMappingResult[oldPosition];
-            if (currentArrayIndex !== mapData.indexObservable.peek())
+            if (false)
                 itemsForMoveCallbacks.push(mapData);
             // Since updating the index might change the nodes, do so before calling fixUpContinuousNodeArray

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:68:17
 
         function itemMovedOrRetained(oldPosition) {
             mapData = lastMappingResult[oldPosition];
-            if (currentArrayIndex !== mapData.indexObservable.peek())
+            if (currentArrayIndex === mapData.indexObservable.peek())
                 itemsForMoveCallbacks.push(mapData);
             // Since updating the index might change the nodes, do so before calling fixUpContinuousNodeArray

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:76:48
             newMappingResult.push(mapData);
         }
 
-        function callCallback(callback, items) {
-            if (callback) {
-                for (var i = 0, n = items.length; i < n; i++) {
-                    ko.utils.arrayForEach(items[i].mappedNodes, function(node) {
-                        callback(node, i, items[i].arrayEntry);
-                    });
-                }
-            }
-        }
+        function callCallback(callback, items) {}
 
         if (isFirstExecution) {

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:78:63
 
         function callCallback(callback, items) {
             if (callback) {
-                for (var i = 0, n = items.length; i < n; i++) {
-                    ko.utils.arrayForEach(items[i].mappedNodes, function(node) {
-                        callback(node, i, items[i].arrayEntry);
-                    });
-                }
+                for (var i = 0, n = items.length; i < n; i++) {}
             }
         }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:79:80
         function callCallback(callback, items) {
             if (callback) {
                 for (var i = 0, n = items.length; i < n; i++) {
-                    ko.utils.arrayForEach(items[i].mappedNodes, function(node) {
-                        callback(node, i, items[i].arrayEntry);
-                    });
+                    ko.utils.arrayForEach(items[i].mappedNodes, function(node) {});
                 }
             }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:89:100
         if (isFirstExecution) {
             ko.utils.arrayForEach(array, itemAdded);
         } else {
-            if (!editScript || (lastMappingResult && lastMappingResult['_countWaitingForRemove'])) {
-                // Compare the provided array against the previous one
-                var lastArray = ko.utils.arrayMap(lastMappingResult, function (x) { return x.arrayEntry; }),
-                    compareOptions = {
-                        'dontLimitMoves': options['dontLimitMoves'],
-                        'sparse': true
-                    };
-                editScript = ko.utils.compareArrays(lastArray, array, compareOptions);
-            }
+            if (!editScript || (lastMappingResult && lastMappingResult['_countWaitingForRemove'])) {}
 
             for (var i = 0, editScriptItem, movedIndex, itemIndex; editScriptItem = editScript[i]; i++) {

[Survived] LogicalOperator
src/binding/editDetection/arrayToDomNodeChildren.js:89:33
         if (isFirstExecution) {
             ko.utils.arrayForEach(array, itemAdded);
         } else {
-            if (!editScript || (lastMappingResult && lastMappingResult['_countWaitingForRemove'])) {
+            if (!editScript || (lastMappingResult || lastMappingResult['_countWaitingForRemove'])) {
                 // Compare the provided array against the previous one
                 var lastArray = ko.utils.arrayMap(lastMappingResult, function (x) { return x.arrayEntry; }),

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:103:26
                 movedIndex = editScriptItem['moved'];
                 itemIndex = editScriptItem['index'];
                 switch (editScriptItem['status']) {
-                    case "deleted":
+                    case "":
                         while (lastMappingResultIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:107:29
                         while (lastMappingResultIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }
-                        if (movedIndex === undefined) {
+                        if (movedIndex !== undefined) {
                             mapData = lastMappingResult[lastMappingResultIndex];
 

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:107:55
                         while (lastMappingResultIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }
-                        if (movedIndex === undefined) {
-                            mapData = lastMappingResult[lastMappingResultIndex];
-
-                            // Stop tracking changes to the mapping for these nodes
-                            if (mapData.dependentObservable) {
-                                mapData.dependentObservable.dispose();
-                                mapData.dependentObservable = undefined;
-                            }
-
-                            // Queue these nodes for later removal
-                            if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
-                                    newMappingResult.push(mapData);
-                                    countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
-                                        mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks.push(mapData);
-                                    }
-                                }
-                                if (mapData) {
-                                    nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);
-                                }
-                            }
-                        }
+                        if (movedIndex === undefined) {}
                         lastMappingResultIndex++;
                         break;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:111:33
                             mapData = lastMappingResult[lastMappingResultIndex];
 
                             // Stop tracking changes to the mapping for these nodes
-                            if (mapData.dependentObservable) {
+                            if (false) {
                                 mapData.dependentObservable.dispose();
                                 mapData.dependentObservable = undefined;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:117:105
                             }
 
                             // Queue these nodes for later removal
-                            if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
-                                    newMappingResult.push(mapData);
-                                    countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
-                                        mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks.push(mapData);
-                                    }
-                                }
-                                if (mapData) {
-                                    nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);
-                                }
-                            }
+                            if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {}
                         }
                         lastMappingResultIndex++;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:118:62
 
                             // Queue these nodes for later removal
                             if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
-                                    newMappingResult.push(mapData);
-                                    countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
-                                        mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks.push(mapData);
-                                    }
-                                }
+                                if (options['beforeRemove']) {}
                                 if (mapData) {
                                     nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:118:37
 
                             // Queue these nodes for later removal
                             if (ko.utils.fixUpContinuousNodeArray(mapData.mappedNodes, domNode).length) {
-                                if (options['beforeRemove']) {
+                                if (true) {
                                     newMappingResult.push(mapData);
                                     countWaitingForRemove++;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:121:87
                                 if (options['beforeRemove']) {
                                     newMappingResult.push(mapData);
                                     countWaitingForRemove++;
-                                    if (mapData.arrayEntry === deletedItemDummyValue) {
-                                        mapData = null;
-                                    } else {
+                                    if (mapData.arrayEntry === deletedItemDummyValue) {} else {
                                         itemsForBeforeRemoveCallbacks.push(mapData);
                                     }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:123:44
                                     countWaitingForRemove++;
                                     if (mapData.arrayEntry === deletedItemDummyValue) {
                                         mapData = null;
-                                    } else {
-                                        itemsForBeforeRemoveCallbacks.push(mapData);
-                                    }
+                                    } else {}
                                 }
                                 if (mapData) {

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:127:37
                                         itemsForBeforeRemoveCallbacks.push(mapData);
                                     }
                                 }
-                                if (mapData) {
+                                if (true) {
                                     nodesToDelete.push.apply(nodesToDelete, mapData.mappedNodes);
                                 }

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:135:26
                         lastMappingResultIndex++;
                         break;
 
-                    case "added":
+                    case "":
                         while (currentArrayIndex < itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:136:32
                         break;
 
                     case "added":
-                        while (currentArrayIndex < itemIndex) {
+                        while (currentArrayIndex <= itemIndex) {
                             itemMovedOrRetained(lastMappingResultIndex++);
                         }

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:136:63
                         break;
 
                     case "added":
-                        while (currentArrayIndex < itemIndex) {
-                            itemMovedOrRetained(lastMappingResultIndex++);
-                        }
+                        while (currentArrayIndex < itemIndex) {}
                         if (movedIndex !== undefined) {
                             itemsToMoveFirstIndexes.push(newMappingResult.length);

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:143:54
                             itemsToMoveFirstIndexes.push(newMappingResult.length);
                             itemMovedOrRetained(movedIndex);
                         } else {
-                            itemAdded(editScriptItem['value']);
+                            itemAdded(editScriptItem[""]);
                         }
                         break;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:149:54
                 }
             }
 
-            while (currentArrayIndex < array.length) {
-                itemMovedOrRetained(lastMappingResultIndex++);
-            }
+            while (currentArrayIndex < array.length) {}
 
             // Record that the current view may still contain deleted items

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:149:20
                 }
             }
 
-            while (currentArrayIndex < array.length) {
+            while (currentArrayIndex <= array.length) {
                 itemMovedOrRetained(lastMappingResultIndex++);
             }

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:162:30
         ko.utils.domData.set(domNode, lastMappingResultDomDataKey, newMappingResult);
 
         // Call beforeMove first before any changes have been made to the DOM
-        callCallback(options['beforeMove'], itemsForMoveCallbacks);
+        callCallback(options[""], itemsForMoveCallbacks);
 
         // Next remove nodes for deleted items (or just clean if there's a beforeRemove callback)

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:165:54
         callCallback(options['beforeMove'], itemsForMoveCallbacks);
 
         // Next remove nodes for deleted items (or just clean if there's a beforeRemove callback)
-        ko.utils.arrayForEach(nodesToDelete, options['beforeRemove'] ? ko.cleanNode : ko.removeNode);
+        ko.utils.arrayForEach(nodesToDelete, options[""] ? ko.cleanNode : ko.removeNode);
 
         var i, j, nextNodeInDom, lastNode, nodeToInsert, mappedNodes, activeElement;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:178:45
         }
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
-        if (itemsToMoveFirstIndexes.length) {
-            while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
-                mapData = newMappingResult[i];
-                for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
-                        lastNode = mappedNodes[mappedNodes.length-1];
-                        break;
-                    }
-                }
-                for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
-                    ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
-                }
-            }
-        }
+        if (itemsToMoveFirstIndexes.length) {}
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:179:72
 
         // Try to reduce overall moved nodes by first moving the ones that were marked as moved by the edit script
         if (itemsToMoveFirstIndexes.length) {
-            while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
-                mapData = newMappingResult[i];
-                for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
-                        lastNode = mappedNodes[mappedNodes.length-1];
-                        break;
-                    }
-                }
-                for (j = 0; nodeToInsert = mapData.mappedNodes[j]; lastNode = nodeToInsert, j++) {
-                    ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
-                }
-            }
+            while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {}
         }
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:182:25
             while ((i = itemsToMoveFirstIndexes.shift()) != undefined) {
                 mapData = newMappingResult[i];
                 for (lastNode = undefined; i; ) {
-                    if ((mappedNodes = newMappingResult[--i].mappedNodes) && mappedNodes.length) {
+                    if (true) {
                         lastNode = mappedNodes[mappedNodes.length-1];
                         break;

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:194:77
         }
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
-        for (i = 0, nextNodeInDom = ko.virtualElements.firstChild(domNode); mapData = newMappingResult[i]; i++) {
+        for (i = 0, nextNodeInDom = ko.virtualElements.firstChild(domNode); false; i++) {
             // Get nodes for newly added items
             if (!mapData.mappedNodes)

[Survived] UpdateOperator
src/binding/editDetection/arrayToDomNodeChildren.js:194:108
         }
 
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
-        for (i = 0, nextNodeInDom = ko.virtualElements.firstChild(domNode); mapData = newMappingResult[i]; i++) {
+        for (i = 0, nextNodeInDom = ko.virtualElements.firstChild(domNode); mapData = newMappingResult[i]; i--) {
             // Get nodes for newly added items
             if (!mapData.mappedNodes)

[Survived] BooleanLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:196:17
         // Next add/reorder the remaining items (will include deleted items if there's a beforeRemove callback)
         for (i = 0, nextNodeInDom = ko.virtualElements.firstChild(domNode); mapData = newMappingResult[i]; i++) {
             // Get nodes for newly added items
-            if (!mapData.mappedNodes)
+            if (mapData.mappedNodes)
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:200:25
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 
             // Put nodes in the right place if they aren't there already
-            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {
+            for (j = 0; false; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {
                 if (nodeToInsert !== nextNodeInDom)
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:200:136
                 ko.utils.extend(mapData, mapNodeAndRefreshWhenChanged(domNode, mapping, mapData.arrayEntry, callbackAfterAddingNodes, mapData.indexObservable));
 
             // Put nodes in the right place if they aren't there already
-            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {
-                if (nodeToInsert !== nextNodeInDom)
-                    ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
-            }
+            for (j = 0; nodeToInsert = mapData.mappedNodes[j]; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {}
 
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:201:21
 
             // Put nodes in the right place if they aren't there already
             for (j = 0; nodeToInsert = mapData.mappedNodes[j]; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {
-                if (nodeToInsert !== nextNodeInDom)
+                if (nodeToInsert === nextNodeInDom)
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
             }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:201:21
 
             // Put nodes in the right place if they aren't there already
             for (j = 0; nodeToInsert = mapData.mappedNodes[j]; nextNodeInDom = nodeToInsert.nextSibling, lastNode = nodeToInsert, j++) {
-                if (nodeToInsert !== nextNodeInDom)
+                if (true)
                     ko.virtualElements.insertAfter(domNode, nodeToInsert, lastNode);
             }

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:206:17
             }
 
             // Run the callbacks for newly added nodes (for example, to apply bindings, etc.)
-            if (!mapData.initialized && callbackAfterAddingNodes) {
+            if (false) {
                 callbackAfterAddingNodes(mapData.arrayEntry, mapData.mappedNodes, mapData.indexObservable);
                 mapData.initialized = true;

[Survived] BlockStatement
src/binding/editDetection/arrayToDomNodeChildren.js:214:84
         }
 
         // Restore the focused element if it had lost focus
-        if (activeElement && domNode.ownerDocument.activeElement != activeElement) {
-            activeElement.focus();
-        }
+        if (activeElement && domNode.ownerDocument.activeElement != activeElement) {}
 
         // If there's a beforeRemove callback, call it after reordering.

[Survived] ConditionalExpression
src/binding/editDetection/arrayToDomNodeChildren.js:214:13
         }
 
         // Restore the focused element if it had lost focus
-        if (activeElement && domNode.ownerDocument.activeElement != activeElement) {
+        if (true) {
             activeElement.focus();
         }

[Survived] EqualityOperator
src/binding/editDetection/arrayToDomNodeChildren.js:228:21
         // Replace the stored values of deleted items with a dummy value. This provides two benefits: it marks this item
         // as already "removed" so we won't call beforeRemove for it again, and it ensures that the item won't match up
         // with an actual item in the array and appear as "retained" or "moved".
-        for (i = 0; i < itemsForBeforeRemoveCallbacks.length; ++i) {
+        for (i = 0; i <= itemsForBeforeRemoveCallbacks.length; ++i) {
             itemsForBeforeRemoveCallbacks[i].arrayEntry = deletedItemDummyValue;
         }

[Survived] StringLiteral
src/binding/editDetection/arrayToDomNodeChildren.js:233:30
         }
 
         // Finally call afterMove and afterAdd callbacks
-        callCallback(options['afterMove'], itemsForMoveCallbacks);
+        callCallback(options[""], itemsForMoveCallbacks);
         callCallback(options['afterAdd'], itemsForAfterAddCallbacks);
     }
