[Survived] BlockStatement
src/components/defaultLoader.js:194:72
         }
     }
 
-    function possiblyGetConfigFromAmd(errorCallback, config, callback) {
-        if (typeof config['require'] === 'string') {
-            // The config is the value of an AMD module
-            if (amdRequire || window['require']) {
-                (amdRequire || window['require'])([config['require']], callback);
-            } else {
-                errorCallback('Uses require, but no AMD loader is present');
-            }
-        } else {
-            callback(config);
-        }
-    }
+    function possiblyGetConfigFromAmd(errorCallback, config, callback) {}
 
     function makeErrorCallback(componentName) {

[Survived] ConditionalExpression
src/components/defaultLoader.js:198:18
         if (typeof config['require'] === 'string') {
             // The config is the value of an AMD module
             if (amdRequire || window['require']) {
-                (amdRequire || window['require'])([config['require']], callback);
+                (false)([config['require']], callback);
             } else {
                 errorCallback('Uses require, but no AMD loader is present');

[Survived] ConditionalExpression
src/components/defaultLoader.js:198:18
         if (typeof config['require'] === 'string') {
             // The config is the value of an AMD module
             if (amdRequire || window['require']) {
-                (amdRequire || window['require'])([config['require']], callback);
+                (true)([config['require']], callback);
             } else {
                 errorCallback('Uses require, but no AMD loader is present');

[Survived] BlockStatement
src/components/defaultLoader.js:199:20
             // The config is the value of an AMD module
             if (amdRequire || window['require']) {
                 (amdRequire || window['require'])([config['require']], callback);
-            } else {
-                errorCallback('Uses require, but no AMD loader is present');
-            }
+            } else {}
         } else {
             callback(config);
