[Survived] BlockStatement
src/templating/templating.js:243:69
     };
 
     var templateComputedDomDataKey = ko.utils.domData.nextKey();
-    function disposeOldComputedAndStoreNewOne(element, newComputed) {
-        var oldComputed = ko.utils.domData.get(element, templateComputedDomDataKey);
-        if (oldComputed && (typeof(oldComputed.dispose) == 'function'))
-            oldComputed.dispose();
-        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && (!newComputed.isActive || newComputed.isActive())) ? newComputed : undefined);
-    }
+    function disposeOldComputedAndStoreNewOne(element, newComputed) {}
 
     var cleanContainerDomDataKey = ko.utils.domData.nextKey();

[Survived] LogicalOperator
src/templating/templating.js:247:68
         var oldComputed = ko.utils.domData.get(element, templateComputedDomDataKey);
         if (oldComputed && (typeof(oldComputed.dispose) == 'function'))
             oldComputed.dispose();
-        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && (!newComputed.isActive || newComputed.isActive())) ? newComputed : undefined);
+        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed || !newComputed.isActive || newComputed.isActive()) ? newComputed : undefined);
     }
 

[Survived] ConditionalExpression
src/templating/templating.js:247:84
         var oldComputed = ko.utils.domData.get(element, templateComputedDomDataKey);
         if (oldComputed && (typeof(oldComputed.dispose) == 'function'))
             oldComputed.dispose();
-        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && (!newComputed.isActive || newComputed.isActive())) ? newComputed : undefined);
+        ko.utils.domData.set(element, templateComputedDomDataKey, (newComputed && (true)) ? newComputed : undefined);
     }
 

[Survived] ConditionalExpression
src/templating/templating.js:255:17
         'init': function(element, valueAccessor) {
             // Support anonymous templates
             var bindingValue = ko.utils.unwrapObservable(valueAccessor());
-            if (typeof bindingValue == "string" || bindingValue['name']) {
+            if (true) {
                 // It's a named template - clear the element
                 ko.virtualElements.emptyNode(element);

[Survived] ConditionalExpression
src/templating/templating.js:255:17
         'init': function(element, valueAccessor) {
             // Support anonymous templates
             var bindingValue = ko.utils.unwrapObservable(valueAccessor());
-            if (typeof bindingValue == "string" || bindingValue['name']) {
+            if (false) {
                 // It's a named template - clear the element
                 ko.virtualElements.emptyNode(element);

[Survived] ConditionalExpression
src/templating/templating.js:258:24
             if (typeof bindingValue == "string" || bindingValue['name']) {
                 // It's a named template - clear the element
                 ko.virtualElements.emptyNode(element);
-            } else if ('nodes' in bindingValue) {
+            } else if (false) {
                 // We've been given an array of DOM nodes. Save them as the template source.
                 // There is no known use case for the node array being an observable array (if the output

[Survived] ConditionalExpression
src/templating/templating.js:263:29
                 // There is no known use case for the node array being an observable array (if the output
                 // varies, put that behavior *into* your template - that's what templates are for), and
                 // the implementation would be a mess, so assert that it's not observable.
-                var nodes = bindingValue['nodes'] || [];
+                var nodes = true;
                 if (ko.isObservable(nodes)) {
                     throw new Error('The "nodes" option must be a plain, non-observable array.');

[Survived] StringLiteral
src/templating/templating.js:265:37
                 // the implementation would be a mess, so assert that it's not observable.
                 var nodes = bindingValue['nodes'] || [];
                 if (ko.isObservable(nodes)) {
-                    throw new Error('The "nodes" option must be a plain, non-observable array.');
+                    throw new Error("");
                 }
 

[Survived] ConditionalExpression
src/templating/templating.js:270:33
 
                 // If the nodes are already attached to a KO-generated container, we reuse that container without moving the
                 // elements to a new one (we check only the first node, as the nodes are always moved together)
-                var container = nodes[0] && nodes[0].parentNode;
+                var container = false;
                 if (!container || !ko.utils.domData.get(container, cleanContainerDomDataKey)) {
                     container = ko.utils.moveCleanedNodesToContainerElement(nodes);

[Survived] ConditionalExpression
src/templating/templating.js:271:21
                 // If the nodes are already attached to a KO-generated container, we reuse that container without moving the
                 // elements to a new one (we check only the first node, as the nodes are always moved together)
                 var container = nodes[0] && nodes[0].parentNode;
-                if (!container || !ko.utils.domData.get(container, cleanContainerDomDataKey)) {
+                if (true) {
                     container = ko.utils.moveCleanedNodesToContainerElement(nodes);
                     ko.utils.domData.set(container, cleanContainerDomDataKey, true);

[Survived] EqualityOperator
src/templating/templating.js:280:21
             } else {
                 // It's an anonymous template - store the element contents, then clear the element
                 var templateNodes = ko.virtualElements.childNodes(element);
-                if (templateNodes.length > 0) {
+                if (templateNodes.length <= 0) {
                     var container = ko.utils.moveCleanedNodesToContainerElement(templateNodes); // This also removes the nodes from their current parent
                     new ko.templateSources.anonymousTemplate(element)['nodes'](container);

[Survived] ConditionalExpression
src/templating/templating.js:280:21
             } else {
                 // It's an anonymous template - store the element contents, then clear the element
                 var templateNodes = ko.virtualElements.childNodes(element);
-                if (templateNodes.length > 0) {
+                if (true) {
                     var container = ko.utils.moveCleanedNodesToContainerElement(templateNodes); // This also removes the nodes from their current parent
                     new ko.templateSources.anonymousTemplate(element)['nodes'](container);

[Survived] ConditionalExpression
src/templating/templating.js:296:17
                 templateComputed = null,
                 templateName;
 
-            if (typeof options == "string") {
+            if (false) {
                 templateName = value;
                 options = {};

[Survived] BlockStatement
src/templating/templating.js:299:20
             if (typeof options == "string") {
                 templateName = value;
                 options = {};
-            } else {
-                templateName = options['name'];
-
-                // Support "if"/"ifnot" conditions
-                if ('if' in options)
-                    shouldDisplay = ko.utils.unwrapObservable(options['if']);
-                if (shouldDisplay && 'ifnot' in options)
-                    shouldDisplay = !ko.utils.unwrapObservable(options['ifnot']);
-            }
+            } else {}
 
             if ('foreach' in options) {

[Survived] StringLiteral
src/templating/templating.js:306:72
                 if ('if' in options)
                     shouldDisplay = ko.utils.unwrapObservable(options['if']);
                 if (shouldDisplay && 'ifnot' in options)
-                    shouldDisplay = !ko.utils.unwrapObservable(options['ifnot']);
+                    shouldDisplay = !ko.utils.unwrapObservable(options[""]);
             }
 

[Survived] BlockStatement
src/templating/templating.js:309:39
                     shouldDisplay = !ko.utils.unwrapObservable(options['ifnot']);
             }
 
-            if ('foreach' in options) {
-                // Render once for each data point (treating data set as empty if shouldDisplay==false)
-                var dataArray = (shouldDisplay && options['foreach']) || [];
-                templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
-            } else if (!shouldDisplay) {
+            if ('foreach' in options) {} else if (!shouldDisplay) {
                 ko.virtualElements.emptyNode(element);
             } else {

[Survived] LogicalOperator
src/templating/templating.js:311:33
 
             if ('foreach' in options) {
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
-                var dataArray = (shouldDisplay && options['foreach']) || [];
+                var dataArray = shouldDisplay && options['foreach'] && [];
                 templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
             } else if (!shouldDisplay) {

[Survived] LogicalOperator
src/templating/templating.js:312:61
             if ('foreach' in options) {
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
                 var dataArray = (shouldDisplay && options['foreach']) || [];
-                templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
+                templateComputed = ko.renderTemplateForEach(templateName && element, dataArray, options, element, bindingContext);
             } else if (!shouldDisplay) {
                 ko.virtualElements.emptyNode(element);

[Survived] ConditionalExpression
src/templating/templating.js:312:61
             if ('foreach' in options) {
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
                 var dataArray = (shouldDisplay && options['foreach']) || [];
-                templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
+                templateComputed = ko.renderTemplateForEach(false, dataArray, options, element, bindingContext);
             } else if (!shouldDisplay) {
                 ko.virtualElements.emptyNode(element);

[Survived] ConditionalExpression
src/templating/templating.js:313:24
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
                 var dataArray = (shouldDisplay && options['foreach']) || [];
                 templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
-            } else if (!shouldDisplay) {
+            } else if (true) {
                 ko.virtualElements.emptyNode(element);
             } else {

[Survived] ConditionalExpression
src/templating/templating.js:313:24
                 // Render once for each data point (treating data set as empty if shouldDisplay==false)
                 var dataArray = (shouldDisplay && options['foreach']) || [];
                 templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
-            } else if (!shouldDisplay) {
+            } else if (false) {
                 ko.virtualElements.emptyNode(element);
             } else {

[Survived] BlockStatement
src/templating/templating.js:315:20
                 templateComputed = ko.renderTemplateForEach(templateName || element, dataArray, options, element, bindingContext);
             } else if (!shouldDisplay) {
                 ko.virtualElements.emptyNode(element);
-            } else {
-                // Render once for this single data point (or use the viewModel if no data was provided)
-                var innerBindingContext = bindingContext;
-                if ('data' in options) {
-                    innerBindingContext = bindingContext['createChildContext'](options['data'], {
-                        'as': options['as'],
-                        'noChildContext': options['noChildContext'],
-                        'exportDependencies': true
-                    });
-                }
-                templateComputed = ko.renderTemplate(templateName || element, innerBindingContext, options, element);
-            }
+            } else {}
 
             // It only makes sense to have a single template computed per element (otherwise which one should have its output displayed?)

[Survived] ConditionalExpression
src/templating/templating.js:318:21
             } else {
                 // Render once for this single data point (or use the viewModel if no data was provided)
                 var innerBindingContext = bindingContext;
-                if ('data' in options) {
+                if (false) {
                     innerBindingContext = bindingContext['createChildContext'](options['data'], {
                         'as': options['as'],

[Survived] StringLiteral
src/templating/templating.js:321:51
                 if ('data' in options) {
                     innerBindingContext = bindingContext['createChildContext'](options['data'], {
                         'as': options['as'],
-                        'noChildContext': options['noChildContext'],
+                        'noChildContext': options[""],
                         'exportDependencies': true
                     });

[Survived] ConditionalExpression
src/templating/templating.js:325:54
                         'exportDependencies': true
                     });
                 }
-                templateComputed = ko.renderTemplate(templateName || element, innerBindingContext, options, element);
+                templateComputed = ko.renderTemplate(true, innerBindingContext, options, element);
             }
 

[Survived] ConditionalExpression
src/templating/templating.js:325:54
                         'exportDependencies': true
                     });
                 }
-                templateComputed = ko.renderTemplate(templateName || element, innerBindingContext, options, element);
+                templateComputed = ko.renderTemplate(false, innerBindingContext, options, element);
             }
 

[Survived] ConditionalExpression
src/templating/templating.js:337:13
     ko.expressionRewriting.bindingRewriteValidators['template'] = function(bindingValue) {
         var parsedBindingValue = ko.expressionRewriting.parseObjectLiteral(bindingValue);
 
-        if ((parsedBindingValue.length == 1) && parsedBindingValue[0]['unknown'])
+        if (true)
             return null; // It looks like a string literal, not an object literal, so treat it as a named template (which is allowed for rewriting)
 

[Survived] StringLiteral
src/templating/templating.js:345:40
         return "This template engine does not support anonymous templates nested within its templates";
     };
 
-    ko.virtualElements.allowedBindings['template'] = true;
+    ko.virtualElements.allowedBindings[""] = true;
 })();
 
