[Survived] BlockStatement
src/utils.domNodeDisposal.js:69:36
             }
         },
 
-        cleanNode : function(node) {
-            // First clean this node, where applicable
-            if (cleanableNodeTypes[node.nodeType]) {
-                cleanSingleNode(node);
-
-                // ... then its descendants, where applicable
-                if (cleanableNodeTypesWithDescendants[node.nodeType]) {
-                    cleanNodesInList(node.getElementsByTagName("*"));
-                }
-            }
-            return node;
-        },
+        cleanNode : function(node) {},
 
         removeNode : function(node) {

[Survived] BlockStatement
src/utils.domNodeDisposal.js:71:52
 
         cleanNode : function(node) {
             // First clean this node, where applicable
-            if (cleanableNodeTypes[node.nodeType]) {
-                cleanSingleNode(node);
-
-                // ... then its descendants, where applicable
-                if (cleanableNodeTypesWithDescendants[node.nodeType]) {
-                    cleanNodesInList(node.getElementsByTagName("*"));
-                }
-            }
+            if (cleanableNodeTypes[node.nodeType]) {}
             return node;
         },

[Survived] ConditionalExpression
src/utils.domNodeDisposal.js:75:21
                 cleanSingleNode(node);
 
                 // ... then its descendants, where applicable
-                if (cleanableNodeTypesWithDescendants[node.nodeType]) {
+                if (false) {
                     cleanNodesInList(node.getElementsByTagName("*"));
                 }

[Survived] ConditionalExpression
src/utils.domNodeDisposal.js:92:17
             // Special support for jQuery here because it's so commonly used.
             // Many jQuery plugins (including jquery.tmpl) store data using jQuery's equivalent of domData
             // so notify it to tear down any resources associated with the node & descendants here.
-            if (jQueryInstance && (typeof jQueryInstance['cleanData'] == "function"))
+            if (true)
                 jQueryInstance['cleanData']([node]);
         }

[Survived] ConditionalExpression
src/utils.domNodeDisposal.js:92:17
             // Special support for jQuery here because it's so commonly used.
             // Many jQuery plugins (including jquery.tmpl) store data using jQuery's equivalent of domData
             // so notify it to tear down any resources associated with the node & descendants here.
-            if (jQueryInstance && (typeof jQueryInstance['cleanData'] == "function"))
+            if (false)
                 jQueryInstance['cleanData']([node]);
         }

[Survived] StringLiteral
src/utils.domNodeDisposal.js:100:17
 ko.cleanNode = ko.utils.domNodeDisposal.cleanNode; // Shorthand name for convenience
 ko.removeNode = ko.utils.domNodeDisposal.removeNode; // Shorthand name for convenience
 ko.exportSymbol('cleanNode', ko.cleanNode);
-ko.exportSymbol('removeNode', ko.removeNode);
+ko.exportSymbol("", ko.removeNode);
 ko.exportSymbol('utils.domNodeDisposal', ko.utils.domNodeDisposal);
 ko.exportSymbol('utils.domNodeDisposal.addDisposeCallback', ko.utils.domNodeDisposal.addDisposeCallback);

[Survived] StringLiteral
src/utils.domNodeDisposal.js:102:17
 ko.exportSymbol('cleanNode', ko.cleanNode);
 ko.exportSymbol('removeNode', ko.removeNode);
 ko.exportSymbol('utils.domNodeDisposal', ko.utils.domNodeDisposal);
-ko.exportSymbol('utils.domNodeDisposal.addDisposeCallback', ko.utils.domNodeDisposal.addDisposeCallback);
+ko.exportSymbol("", ko.utils.domNodeDisposal.addDisposeCallback);
 ko.exportSymbol('utils.domNodeDisposal.removeDisposeCallback', ko.utils.domNodeDisposal.removeDisposeCallback);
 
