[Survived] BlockStatement
src/virtualElements.js:115:57
             }
         },
 
-        prepend: function(containerNode, nodeToPrepend) {
-            if (!isStartComment(containerNode)) {
-                if (containerNode.firstChild)
-                    containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);
-                else
-                    containerNode.appendChild(nodeToPrepend);
-            } else {
-                // Start comments must always have a parent and at least one following sibling (the end comment)
-                containerNode.parentNode.insertBefore(nodeToPrepend, containerNode.nextSibling);
-            }
-        },
+        prepend: function(containerNode, nodeToPrepend) {},
 
         insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {

[Survived] BlockStatement
src/virtualElements.js:116:49
         },
 
         prepend: function(containerNode, nodeToPrepend) {
-            if (!isStartComment(containerNode)) {
-                if (containerNode.firstChild)
-                    containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);
-                else
-                    containerNode.appendChild(nodeToPrepend);
-            } else {
+            if (!isStartComment(containerNode)) {} else {
                 // Start comments must always have a parent and at least one following sibling (the end comment)
                 containerNode.parentNode.insertBefore(nodeToPrepend, containerNode.nextSibling);

[Survived] ConditionalExpression
src/virtualElements.js:116:17
         },
 
         prepend: function(containerNode, nodeToPrepend) {
-            if (!isStartComment(containerNode)) {
+            if (true) {
                 if (containerNode.firstChild)
                     containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);

[Survived] ConditionalExpression
src/virtualElements.js:117:21
 
         prepend: function(containerNode, nodeToPrepend) {
             if (!isStartComment(containerNode)) {
-                if (containerNode.firstChild)
+                if (false)
                     containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);
                 else

[Survived] ConditionalExpression
src/virtualElements.js:117:21
 
         prepend: function(containerNode, nodeToPrepend) {
             if (!isStartComment(containerNode)) {
-                if (containerNode.firstChild)
+                if (true)
                     containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);
                 else

[Survived] BlockStatement
src/virtualElements.js:121:20
                     containerNode.insertBefore(nodeToPrepend, containerNode.firstChild);
                 else
                     containerNode.appendChild(nodeToPrepend);
-            } else {
-                // Start comments must always have a parent and at least one following sibling (the end comment)
-                containerNode.parentNode.insertBefore(nodeToPrepend, containerNode.nextSibling);
-            }
+            } else {}
         },
 

[Survived] BlockStatement
src/virtualElements.js:127:77
             }
         },
 
-        insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {
-            if (!insertAfterNode) {
-                ko.virtualElements.prepend(containerNode, nodeToInsert);
-            } else if (!isStartComment(containerNode)) {
-                // Insert after insertion point
-                if (insertAfterNode.nextSibling)
-                    containerNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
-                else
-                    containerNode.appendChild(nodeToInsert);
-            } else {
-                // Children of start comments must always have a parent and at least one following sibling (the end comment)
-                containerNode.parentNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
-            }
-        },
+        insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {},
 
         firstChild: function(node) {

[Survived] ConditionalExpression
src/virtualElements.js:128:17
         },
 
         insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {
-            if (!insertAfterNode) {
+            if (false) {
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
             } else if (!isStartComment(containerNode)) {

[Survived] ConditionalExpression
src/virtualElements.js:130:24
         insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {
             if (!insertAfterNode) {
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
-            } else if (!isStartComment(containerNode)) {
+            } else if (false) {
                 // Insert after insertion point
                 if (insertAfterNode.nextSibling)

[Survived] BlockStatement
src/virtualElements.js:130:56
         insertAfter: function(containerNode, nodeToInsert, insertAfterNode) {
             if (!insertAfterNode) {
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
-            } else if (!isStartComment(containerNode)) {
-                // Insert after insertion point
-                if (insertAfterNode.nextSibling)
-                    containerNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
-                else
-                    containerNode.appendChild(nodeToInsert);
-            } else {
+            } else if (!isStartComment(containerNode)) {} else {
                 // Children of start comments must always have a parent and at least one following sibling (the end comment)
                 containerNode.parentNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);

[Survived] ConditionalExpression
src/virtualElements.js:132:21
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
             } else if (!isStartComment(containerNode)) {
                 // Insert after insertion point
-                if (insertAfterNode.nextSibling)
+                if (false)
                     containerNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
                 else

[Survived] ConditionalExpression
src/virtualElements.js:132:21
                 ko.virtualElements.prepend(containerNode, nodeToInsert);
             } else if (!isStartComment(containerNode)) {
                 // Insert after insertion point
-                if (insertAfterNode.nextSibling)
+                if (true)
                     containerNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
                 else

[Survived] BlockStatement
src/virtualElements.js:136:20
                     containerNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
                 else
                     containerNode.appendChild(nodeToInsert);
-            } else {
-                // Children of start comments must always have a parent and at least one following sibling (the end comment)
-                containerNode.parentNode.insertBefore(nodeToInsert, insertAfterNode.nextSibling);
-            }
+            } else {}
         },
 

[Survived] ConditionalExpression
src/virtualElements.js:143:17
         },
 
         firstChild: function(node) {
-            if (!isStartComment(node)) {
+            if (false) {
                 if (node.firstChild && isEndComment(node.firstChild)) {
                     throw new Error("Found invalid end comment, as the first child of " + node);

[Survived] ConditionalExpression
src/virtualElements.js:144:21
 
         firstChild: function(node) {
             if (!isStartComment(node)) {
-                if (node.firstChild && isEndComment(node.firstChild)) {
+                if (true) {
                     throw new Error("Found invalid end comment, as the first child of " + node);
                 }

[Survived] LogicalOperator
src/virtualElements.js:148:24
                     throw new Error("Found invalid end comment, as the first child of " + node);
                 }
                 return node.firstChild;
-            } else if (!node.nextSibling || isEndComment(node.nextSibling)) {
+            } else if (!node.nextSibling && isEndComment(node.nextSibling)) {
                 return null;
             } else {

[Survived] BooleanLiteral
src/virtualElements.js:148:24
                     throw new Error("Found invalid end comment, as the first child of " + node);
                 }
                 return node.firstChild;
-            } else if (!node.nextSibling || isEndComment(node.nextSibling)) {
+            } else if (node.nextSibling || isEndComment(node.nextSibling)) {
                 return null;
             } else {

[Survived] ConditionalExpression
src/virtualElements.js:156:17
         },
 
         nextSibling: function(node) {
-            if (isStartComment(node)) {
+            if (true) {
                 node = getMatchingEndComment(node);
             }

[Survived] ConditionalExpression
src/virtualElements.js:161:21
             }
 
             if (node.nextSibling && isEndComment(node.nextSibling)) {
-                if (isUnmatchedEndComment(node.nextSibling)) {
+                if (false) {
                     throw Error("Found end comment without a matching opening comment, as child of " + node);
                 } else {

[Survived] BooleanLiteral
src/virtualElements.js:182:17
             // Workaround for https://github.com/SteveSanderson/knockout/issues/155
             // (IE <= 8 or IE 9 quirks mode parses your HTML weirdly, treating closing </li> tags as if they don't exist, thereby moving comment nodes
             // that are direct descendants of <ul> into the preceding <li>)
-            if (!htmlTagsWithOptionallyClosingChildren[ko.utils.tagNameLower(elementVerified)])
+            if (htmlTagsWithOptionallyClosingChildren[ko.utils.tagNameLower(elementVerified)])
                 return;
 

[Survived] BlockStatement
src/virtualElements.js:190:51
             var childNode = elementVerified.firstChild;
             if (childNode) {
                 do {
-                    if (childNode.nodeType === 1) {
-                        var unbalancedTags = getUnbalancedChildTags(childNode);
-                        if (unbalancedTags) {
-                            // Fix up the DOM by moving the unbalanced tags to where they most likely were intended to be placed - *after* the child
-                            var nodeToInsertBefore = childNode.nextSibling;
-                            for (var i = 0; i < unbalancedTags.length; i++) {
-                                if (nodeToInsertBefore)
-                                    elementVerified.insertBefore(unbalancedTags[i], nodeToInsertBefore);
-                                else
-                                    elementVerified.appendChild(unbalancedTags[i]);
-                            }
-                        }
-                    }
+                    if (childNode.nodeType === 1) {}
                 } while (childNode = childNode.nextSibling);
             }

[Survived] BlockStatement
src/virtualElements.js:192:45
                 do {
                     if (childNode.nodeType === 1) {
                         var unbalancedTags = getUnbalancedChildTags(childNode);
-                        if (unbalancedTags) {
-                            // Fix up the DOM by moving the unbalanced tags to where they most likely were intended to be placed - *after* the child
-                            var nodeToInsertBefore = childNode.nextSibling;
-                            for (var i = 0; i < unbalancedTags.length; i++) {
-                                if (nodeToInsertBefore)
-                                    elementVerified.insertBefore(unbalancedTags[i], nodeToInsertBefore);
-                                else
-                                    elementVerified.appendChild(unbalancedTags[i]);
-                            }
-                        }
+                        if (unbalancedTags) {}
                     }
                 } while (childNode = childNode.nextSibling);

[Survived] ConditionalExpression
src/virtualElements.js:195:45
                         if (unbalancedTags) {
                             // Fix up the DOM by moving the unbalanced tags to where they most likely were intended to be placed - *after* the child
                             var nodeToInsertBefore = childNode.nextSibling;
-                            for (var i = 0; i < unbalancedTags.length; i++) {
+                            for (var i = 0; false; i++) {
                                 if (nodeToInsertBefore)
                                     elementVerified.insertBefore(unbalancedTags[i], nodeToInsertBefore);
